&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	Если ЭтотОбъект.Параметры.Свойство("ПользовательскиеНастройки") Тогда
		Если ЭтотОбъект.Параметры.ПользовательскиеНастройки <> Неопределено Тогда
			Для каждого ПараметрОтчета Из ЭтотОбъект.Параметры.ПользовательскиеНастройки.ПараметрыДанных.Элементы Цикл
				ИскПараметр = Настройки.Элементы.Найти(ПараметрОтчета.ИдентификаторПользовательскойНастройки);
				Если ИскПараметр <> Неопределено Тогда
					ИскПараметр.Значение = ПараметрОтчета.Значение;
					ИскПараметр.Использование = ПараметрОтчета.Использование;
					//ЗаполнитьЗначенияСвойств(ИскПараметр, ПараметрОтчета.Параметр);
				КонецЕсли; 
			КонецЦикла; 	
		КонецЕсли; 
	КонецЕсли;
	Отчет.КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(Настройки);
КонецПроцедуры
