////////////////////////////////////////////////////////////////////////////////
// МОДУЛЬ СОДЕРЖИТ РЕАЛИЗАЦИЮ МЕХАНИКИ РАБОТЫ С ФАЙЛАМИ - Интерфейсные функции
// 

// Создает карточку Файла в БД вместе с версией.
//
// Параметры:
//  Владелец - владелец файла - будет установлен в реквизит ВладелецФайла у созданного файла.
//  ПутьКФайлуНаДиске  - Строка - полный путь (включающий имя и расширение) к файлу на диске (файл должен находиться на сервере).
//
// Возвращаемое значение:
//  СправочникСсылка.Файлы - созданный файл.
//
Функция СоздатьФайлНаОсновеФайлаНаДиске(
	Владелец, 
	ПутьКФайлуНаДиске, 
	ИмяФайла = Неопределено, 
	ИдентификаторФайла = Неопределено,
	РазрешитьИзвлекатьТекст = Ложь) Экспорт
	
	Файл = Новый Файл(ПутьКФайлуНаДиске);
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКФайлуНаДиске);
	АдресВременногоХранилищаФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	
	АдресВременногоХранилищаТекста = "";
	
	Если РазрешитьИзвлекатьТекст Тогда
		ИзвлекатьТекстыФайловНаСервере = РаботаСФайламиВызовСервера.ПолучитьИзвлекатьТекстыФайловНаСервере();
		Если ИзвлекатьТекстыФайловНаСервере = Ложь Тогда
			
			// сами пытаемся извлечь текст  - если сервер под Windows
			Если ФайловыеФункции.ЭтоПлатформаWindows() Тогда
				Текст = ФайловыеФункцииКлиентСервер.ИзвлечьТекст(ПутьКФайлуНаДиске);
				АдресВременногоХранилищаТекста = Новый ХранилищеЗначения(Текст);
			КонецЕсли;
			
		Иначе
			АдресВременногоХранилищаТекста = ""; // фоновое задание извлечения текста извлечет текст
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяФайла = Неопределено Тогда
		ИмяФайла = Файл.ИмяБезРасширения;
	КонецЕсли;
	
	ФайлСсылка = РаботаСФайламиВызовСервера.СоздатьФайлСВерсией(
		Владелец,
		ИмяФайла,
		ФайловыеФункцииКлиентСервер.РасширениеБезТочки(Файл.Расширение),
		Файл.ПолучитьВремяИзменения(),
		Файл.ПолучитьУниверсальноеВремяИзменения(),
		Файл.Размер(),
		АдресВременногоХранилищаФайла,
		АдресВременногоХранилищаТекста,
		Ложь,,,,,,,,,,
		ИдентификаторФайла);
		
	Возврат ФайлСсылка;
	
КонецФункции
