
&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Параметры.БизнесПроцесс) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	БизнесПроцесс = Параметры.БизнесПроцесс;
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьДатуИВремяВСрокахЗадач") Тогда
		Элементы.СтарыйСрок.Формат = "ДФ='dd.MM.yyyy'";
		Элементы.НовыйСрок.Формат = "ДФ='dd.MM.yyyy'";
		Элементы.СтарыйСрок.Ширина = 5;
		Элементы.НовыйСрок.Ширина = 5;
	КонецЕсли;
	
	Если Параметры.Свойство("СкрытьКоманднуюПанель") Тогда
		Элементы.ГруппаКоманднаяПанельФормы.Видимость = Ложь;
		Элементы.БизнесПроцесс.Видимость = Ложь;
	КонецЕсли;
	
	Предметы = Новый Массив();
	Предметы.Добавить(БизнесПроцесс);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадачаИсполнителя.Ссылка
		|ИЗ
		|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
		|ГДЕ
		|	ЗадачаИсполнителя.БизнесПроцесс = &БизнесПроцесс";
	Запрос.УстановитьПараметр("БизнесПроцесс", БизнесПроцесс);

	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Предметы.Добавить(Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("Предметы", Предметы);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(ПереносыСроковВыполненияПроцессовИЗадач.Предмет) КАК Колво
		|ИЗ
		|	РегистрСведений.ПереносыСроковВыполненияПроцессовИЗадач КАК ПереносыСроковВыполненияПроцессовИЗадач
		|ГДЕ
		|	ПереносыСроковВыполненияПроцессовИЗадач.Предмет В (&Предметы)";
	
	Запрос.УстановитьПараметр("Предметы", Предметы);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		КоличествоПереносовСроков = Выборка.Колво;
		Заголовок = 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'История переносов сроков процесса (%1)'"),
				Строка(КоличествоПереносовСроков));
	КонецЕсли;
	
КонецПроцедуры
