
#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
//Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы
//Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Рассмотрено(Команда)
	
	Закрыть("Рассмотрено");
	
КонецПроцедуры

&НаКлиенте
Процедура РассмотреноНаИсполнение(Команда)
	
	Закрыть("НаИсполнение");
	
КонецПроцедуры

&НаКлиенте
Процедура РассмотреноНаОзнакомление(Команда)
	
	Закрыть("НаОзнакомление");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//Код процедур и функций
#КонецОбласти

