&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Пользователь") Тогда
		Пользователь = Параметры.Пользователь; 
	Иначе
		Пользователь = Справочники.Пользователи.ПустаяСсылка();	
	КонецЕсли; 
	ПараметрыОтбора = Новый Соответствие();
	ПараметрыОтбора.Вставить("Пользователь", Пользователь);
	УстановитьОтборСписка(Список, ПараметрыОтбора);
КонецПроцедуры

&НаКлиенте
Процедура ОтборПользовательПриИзменении(Элемент)
	ПараметрыОтбора = Новый Соответствие();
	ПараметрыОтбора.Вставить("Пользователь", Пользователь);
	
	УстановитьОтборСписка(Список, ПараметрыОтбора);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСписка(Список, ПараметрыОтбора)
	
	// получатель 
	Пользователь = ПараметрыОтбора.Получить("Пользователь");
	Если Пользователь <> Неопределено Тогда 
		Если Не ЗначениеЗаполнено(Пользователь) Тогда
			ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор,
				"Пользователь");
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,
				"Пользователь",
				Пользователь);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
