
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ПравоДоступа("Добавление", Метаданные.Справочники.ВнутренниеДокументы) Тогда 
		ТипыШаблонов.Добавить(
			"ШаблоныВнутреннихДокументов", 
			НСтр("ru = 'Шаблоны внутренних документов'"));
		Элементы.СписокВнутренниеДокументы.Видимость = Истина;
	КонецЕсли;
	
	Если ПравоДоступа("Добавление", Метаданные.Справочники.ВходящиеДокументы) Тогда
		ТипыШаблонов.Добавить(
			"ШаблоныВходящихДокументов", 
			НСтр("ru = 'Шаблоны входящих документов'"));
		Элементы.СписокВходящиеДокументы.Видимость = Истина;
	КонецЕсли;
	
	Если ПравоДоступа("Добавление", Метаданные.Справочники.ИсходящиеДокументы) Тогда
		ТипыШаблонов.Добавить(
			"ШаблоныИсходящихДокументов", 
			НСтр("ru = 'Шаблоны исходящих документов'"));
		Элементы.СписокИсходящиеДокументы.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипыШаблоновПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.ТипыШаблонов.ТекущаяСтрока;
	
	Элементы.Панели.ТекущаяСтраница = Элементы["Панель" + ТипыШаблонов[ТекущаяСтрока].Значение];
	Элементы.Списки.ТекущаяСтраница = Элементы["Список" + ТипыШаблонов[ТекущаяСтрока].Значение];
	
КонецПроцедуры
