&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Если Объект.ВариантРасчета = Перечисления.ВариантыРасчетов.КаждыеПоследующие Тогда
        Элементы.ПредыдущийЭлемент.Видимость = Истина;
        Элементы.ДляПоследующих.Видимость = Истина;
    Иначе
        Элементы.ПредыдущийЭлемент.Видимость = Ложь;
        Элементы.ДляПоследующих.Видимость = Ложь;
    КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНаименование()
	Объект.Наименование = "";
	Если Объект.НижняяГраницаДиапазона > 0 Тогда
        Если Объект.ВерхняяГраницаДиапазона = 0 Тогда
            Если Объект.ВариантРасчета = ПредопределенноеЗначение("Перечисление.ВариантыРасчетов.КаждыеПоследующие") Тогда
                Объект.Наименование = Объект.Наименование + "На кажд. посл. "+Объект.ДляПоследующих;
            Иначе	
                Объект.Наименование = Объект.Наименование + "Сверх "+Объект.НижняяГраницаДиапазона;
            КонецЕсли; 
		Иначе
			Объект.Наименование = Объект.Наименование + "От "+Объект.НижняяГраницаДиапазона + " до "+Объект.ВерхняяГраницаДиапазона;
		КонецЕсли;
	Иначе	
		Если Объект.ВерхняяГраницаДиапазона > 0 Тогда	
			Объект.Наименование = "До "+Объект.ВерхняяГраницаДиапазона;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
	
&НаКлиенте
Процедура НижняяГраницаДиапазонаПриИзменении(Элемент)
	СоздатьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ВерхняяГраницаДиапазонаПриИзменении(Элемент)
	СоздатьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ВариантРасчетаПриИзменении(Элемент)
	СоздатьНаименование();
    
    Элементы.ПредыдущийЭлемент.Видимость = ПоказатьПредыдущийЭлемент(Объект.ВариантРасчета);
    Элементы.ДляПоследующих.Видимость = ПоказатьПредыдущийЭлемент(Объект.ВариантРасчета);
КонецПроцедуры

&НаКлиенте
Процедура ДляПоследующихПриИзменении(Элемент)
	СоздатьНаименование();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПоказатьПредыдущийЭлемент(ВариантРасчета)
    Возврат ВариантРасчета = Перечисления.ВариантыРасчетов.КаждыеПоследующие;
КонецФункции // ПоказатьПредыдущийЭлемент()

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    Оповестить("Записана колонка таблицы", , Объект.Ссылка);
КонецПроцедуры
