
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает строку, содержащую перечисление полей доступа через запятую
// Это перечисление используется в дальнейшем для передачи в метод 
// ОбщегоНазначения.ПолучитьЗначенияРеквизитов()
Функция ПолучитьПоляДоступа() Экспорт
	
	Возврат "Организация";
	
КонецФункции

// Заполняет переданный дескриптор доступа 
Процедура ЗаполнитьДескрипторДоступа(ОбъектДоступа, ДескрипторДоступа) Экспорт
	
	ДескрипторДоступа.Организация = ОбъектДоступа.Организация;
	
КонецПроцедуры

Функция ПолучитьСтруктуруРазделаНоменклатурыДел() Экспорт 
	
	ПараметрыРазделаНоменклатурыДел = Новый Структура;
	ПараметрыРазделаНоменклатурыДел.Вставить("Год");
	ПараметрыРазделаНоменклатурыДел.Вставить("Индекс");
	ПараметрыРазделаНоменклатурыДел.Вставить("Наименование");
	ПараметрыРазделаНоменклатурыДел.Вставить("Родитель");
	ПараметрыРазделаНоменклатурыДел.Вставить("Подразделение");
	ПараметрыРазделаНоменклатурыДел.Вставить("Организация");
	
	Возврат ПараметрыРазделаНоменклатурыДел;
	
КонецФункции	

Функция СоздатьРазделНоменклатурыДел(СтруктураРазделаНоменклатурыДел) Экспорт 
	
	НовыйРазделНД = Справочники.РазделыНоменклатурыДел.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(НовыйРазделНД, СтруктураРазделаНоменклатурыДел);
	НовыйРазделНД.Записать();
	
	Возврат НовыйРазделНД.Ссылка;
	
КонецФункции

#КонецОбласти

#КонецЕсли


