Процедура ОбработкаПроведения(Отказ, РежимПроведения)

   	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);

   	Документы.мИзменениеСведенийОСотрудниках.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
    
 	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
   
	ЗапасыСервер.ОтразитьИзменениеСведенийОСотрудниках(ДополнительныеСвойства, Движения, Отказ);

	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);

    // Запись сведений о пользователях
	//Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаСведенияОПользователях;
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.Таблица;
    
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
    
	Для каждого СтрокаТаб Из Таблица Цикл
		
        МенеджерЗаписи = РегистрыСведений.СведенияОПользователях.СоздатьМенеджерЗаписи();
        МенеджерЗаписи.Пользователь = СтрокаТаб.Пользователь;
        МенеджерЗаписи.Прочитать();
        
        ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтрокаТаб);
         
        МенеджерЗаписи.Записать();
    КонецЦикла; 
    
    // Изменение групп пользователей
	Тз = Новый ТаблицаЗначений;
	Тз.Колонки.Добавить("Из");
	Тз.Колонки.Добавить("В");
	Тз.Колонки.Добавить("Пользователи");
	
	// Накопление Пользователей для перевода
	Для каждого СтрокаТаб Из Таблица Цикл
		
		Отбор = Новый Структура("Из, В", СтрокаТаб.ГруппаПользователейИз, СтрокаТаб.ГруппаПользователейВ);
		ИскСтроки = Тз.НайтиСтроки(Отбор);
		
		Если ИскСтроки.Количество() = 0 Тогда
			НовСтр = Тз.Добавить();
			НовСтр.Из = СтрокаТаб.ГруппаПользователейИз;
			НовСтр.В = СтрокаТаб.ГруппаПользователейВ;
			НовСтр.Пользователи = Новый Массив;
		Иначе
			НовСтр = ИскСтроки[0];
		КонецЕсли; 
		
		МассивПользователей = НовСтр.Пользователи;
		МассивПользователей.Добавить(СтрокаТаб.Пользователь);
		НовСтр.Пользователи = МассивПользователей;
	КонецЦикла;
	
	// Перевод
	Для каждого Стр Из Тз Цикл
		ПользователиСлужебный.ПеремещениеПользователяВНовуюГруппу(
			Стр.Пользователи, Стр.Из, Стр.В, Истина);
	КонецЦикла; 
		
 	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	ПроведениеСервер.УстановитьРежимПроведения(Проведен, РежимЗаписи, РежимПроведения);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
   	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
   	Документы.мИзменениеСведенийОСотрудниках.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.Таблица;
    
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Восстанавливаем информацию о пользователе
	Для каждого Стр Из Таблица Цикл
		
        МенеджерЗаписи = РегистрыСведений.СведенияОПользователях.СоздатьМенеджерЗаписи();
        МенеджерЗаписи.Пользователь = Стр.Пользователь;
        МенеджерЗаписи.Прочитать();
        
        ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Стр);
		МенеджерЗаписи.Подразделение = Стр.ПодразделениеДо;
         
        МенеджерЗаписи.Записать();
	КонецЦикла; 
	
    // Изменение групп пользователей
	Тз = Новый ТаблицаЗначений;
	Тз.Колонки.Добавить("Из");
	Тз.Колонки.Добавить("В");
	Тз.Колонки.Добавить("Пользователи");
	
	// Накопление Пользователей для перевода
	Для каждого Стр Из Таблица Цикл
		
		Отбор = Новый Структура("Из, В", Стр.ГруппаПользователейИз, Стр.ГруппаПользователейВ);
		ИскСтроки = Тз.НайтиСтроки(Отбор);
		
		Если ИскСтроки.Количество() = 0 Тогда
			НовСтр = Тз.Добавить();
			НовСтр.В = Стр.ГруппаПользователейИз;  // обратный перевод
			НовСтр.Из = Стр.ГруппаПользователейВ;
			НовСтр.Пользователи = Новый Массив;
		Иначе
			НовСтр = ИскСтроки[0];
		КонецЕсли; 
		
		МассивПользователей = НовСтр.Пользователи;
		МассивПользователей.Добавить(Стр.Пользователь);
		НовСтр.Пользователи = МассивПользователей;
	КонецЦикла;
	
	// Перевод
	Для каждого Стр Из Тз Цикл
		ПользователиСлужебный.ПеремещениеПользователяВНовуюГруппу(
			Стр.Пользователи, Стр.Из, Стр.В, Истина);
	КонецЦикла; 
КонецПроцедуры

