////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обмен данными"
// 
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий изменения данных

////////////////////////////////////////////////////////////////////////////////
// Обмен ДО - БП

Процедура ОбменДаннымиДОБППередЗаписью(Источник, Отказ) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью("ОбменБухгалтерияПредприятияДокументооборот", Источник, Отказ);
	
КонецПроцедуры

Процедура ОбменДаннымиДОБППередЗаписьюРегистра(Источник, Отказ, Замещение) Экспорт
	
	Если Источник.Отбор.Найти("Состояние") <> Неопределено
		и Источник.Отбор.Состояние.Значение = Перечисления.СостоянияДокументов.Согласован
		и Источник.Количество() > 0 
		и Источник.Отбор.Найти("Документ") <> Неопределено
		и ТипЗнч(Источник.Отбор.Документ.Значение) = Тип("СправочникСсылка.ВнутренниеДокументы") Тогда
		
		Узлы = ОбменДаннымиПовтИсп.ПолучитьМассивУзловПланаОбмена("ОбменБухгалтерияПредприятияДокументооборот");
		ПланыОбмена.ЗарегистрироватьИзменения(Узлы, Источник.Отбор.Документ.Значение);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбменДаннымиДОБППередУдалением(Источник, Отказ) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением("ОбменБухгалтерияПредприятияДокументооборот", Источник, Отказ);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обмен ДО - УНФ

Процедура ОбменДаннымиДОУНФПередЗаписью(Источник, Отказ) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью("ОбменУправлениеНебольшойФирмойДокументооборот", Источник, Отказ);
	
КонецПроцедуры

Процедура ОбменДаннымиДОУНФПередЗаписьюРегистра(Источник, Отказ, Замещение) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюРегистра("ОбменУправлениеНебольшойФирмойДокументооборот", Источник, Отказ, Замещение);
	
КонецПроцедуры

Процедура ОбменДаннымиДОУНФПередЗаписьюКонстанты(Источник, Отказ) Экспорт
		
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюКонстанты("ОбменУправлениеНебольшойФирмойДокументооборот", Источник, Отказ);
	
КонецПроцедуры

Процедура ОбменДаннымиДОУНФПередУдалением(Источник, Отказ) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением("ОбменУправлениеНебольшойФирмойДокументооборот", Источник, Отказ);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обмен ДО - УП

Процедура ОбменДаннымиДОУППередЗаписью(Источник, Отказ) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью("ОбменУправлениеПредприятиемДокументооборот", Источник, Отказ);
	
КонецПроцедуры

Процедура ОбменДаннымиДОУППередЗаписьюРегистра(Источник, Отказ, Замещение) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюРегистра("ОбменУправлениеПредприятиемДокументооборот", Источник, Отказ, Замещение);
	
КонецПроцедуры

Процедура ОбменДаннымиДОУППередЗаписьюКонстанты(Источник, Отказ) Экспорт
		
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюКонстанты("ОбменУправлениеПредприятиемДокументооборот", Источник, Отказ);
	
КонецПроцедуры

Процедура ОбменДаннымиДОУППередУдалением(Источник, Отказ) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением("ОбменУправлениеПредприятиемДокументооборот", Источник, Отказ);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обмен ДО - УТ

Процедура ОбменДаннымиДОУТПередЗаписью(Источник, Отказ) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью("ОбменУправлениеТорговлейДокументооборот", Источник, Отказ);
	
КонецПроцедуры

Процедура ОбменДаннымиДОУТПередЗаписьюРегистра(Источник, Отказ, Замещение) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюРегистра("ОбменУправлениеТорговлейДокументооборот", Источник, Отказ, Замещение);
	
КонецПроцедуры

Процедура ОбменДаннымиДОУТПередЗаписьюКонстанты(Источник, Отказ) Экспорт
		
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюКонстанты("ОбменУправлениеТорговлейДокументооборот", Источник, Отказ);
	
КонецПроцедуры

Процедура ОбменДаннымиДОУТПередУдалением(Источник, Отказ) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением("ОбменУправлениеТорговлейДокументооборот", Источник, Отказ);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обмен ДО - УПП 1.3

Процедура ОбменДаннымиДОУПП13ПередЗаписью(Источник, Отказ) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью(
		"ОбменУправлениеПроизводственнымПредприятиемДокументооборот", Источник, Отказ);
	
КонецПроцедуры

Процедура ОбменДаннымиДОУПП13ПередЗаписьюРегистра(Источник, Отказ, Замещение) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюРегистра(
		"ОбменУправлениеПроизводственнымПредприятиемДокументооборот", Источник, Отказ, Замещение);
	
КонецПроцедуры

Процедура ОбменДаннымиДОУПП13ПередУдалением(Источник, Отказ) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением(
		"ОбменУправлениеПроизводственнымПредприятиемДокументооборот", Источник, Отказ);
	
КонецПроцедуры
