
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);

	Документы.ОплатаРабот.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	ЗапасыСервер.ОтразитьРасчетыСПокупателями(ДополнительныеСвойства, Движения, Отказ);

	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	Если ДополнительныеСвойства.Свойство("Загрузка") Тогда
	    Возврат;
	КонецЕсли; 
	
    // Запись Даты оплаты этапа договора
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДатыДоговоров;
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ЭтапДоговора", Таблица[0].ЭтапДоговора);
	СтруктураОтбора.Вставить("ВидДатыДоговора", Таблица[0].ВидДатыДоговора);
	
	мРаботаСДоговорами.ЗаписатьДатуДоговора(Таблица, СтруктураОтбора, Отказ);
	
    // Запись Планового срока этапа договора
	ПлановыйСрок = мРаботаСДоговорами.РассчитатьПлановыйСрокВыполненияДоговора(Таблица[0].ЭтапДоговора, Таблица[0].Дата, Истина);
        Если ПлановыйСрок <> Неопределено Тогда
		 //Если ПлановыйСрок <> Дата(1,1,1) Тогда
		ТабДляДаты = Таблица.Скопировать();
		ТабДляДаты.Очистить();
		
		НоваяСтрока = ТабДляДаты.Добавить();
        НоваяСтрока.Период = ТекущаяДата();
		//НоваяСтрока.Период = Таблица[0].Период;
		НоваяСтрока.Дата = ПлановыйСрок;
		НоваяСтрока.Ссылка = Таблица[0].Ссылка;
		НоваяСтрока.Корреспондент = Таблица[0].Корреспондент;
		НоваяСтрока.Договор = Таблица[0].Договор;
		НоваяСтрока.ЭтапДоговора = Таблица[0].ЭтапДоговора;
		НоваяСтрока.Основание = Таблица[0].Основание;
		НоваяСтрока.Установил = Таблица[0].Установил;
		НоваяСтрока.ВидДатыДоговора = Справочники.мВидыДатДоговоров.ПлановыйСрок;
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ЭтапДоговора", Таблица[0].ЭтапДоговора);
		СтруктураОтбора.Вставить("ВидДатыДоговора", Справочники.мВидыДатДоговоров.ПлановыйСрок);
		
		мРаботаСДоговорами.ЗаписатьДатуДоговора(ТабДляДаты, СтруктураОтбора, Отказ);
	КонецЕсли; 
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	ПроведениеСервер.УстановитьРежимПроведения(Проведен, РежимЗаписи, РежимПроведения);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);

КонецПроцедуры

// Процедура - обработчик события "ОбработкаУдаленияПроведения".
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Удаление даты договора
	мРаботаСДоговорами.УдалитьДатуДоговора(Ссылка, Отказ);
КонецПроцедуры
