
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
    
    СтандартнаяОбработка = Ложь;
    
    // Вывод строки Организация
    мОтчетыВызовСервера.ВывестиНазваниеОрганизацииВОтчет(ДокументРезультат);
    
    мУправлениеКолонтитулами.УстановитьКолонтитулы(ДокументРезультат, "ОтчетДляСтатОтчета4УН");
    
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ДокументРезультат.АвтоМасштаб = Истина;
	ДокументРезультат.НижнийКолонтитул.Выводить = Истина;
	ДокументРезультат.НижнийКолонтитул.ТекстСправа = "Стр. [&НомерСтраницы] из [&СтраницВсего]";
	ДокументРезультат.НижнийКолонтитул.НачальнаяСтраница = 2;
  	ДокументРезультат.КлючПараметровПечати = "мОтчетДляСтатОтчета4УН";
    
    // Вывод Заголовка отчета
    мОтчетыВызовСервера.ВывестиЗаголовокВОтчет(КомпоновщикНастроек, ДокументРезультат);
        
    // Вывод Периода отчета
    мОтчетыВызовСервера.ВывестиПериодВОтчет(КомпоновщикНастроек, ДокументРезультат);
    
    // Вывод Параметров отчета
    СтруктураПараметровДляВывода = Новый Структура("СпособПлатежа");
    мОтчетыВызовСервера.ВывестиПараметрыВОтчет(КомпоновщикНастроек, СтруктураПараметровДляВывода, ДокументРезультат);
    
    // Програмный вывод СКД
    мОтчетыВызовСервера.ВывестиТелоОтчета(СхемаКомпоновкиДанных, КомпоновщикНастроек, ДанныеРасшифровки, ДокументРезультат);
    
    // Вывод Подпись ответственного
    мОтчетыВызовСервера.ВывестиПодписьВОтчет(ДокументРезультат);
    
КонецПроцедуры


Функция ПолучитьЗначениеПараметра(ИмяПараметра)
    
    ПараметрДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);
    
    Если ПараметрДанных <> Неопределено Тогда
        
        ПараметрПользовательскойНастройки = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрДанных.ИдентификаторПользовательскойНастройки);
        
        Если ПараметрПользовательскойНастройки <> Неопределено Тогда
            
            Возврат ПараметрПользовательскойНастройки.Значение;
            
        Иначе
            
            Возврат ПараметрДанных.Значение;
            
        КонецЕсли;
        
    КонецЕсли;
    
    Возврат Неопределено;
    
КонецФункции
