
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
//1С-Минск
	//Если Не Пользователи.ЭтоПолноправныйПользователь() Тогда
	//	ТолькоПросмотр = Истина;
	//КонецЕсли;
//1С-Минск

	МожноОбновлятьКлассификатор =
		Не ОбщегоНазначенияПовтИсп.РазделениеВключено() // В модели сервиса обновляется автоматически.
		И Не ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ()   // В узле РИБ обновляется автоматически.
		И ПравоДоступа("Изменение", Метаданные.Справочники.КлассификаторБанковРФ); // Пользователь с необходимыми правами.

	Элементы.ФормаЗагрузитьКлассификатор.Видимость = МожноОбновлятьКлассификатор;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьКлассификатор(Команда)
	ПараметрыФормы = Новый Структура("ОткрытиеИзСписка");
	// begin МиСофт
	//ОткрытьФорму("Справочник.КлассификаторБанковРФ.Форма.ФормаВыбораБанков", ПараметрыФормы, ЭтотОбъект);
	// end МиСофт
КонецПроцедуры

#КонецОбласти
