// возвращает имя макета
Функция ПолучитьИмяМакета(ВариантКарточки) Экспорт 
	Если ВариантКарточки = Перечисления.мВариантыКарточекИсходныхДанных.КарточкаОтвода_Линейно_Площадный Тогда
		ИмяМакета = "КарточкаОтвода_Площадно_Линейный";
	ИначеЕсли ВариантКарточки = Перечисления.мВариантыКарточекИсходныхДанных.КарточкаОтвода_Линейный Тогда
		ИмяМакета = "КарточкаОтвода_Площадно_Линейный";
	ИначеЕсли ВариантКарточки = Перечисления.мВариантыКарточекИсходныхДанных.КарточкаОтвода_Площадно_Линейный Тогда
		ИмяМакета = "КарточкаОтвода_Площадно_Линейный";
	ИначеЕсли ВариантКарточки = Перечисления.мВариантыКарточекИсходныхДанных.КарточкаОтвода_Площадной Тогда
		ИмяМакета = "КарточкаОтвода_Площадно_Линейный";
	ИначеЕсли ВариантКарточки = Перечисления.мВариантыКарточекИсходныхДанных.КарточкаПИР_Линейно_Площадный Тогда
		ИмяМакета = "КарточкаПИР_Площадно_Линейный";
	ИначеЕсли ВариантКарточки = Перечисления.мВариантыКарточекИсходныхДанных.КарточкаПИР_Линейный Тогда
		ИмяМакета = "КарточкаПИР_Площадно_Линейный";
	ИначеЕсли ВариантКарточки = Перечисления.мВариантыКарточекИсходныхДанных.КарточкаПИР_Площадно_Линейный Тогда
		ИмяМакета = "КарточкаПИР_Площадно_Линейный";
	ИначеЕсли ВариантКарточки = Перечисления.мВариантыКарточекИсходныхДанных.КарточкаПИР_Площадной Тогда
		ИмяМакета = "КарточкаПИР_Площадно_Линейный";
	ИначеЕсли ВариантКарточки = Перечисления.мВариантыКарточекИсходныхДанных.КарточкаУстановленияГраниц Тогда
		ИмяМакета = "КарточкаУстановленияГраниц";
	ИначеЕсли ВариантКарточки = Перечисления.мВариантыКарточекИсходныхДанных.КарточкаУстановленияНефиксированныхГраниц Тогда
		ИмяМакета = "КарточкаУстановленияНефиксированныхГраниц";
	ИначеЕсли ВариантКарточки = Перечисления.мВариантыКарточекИсходныхДанных.КарточкаФормированияУчастков Тогда
		ИмяМакета = "КарточкаФормированияУчастков";
	ИначеЕсли ВариантКарточки = Перечисления.мВариантыКарточекИсходныхДанных.КарточкаИзготовлениеПлана Тогда
		ИмяМакета = "КарточкаИзготовлениеПлана";
	ИначеЕсли ВариантКарточки = Перечисления.мВариантыКарточекИсходныхДанных.КарточкаСоставленияОстаточногоКаталога Тогда
		ИмяМакета = "КарточкаСоставленияОстаточногоКаталога";
	ИначеЕсли ВариантКарточки = Перечисления.мВариантыКарточекИсходныхДанных.КарточкаУниверсальная Тогда
		ИмяМакета = "КарточкаУниверсальная";
	ИначеЕсли ВариантКарточки = Перечисления.мВариантыКарточекИсходныхДанных.КарточкаОценка Тогда
		ИмяМакета = "КарточкаОценка";
	ИначеЕсли ВариантКарточки = Перечисления.мВариантыКарточекИсходныхДанных.КарточкаУстановленияНефиксированныхГраницМинэнерго Тогда
		ИмяМакета = "КарточкаУстановленияНефиксированныхГраницМинэнерго";
	ИначеЕсли ВариантКарточки = Перечисления.мВариантыКарточекИсходныхДанных.КарточкаГрадостроительныйПаспорт Тогда
		ИмяМакета = "КарточкаГрадостроительныйПаспорт";
	ИначеЕсли ВариантКарточки = Перечисления.мВариантыКарточекИсходныхДанных.КарточкаИзготовленияКопийМатериалов Тогда
		ИмяМакета = "КарточкаИзготовленияКопийМатериалов";
	ИначеЕсли ВариантКарточки = Перечисления.мВариантыКарточекИсходныхДанных.КарточкаВедениеЭксплуатацияЗИС Тогда
		ИмяМакета = "КарточкаВедениеЭксплуатацияЗИС";
	Иначе
		ИмяМакета = "";
	КонецЕсли; 
	
	Возврат ИмяМакета;

КонецФункции
