&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Элементы.Условия.Видимость = Объект.ИспользоватьУсловияСтроки;
    Если Объект.ВариантРасчета = Перечисления.ВариантыРасчетов.КаждыеПоследующие Тогда
        Элементы.ДляПоследующих.Видимость = Истина;
        Элементы.ПредыдущийЭлемент.Видимость = Истина;
    Иначе
        Элементы.ПредыдущийЭлемент.Видимость = Ложь;
        Элементы.ДляПоследующих.Видимость = Ложь;
    КонецЕсли; 
    
    Если Объект.Ссылка.Пустая() Тогда
        Объект.СсылкаНаСборник = Объект.Владелец.СсылкаНаСборник;
    КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНаименование()
	Объект.Наименование = "";
    Если Объект.ИспользоватьУсловияСтроки Тогда
        Если Объект.НижняяГраницаДиапазона > 0 Тогда
            Если Объект.ВерхняяГраницаДиапазона = 0 Тогда
                Если Объект.ВариантРасчета = ПредопределенноеЗначение("Перечисление.ВариантыРасчетов.КаждыеПоследующие") Тогда
                    Объект.Наименование = Объект.Наименование + "На кажд. посл. "+Объект.ДляПоследующих;
                Иначе	
                    Объект.Наименование = Объект.Наименование + "Сверх "+Объект.НижняяГраницаДиапазона;
                КонецЕсли; 
            Иначе
                Объект.Наименование = Объект.Наименование + "От "+Объект.НижняяГраницаДиапазона + " до "+Объект.ВерхняяГраницаДиапазона;
            КонецЕсли;
        Иначе	
            Если Объект.ВерхняяГраницаДиапазона > 0 Тогда	
                Объект.Наименование = "До "+Объект.ВерхняяГраницаДиапазона;
            КонецЕсли;
        КонецЕсли;
    КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Объект.Наименование)  Тогда	
		Объект.Наименование = ""+Объект.СтадияРабот;
    КонецЕсли;
    
    Если ЗначениеЗаполнено(Объект.НомерПодСтроки) Тогда
        Объект.Наименование = "("+СокрЛП(Объект.НомерСтрокиТаблицы) + "-" + СокрЛП(Объект.НомерПодСтроки) + ") " + Объект.Наименование;
    Иначе
        Объект.Наименование = "("+СокрЛП(Объект.НомерСтрокиТаблицы) + ") " + Объект.Наименование;
    КонецЕсли; 
	
КонецПроцедуры
	
&НаКлиенте
Процедура НижняяГраницаДиапазонаПриИзменении(Элемент)
	СоздатьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ВерхняяГраницаДиапазонаПриИзменении(Элемент)
	СоздатьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ВариантРасчетаПриИзменении(Элемент)
	СоздатьНаименование();
	
	ЗадатьВидимостьЭлементов();
 КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВидимостьЭлементов()
    ИмяВарианта = ПолучитьИмяВарианта(Объект.ВариантРасчета);
    Если ИмяВарианта = "Интервал" Тогда
        Элементы.Коэффициент.Видимость = Ложь;
        Элементы.ДляПоследующих.Видимость = Ложь;
        
    ИначеЕсли ИмяВарианта = "Сверх" Тогда
        Элементы.Коэффициент.Видимость = Ложь;
        Элементы.ДляПоследующих.Видимость = Ложь;
        
    ИначеЕсли ИмяВарианта = "КаждыеПоследующие" Тогда
        Элементы.ПредыдущийЭлемент.Видимость = Истина;
        Элементы.ДляПоследующих.Видимость = Истина;
        
        Элементы.Коэффициент.Видимость = Ложь;
        
    ИначеЕсли ИмяВарианта = "КаждыеПоследующиеВИнтервале" Тогда
        Элементы.ДляПоследующих.Видимость = Истина;
        Элементы.Коэффициент.Видимость = Истина;
    КонецЕсли; 
 КонецПроцедуры // ЗадатьВидимостьЭлементов()

&НаСервереБезКонтекста
Функция ПолучитьИмяВарианта(ВариантРасчета)
    Если ВариантРасчета = Перечисления.ВариантыРасчетов.Интервал Тогда
        Возврат "Интервал";
    ИначеЕсли ВариантРасчета = Перечисления.ВариантыРасчетов.КаждыеПоследующие Тогда
        Возврат "КаждыеПоследующие";	
    ИначеЕсли ВариантРасчета = Перечисления.ВариантыРасчетов.КаждыеПоследующиеВИнтервале Тогда
        Возврат "КаждыеПоследующиеВИнтервале";	
    ИначеЕсли ВариантРасчета = Перечисления.ВариантыРасчетов.Сверх Тогда
        Возврат "Сверх";	
    КонецЕсли; 
КонецФункции

&НаКлиенте
Процедура ДляПоследующихПриИзменении(Элемент)
	СоздатьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура СтадияРаботПриИзменении(Элемент)
    СоздатьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьУсловияСтрокиПриИзменении(Элемент)
    Элементы.Условия.Видимость = Объект.ИспользоватьУсловияСтроки;
    СоздатьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    Оповестить("Записана строка таблицы", , Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура НомерПодСтрокиПриИзменении(Элемент)
	СоздатьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура НомерСтрокиТаблицыПриИзменении(Элемент)
	СоздатьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗадатьВидимостьЭлементов();
    ИспользоватьУсловияСтрокиПриИзменении(Неопределено);
    ИспользоватьКоличествоПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьКоличествоПриИзменении(Элемент)
    УстановитьВидимостьПараметрОбъектаВСтрокеДляКоличества();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьПараметрОбъектаВСтрокеДляКоличества()
    Элементы.ПараметрОбъектаВСтрокеДляКоличества.Видимость = (Объект.ИспользоватьКоличество или Объект.ИспользоватьЦены);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьЦеныПриИзменении(Элемент)
    УстановитьВидимостьПараметрОбъектаВСтрокеДляКоличества();
КонецПроцедуры
 


