
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрейскурантЦены.ЮрФизЛицо КАК ЮрФизЛицо,
		|	ПрейскурантЦены.Стоимость КАК Стоимость,
		|	ПрейскурантЦены.Ссылка.ДолжностьУтвердившего КАК ДолжностьУтвердившего,
		|	ПрейскурантЦены.Ссылка.НачалоДействия КАК Период,
		|	ПрейскурантЦены.Цена,
		|	ПрейскурантЦены.СтавкаНДС,
		|	ПрейскурантЦены.ОсвобождениеОтНДС,
		|	ПрейскурантЦены.СуммаНДС
		|ИЗ
		|	Документ.мПрейскурантЗИС.Цены КАК ПрейскурантЦены
		|ГДЕ
		|	ПрейскурантЦены.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Результат = Запрос.Выполнить().Выгрузить();

	РегистрыСведений.мПрейскурантЗИС.ЗаписатьПрейскурант(Ссылка, Результат);
	
КонецПроцедуры
