
////////////////////////////////////////////////////////////////////////////////
// ОтложенныйСтартБизнесПроцессовГлобальный: в модуле содержатся процедуры для работы
// с механизмом отложенного старта бизнес-процессов.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОткрытьФормуНастройкиОтложенногоСтарта() Экспорт
	
	ОтложенныйСтартБизнесПроцессовКлиент.ОткрытьФормуНастройки();
	
КонецПроцедуры

#КонецОбласти