
// Обработчик регламентного задания УдалениеСтарыхЗаписейПротоколаМобильныхКлиентов.
// Удаляет старые записи протокола работы с мобильными клиентами.
Процедура УдалениеСтарыхЗаписейПротоколаМобильногоКлиента() Экспорт
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьМобильныеКлиенты") <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Удаляются записи старше 2-х недель
	ГраницаВыборкиЗаписей = ТекущаяДатаСеанса() - 14*24*60*60;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПротоколРаботыСМобильнымиКлиентами.МоментВремени,
		|	ПротоколРаботыСМобильнымиКлиентами.Период,
		|	ПротоколРаботыСМобильнымиКлиентами.МобильныйКлиент
		|ИЗ
		|	РегистрСведений.ПротоколРаботыСМобильнымиКлиентами КАК ПротоколРаботыСМобильнымиКлиентами
		|ГДЕ
		|	ПротоколРаботыСМобильнымиКлиентами.Период <= &Период";
	Запрос.УстановитьПараметр("Период", ГраницаВыборкиЗаписей);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.ПротоколРаботыСМобильнымиКлиентами.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.МоментВремени = Выборка.МоментВремени;
		МенеджерЗаписи.Период = Выборка.Период;
		МенеджерЗаписи.МобильныйКлиент = Выборка.МобильныйКлиент;
		МенеджерЗаписи.Удалить();
	КонецЦикла;
	
КонецПроцедуры
