
&НаКлиенте
Процедура ОсновнойГородПриИзменении(Элемент)
    Если Элемент.ТекстРедактирования = "Брест" Тогда
        УстановитьСвязанныеКонстанты(Истина, Ложь, Ложь, Ложь, Ложь, Ложь, Ложь);
    ИначеЕсли Элемент.ТекстРедактирования = "Витебск" Тогда
        УстановитьСвязанныеКонстанты(Ложь, Истина, Ложь, Ложь, Ложь, Ложь, Ложь);
    ИначеЕсли Элемент.ТекстРедактирования = "Гомель" Тогда
        УстановитьСвязанныеКонстанты(Ложь, Ложь, Истина, Ложь, Ложь, Ложь, Ложь);
    ИначеЕсли Элемент.ТекстРедактирования = "Гродно" Тогда
        УстановитьСвязанныеКонстанты(Ложь, Ложь, Ложь, Истина, Ложь, Ложь, Ложь);
    ИначеЕсли Элемент.ТекстРедактирования = "Минск" Тогда
        УстановитьСвязанныеКонстанты(Ложь, Ложь, Ложь, Ложь, Истина, Ложь, Ложь);
    ИначеЕсли Элемент.ТекстРедактирования = "Могилев" Тогда
        УстановитьСвязанныеКонстанты(Ложь, Ложь, Ложь, Ложь, Ложь, Истина, Ложь);
    ИначеЕсли Элемент.ТекстРедактирования = "Прилуки" Тогда
        УстановитьСвязанныеКонстанты(Ложь, Ложь, Ложь, Ложь, Ложь, Ложь, Истина);
   КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура УстановитьСвязанныеКонстанты(п1, п2, п3, п4, п5, п6, п7)
    НаборКонстант.М_Брест   = п1;
    НаборКонстант.М_Витебск = п2;
    НаборКонстант.М_Гомель  = п3;
    НаборКонстант.М_Гродно  = п4;
    НаборКонстант.М_Минск   = п5;
    НаборКонстант.М_Могилев = п6;
    НаборКонстант.М_Прилуки = п7;
КонецПроцедуры // УстановитьСвязанныеКонстанты()
