////////////////////////////////////////////////////////////////////////////////
// Обработка запросов XDTO, документы
// Реализует функционал веб-сервиса DMService в части операций с документами
// и основными справочниками
////////////////////////////////////////////////////////////////////////////////

#Область ВходящийДокумент

// Получает заполненный объект XDTO, соответствующий входящему документу
// 
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   ОбъектИд - ОбъектXDTO типа ObjectId, описывающий существующий документ
//   НаборКолонок - Массив - массив имен реквизитов к получению
//                - Неопределено - требование получить все реквизиты
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMIncomingDocument или DMError
//
Функция ПолучитьВходящийДокумент(Узел, ОбъектИд, НаборКолонок = Неопределено) Экспорт 
	
	Попытка 
		
		Ссылка = ОбработкаЗапросовXDTO.ПолучитьСсылкуПоObjectID(ОбъектИд);
		Документ = Ссылка.ПолучитьОбъект();
		
		Объект = ОбработкаЗапросовXDTO.СоздатьОбъект("DMIncomingDocument");
		ПолучитьДанныеВходящегоДокумента(Узел, Документ, Объект, НаборКолонок);
		
		Возврат Объект;
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при получении входящего документа'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;
	
КонецФункции	

// Создает новый входящий документ по объекту XDTO
// 
// Параметры:
//   Сообщение - ОбъектXDTO типа DMCreateRequest
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMIncomingDocument или DMError
//
Функция СоздатьВходящийДокумент(Сообщение) Экспорт 
	
	Попытка 
		
		Узел = ОбработкаЗапросовXDTO.УзелИнтегрированнойСистемы(Сообщение);
		Документ = Справочники.ВходящиеДокументы.СоздатьЭлемент();
		Объект = Сообщение.object;
		УстановитьСсылкуНовогоДляСправочника(Документ, Объект);
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Если Не ЗаписатьДанныеВходящегоДокумента(Узел, Документ, Объект, Ошибка, Ложь) Тогда 
			Возврат Ошибка;
		КонецЕсли;
		
		Если Объект.Установлено("externalObject") Тогда
			Узел = ОбработкаЗапросовXDTO.УзелИнтегрированнойСистемы(Сообщение);
			ОбработкаЗапросовXDTO.ДобавитьСвязьОбъектаДОИВнешнегоОбъекта(Узел, Объект.externalObject.id, Объект.externalObject.type, Документ.Ссылка);
		КонецЕсли;	
		
		ОбъектИд = ОбработкаЗапросовXDTO.ПолучитьObjectIDПоСсылке(Документ.Ссылка);
		Возврат ПолучитьВходящийДокумент(Узел, ОбъектИд);
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при создании входящего документа'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;
	
КонецФункции	

// Изменяет и записывает входящий документ по объекту XDTO
// 
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   Объект - ОбъектXDTO типа DMIncomingDocument 
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMIncomingDocument, заново заполненный, или DMError
//
Функция ИзменитьВходящийДокумент(Узел, Объект, УдалитьРегистрацию = Ложь) Экспорт 
	
	Попытка 
		
		Ссылка = ОбработкаЗапросовXDTO.ПолучитьСсылкуПоObjectID(Объект.objectId);
		
		ЧислоПодписейДо = ЭлектроннаяПодпись.КоличествоПодписей(Ссылка);
		ЧислоПодписейПосле = Объект.signatures.Количество();
		Если ЧислоПодписейДо > ЧислоПодписейПосле Тогда //удаляем подписи перед изменением карточки
			ОбработкаЗапросовXDTOФайлы.ЗанестиИнформациюОПодписяхОбъекта(Объект.signatures, Ссылка);
		КонецЕсли;	
		
		Документ = Ссылка.ПолучитьОбъект();
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Если Не ЗаписатьДанныеВходящегоДокумента(Узел, Документ, Объект, Ошибка, УдалитьРегистрацию) Тогда 
			Возврат Ошибка;
		КонецЕсли;
		
		Если ЧислоПодписейДо <= ЧислоПодписейПосле Тогда // добавляем подписи после изменения карточки
			ОбработкаЗапросовXDTOФайлы.ЗанестиИнформациюОПодписяхОбъекта(Объект.signatures, Ссылка);
		КонецЕсли;	
		
		ОбъектИд = ОбработкаЗапросовXDTO.ПолучитьObjectIDПоСсылке(Документ.Ссылка);
		Возврат ПолучитьВходящийДокумент(Узел, ОбъектИд);
		
	Исключение
		
		Если Ссылка <> Неопределено И УдалитьРегистрацию Тогда
			ПланыОбмена.УдалитьРегистрациюИзменений(Узел, Ссылка);
		КонецЕсли;
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при создании входящего документа'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;
	
КонецФункции	

// Получает объект XDTO для нового входящего документа
// 
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   НаборКолонок - Массив - массив имен реквизитов к заполнению
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMIncomingDocument или DMError
//
Функция ПолучитьНовыйВходящийДокумент(Узел, НаборКолонок) Экспорт 
	
	Попытка
		
		Документ = Справочники.ВходящиеДокументы.СоздатьЭлемент();
		Документ.ОбработкаЗаполнения(Неопределено, Истина);
	
		Объект = ОбработкаЗапросовXDTO.СоздатьОбъект("DMIncomingDocument");
		ПолучитьДанныеВходящегоДокумента(Узел, Документ, Объект, НаборКолонок);
		
		Возврат Объект;
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при получении нового входящего документа'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;
	
КонецФункции

// Заполняет объект XDTO по данным объекта Документооборота
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   Документ - СправочникОбъект.ВходящиеДокументы
//   ОбъектXDTO - ОбъектXDTO типа DMIncomingDocument
//   НаборКолонок - Массив - массив имен реквизитов к заполнению
//                - Неопределено - требование заполнить все реквизиты
//
Процедура ПолучитьДанныеВходящегоДокумента(Узел, Документ, ОбъектXDTO, НаборКолонок = Неопределено)
	
	ДанныеДокумента = Новый Структура;
	
	ПолучитьОбщиеДанныеДокумента(ДанныеДокумента, Документ);
	
	ДанныеДокумента.Вставить("externalNumber", 	Документ.ИсходящийНомер);
	ДанныеДокумента.Вставить("externalDate", 	Документ.ИсходящаяДата);
	ДанныеДокумента.Вставить("correspondent", 	Документ.Отправитель);
	ДанныеДокумента.Вставить("signer", 			Документ.Подписал);
	ДанныеДокумента.Вставить("addressee", 		Документ.Адресат);
	ДанныеДокумента.Вставить("deliveryMethod", 	Документ.СпособПолучения);
	
	// состояние
	Если ЗначениеЗаполнено(Документ.Ссылка) Тогда
		СостояниеДокумента = ОбработкаЗапросовXDTOПереопределяемый.ПолучитьСостояниеДокумента(Документ.Ссылка);
	Иначе
		СостояниеДокумента = Перечисления.СостоянияДокументов.НаРегистрации;
	КонецЕсли;	
	
	ДанныеДокумента.Вставить("status", СостояниеДокумента);
	
	ИменаСостояний = Новый Структура("Согласование, Утверждение, Регистрация, Рассмотрение, Исполнение");
	
	ИменСвойствПоСостояниям = Новый Соответствие;
	ИменСвойствПоСостояниям.Вставить("Согласование", "statusApproval");
	ИменСвойствПоСостояниям.Вставить("Утверждение", "statusConfirmation");
	ИменСвойствПоСостояниям.Вставить("Регистрация", "statusRegistration");
	ИменСвойствПоСостояниям.Вставить("Рассмотрение", "statusConsideration");
	ИменСвойствПоСостояниям.Вставить("Исполнение", "statusPerformance");
	
	Для Каждого Строка Из ИменаСостояний Цикл
		ИмяСостояния = Строка.Ключ;
		СтруктураСостояния = Делопроизводство.ПолучитьСтруктуруСостоянияДокумента(Документ.Ссылка, "Состояние" + ИмяСостояния);
		ДанныеДокумента.Вставить(ИменСвойствПоСостояниям.Получить(ИмяСостояния), СтруктураСостояния.Состояние);
	КонецЦикла;
	
	// настройки
	ПолучитьОбщиеНастройкиДокумента(ДанныеДокумента, Документ);
	ДанныеДокумента.Вставить("documentTypeEnabled", 		Константы.ИспользоватьВидыВходящихДокументов.Получить());
	
	// набор колонок
	Колонки = Новый Массив;
	Если НаборКолонок <> Неопределено Тогда 
		Для Каждого Элемент Из НаборКолонок Цикл 
			Колонки.Добавить(НРег(Элемент));
		КонецЦикла;	
	КонецЕсли;
	ПолучатьВсеКолонки = (Колонки.Количество() = 0);
	
	Для Каждого Реквизит Из ДанныеДокумента Цикл
		Если ПолучатьВсеКолонки Или Колонки.Найти(НРег(Реквизит.Ключ)) <> Неопределено Тогда 
			ОбработкаЗапросовXDTO.ЗаполнитьСвойствоXDTOизРеквизита(ОбъектXDTO, Реквизит.Ключ, Реквизит.Значение);
		КонецЕсли;	
	КонецЦикла;
	
	// вид документа
	Если ОбъектXDTO.Установлено("documentType") Тогда
		ПолучитьДанныеВидаДокумента(ОбъектXDTO.documentType, ДанныеДокумента.documentType);
	КонецЕсли;
	
	// файлы
	Если ЗначениеЗаполнено(Документ.Ссылка) Тогда 
		Если ПолучатьВсеКолонки Или Колонки.Найти(НРег("files")) <> Неопределено Тогда 
			НаборКолонокФайлов = Новый Массив;
			ЗаполнитьКолонкиСпискаФайлов(НаборКолонокФайлов);
			
			МассивОбъектовДО = РаботаСФайламиВызовСервера.ПолучитьВсеПодчиненныеФайлы(Документ.Ссылка, Ложь);
			МассивФайлов = ОбработкаЗапросовXDTOФайлы.ЗаполнитьСписокФайлов(МассивОбъектовДО, НаборКолонокФайлов);
			ОбработкаЗапросовXDTOФайлы.ЗаполнитьСписокФайловИзМассива(ОбъектXDTO, МассивФайлов, НаборКолонокФайлов);
		КонецЕсли;
	КонецЕсли;
	
	// подписи
	Если ЗначениеЗаполнено(Документ.Ссылка) Тогда 
		Если ПолучатьВсеКолонки Или Колонки.Найти(НРег("signatures")) <> Неопределено Тогда 
			МассивПодписей = ЗаполнитьСписокПодписей(Документ.Ссылка);
			ЗаполнитьXDTOСписокПодписей(ОбъектXDTO, МассивПодписей);
		КонецЕсли;
	КонецЕсли;
	
	// слепок
	Если ЗначениеЗаполнено(Документ.Ссылка) Тогда 
		Если ПолучатьВсеКолонки Или Колонки.Найти(НРег("keyPropertiesValue")) <> Неопределено Тогда 
			ОбъектXDTO.keyPropertiesValue = РаботаСЭП.ПолучитьДвоичныеДанныеОбъекта(Документ.Ссылка);
		КонецЕсли;
	КонецЕсли;
	
	// связи
	Если ЗначениеЗаполнено(Документ.Ссылка) Тогда 
		Если ПолучатьВсеКолонки Или Колонки.Найти(НРег("relations")) <> Неопределено Тогда 
			МассивСвязанных = ПолучитьСвязанныеДокументы(Узел, Документ.Ссылка);
			Для Каждого СвязанныйДокумент Из МассивСвязанных Цикл
				ОбъектXDTO.relations.Добавить(СвязанныйДокумент);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// доп. реквизиты
	Если ПолучатьВсеКолонки Или Колонки.Найти(НРег("additionalProperties")) <> Неопределено Тогда 
		ОбработкаЗапросовXDTO.ПолучитьНаборДополнительныхРеквизитовОбъектаДО(Документ, ОбъектXDTO);
	КонецЕсли;
	
	// доступные и недоступные поля
	Если ПолучатьВсеКолонки Или Колонки.Найти(НРег("enabledProperties")) <> Неопределено Тогда 
	    ДоступныеПоля = ПолучитьДоступностьПолейПоСостоянию(Документ, СостояниеДокумента);
		
		Если ДоступныеПоля <> "" Тогда 
			Для Каждого Строка Из ДоступныеПоля Цикл
				ОбъектXDTO.enabledProperties.Добавить(Строка.Ключ);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// внешний объект
	Если ПолучатьВсеКолонки Или Колонки.Найти(НРег("externalObject")) <> Неопределено Тогда
		ВнешнийОбъект = ОбработкаЗапросовXDTO.ПолучитьСсылкуНаВнешнийОбъект(Узел, Документ.Ссылка);
		Если ЗначениеЗаполнено(ВнешнийОбъект) Тогда
			ВнешнийОбъектXDTO = ОбработкаЗапросовXDTO.СоздатьОбъект("ExternalObject");
			ВнешнийОбъектXDTO.id = ВнешнийОбъект.id;
			ВнешнийОбъектXDTO.type = ВнешнийОбъект.type;
			ВнешнийОбъектXDTO.name = ВнешнийОбъект.name;
			ОбъектXDTO.externalObject = ВнешнийОбъектXDTO;
		КонецЕсли;
	КонецЕсли;
	
	// параметры хронометража
	Если ПолучатьВсеКолонки Или Колонки.Найти(НРег("chronometrationSettings")) <> Неопределено Тогда 
		ОбработкаЗапросовXDTOУчетВремени.УстановитьПараметрыУчетаВремени(ОбъектXDTO, Документ.Ссылка);
	КонецЕсли;
	
	// содержит оригиналы
	Если ПолучатьВсеКолонки Или Колонки.Найти(НРег("containsScannedOriginals")) <> Неопределено Тогда
		ЗаполнитьПризнакСодержитОригиналы(ОбъектXDTO, Документ.Ссылка);
	КонецЕсли;
		
	ОбъектXDTO.objectId = ОбработкаЗапросовXDTO.ПолучитьObjectIDПоСсылке(Документ.Ссылка);
	ОбъектXDTO.name = Строка(Документ.Ссылка);
	
КонецПроцедуры

// Заполняет и записывает объект Документооборота по данным объекта XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   Документ - СправочникОбъект.ВходящиеДокументы - записываемый объект
//   ОбъектXDTO - ОбъектXDTO типа DMIncomingDocument - источник данных
//   Ошибка - ОбъектXDTO типа DMError - неявно возвращаемое значение ошибки
//
// Возвращаемое значение:
//   Булево - Истина, если операция завершена успешно, и Ложь в противном случае
//
Функция ЗаписатьДанныеВходящегоДокумента(Узел, Документ, ОбъектXDTO, Ошибка, УдалитьРегистрацию = Ложь)
	
	НачальныйРегистрационныйНомер = Документ.РегистрационныйНомер;
	НачальнаяДатаРегистрации = Документ.ДатаРегистрации;
	
	Блокировать = ЗначениеЗаполнено(Документ.Ссылка);
	Если Блокировать Тогда 
		Документ.Заблокировать();
	КонецЕсли;	
	ЗаполнитьДанныеВходящегоДокумента(Узел, Документ, ОбъектXDTO);
	
	// проверка заполнения
	ТекстСообщения = "";
	Если Не ОбработкаЗапросовXDTO.ПроверитьЗаполнение(Документ, ТекстСообщения) Тогда 
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при записи входящего документа'");
		Ошибка.description = ТекстСообщения;
		Возврат Ложь;
	КонецЕсли;	
	
	// изменение полей по состоянию
	Если ЗначениеЗаполнено(Документ.Ссылка) Тогда 
		ТекущееСостояние = ОбработкаЗапросовXDTOПереопределяемый.ПолучитьСостояниеДокумента(Документ.Ссылка);
		ДоступныеПоля = ПолучитьДоступностьПолейПоСостоянию(Документ, ТекущееСостояние);
		
		Если ДоступныеПоля <> "" Тогда 
		
			ТекущиеДанные = ОбработкаЗапросовXDTO.СоздатьОбъект("DMIncomingDocument");
			ПолучитьДанныеВходящегоДокумента(Узел, Документ.Ссылка.ПолучитьОбъект(), ТекущиеДанные);
			
			Для Каждого Свойство Из ОбъектXDTO.Свойства() Цикл
				Если ОбъектXDTO.Установлено(Свойство) И Свойство.НижняяГраница = 0 И Свойство.ВерхняяГраница = 1 И Не ДоступныеПоля.Свойство(Свойство.Имя) Тогда 
					НовоеЗначениеСвойства = ОбъектXDTO.Получить(Свойство);
					ТекущееЗначениеСвойства = ТекущиеДанные.Получить(Свойство);
					
					Если ТипЗнч(НовоеЗначениеСвойства) = Тип("ОбъектXDTO") Тогда 
						Если ТекущееЗначениеСвойства = Неопределено Тогда 
							ТекущееЗначениеСвойства = ОбработкаЗапросовXDTO.СоздатьОбъект("DMObject");
							ТекущееЗначениеСвойства.name = "";
							ТекущееЗначениеСвойства.objectId = ОбработкаЗапросовXDTO.СоздатьОбъект("DMObjectID");
							ТекущееЗначениеСвойства.objectId.id = "";
							ТекущееЗначениеСвойства.objectId.type = "";
						КонецЕсли;
						
						Если НовоеЗначениеСвойства.objectId.id   <> ТекущееЗначениеСвойства.objectId.id 
						 Или НовоеЗначениеСвойства.objectId.type <> ТекущееЗначениеСвойства.objectId.type Тогда 
							Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
							Ошибка.subject = НСтр("ru = 'Ошибка при записи входящего документа'");
							Ошибка.description = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку( 
								НСтр("ru = 'Свойство ""%1"" не может быть изменено для состояния ""%2""'"), Свойство.Имя, ТекущееСостояние);
							Возврат Ложь;
						КонецЕсли;
					Иначе	
						Если Не ЗначениеЗаполнено(НовоеЗначениеСвойства) И Не ЗначениеЗаполнено(ТекущееЗначениеСвойства) Тогда 
							Продолжить;
						КонецЕсли;	
						
						Если НовоеЗначениеСвойства <> ТекущееЗначениеСвойства Тогда 
							Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
							Ошибка.subject = НСтр("ru = 'Ошибка при записи входящего документа'");
							Ошибка.description = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку( 
								НСтр("ru = 'Свойство ""%1"" не может быть изменено для состояния ""%2""'"), Свойство.Имя, ТекущееСостояние);
							Возврат Ложь;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Документ.Ссылка) И Не ЗначениеЗаполнено(Документ.ДатаСоздания) Тогда
		Документ.ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Документ.Записать();
	
	// состояние
	ЗаполнитьСостоянияДокумента(Узел, Документ, ОбъектXDTO);
		
	// регистрация
	Если ЗначениеЗаполнено(Документ.РегистрационныйНомер) И Не ЗначениеЗаполнено(НачальныйРегистрационныйНомер) Тогда 
		СостояниеДокумента = Перечисления.СостоянияДокументов.Зарегистрирован;
		
		Делопроизводство.ЗаписатьСостояниеДокумента(
			Документ.Ссылка, 
			ТекущаяДата(), 
			СостояниеДокумента, 
			ПользователиКлиентСервер.ТекущийПользователь());
	КонецЕсли;
	
	Попытка // в отсутствие подходящего нумератора будет выброшено исключение
		Нумератор = Нумерация.ПолучитьНумераторДокумента(Документ);
	Исключение
		Нумератор = Неопределено;
	КонецПопытки;
	Если ЗначениеЗаполнено(Нумератор) Тогда 
		// изменен автоматический номер
		Если Документ.РегистрационныйНомер <> НачальныйРегистрационныйНомер Тогда 
			Документ.ЧисловойНомер = -1;
			Документ.Записать();
		КонецЕсли;
	КонецЕсли;
	
	Если УдалитьРегистрацию Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(Узел, Документ.Ссылка);
	КонецЕсли;
	
	Если Блокировать Тогда 
		Документ.Разблокировать();
	КонецЕсли;	
	
	Возврат Истина;
		
КонецФункции

// Заполняет объект Документооборота по данным объекта XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   ДокументОбъект - СправочникОбъект.ВходящиеДокументы - заполняемый объект
//   ОбъектXDTO - ОбъектXDTO типа DMIncomingDocument - источник данных заполнения
//
Процедура ЗаполнитьДанныеВходящегоДокумента(Узел, ДокументОбъект, ОбъектXDTO)
	
	ЗаполнитьОбщиеДанныеДокумента(Узел, ДокументОбъект, ОбъектXDTO);
	
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ДокументОбъект.ИсходящийНомер, 		 ОбъектXDTO, "externalNumber");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ДокументОбъект.ИсходящаяДата,  		 ОбъектXDTO, "externalDate");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ДокументОбъект.Отправитель, 		 ОбъектXDTO, "correspondent");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ДокументОбъект.Подписал, 			 ОбъектXDTO, "signer");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ДокументОбъект.Адресат, 			 ОбъектXDTO, "addressee");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ДокументОбъект.СпособПолучения, 	 ОбъектXDTO, "deliveryMethod");
	
	ОбработкаЗапросовXDTO.ЗаписатьДополнительныеРеквизиты(Узел, ДокументОбъект, ОбъектXDTO);	
	ЗаписатьДанныеФайлов(ДокументОбъект, ОбъектXDTO.files);
	
КонецПроцедуры

#КонецОбласти

#Область ИсходящийДокумент

// Получает заполненный объект XDTO, соответствующий исходящему документу
// 
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   ОбъектИд - ОбъектXDTO типа ObjectId, описывающий существующий документ
//   НаборКолонок - Массив - массив имен реквизитов к получению
//                - Неопределено - требование получить все реквизиты
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMOutgoingDocument или DMError
//
Функция ПолучитьИсходящийДокумент(Узел, ОбъектИд, НаборКолонок = Неопределено) Экспорт 
	
	Попытка 
		
		Ссылка = ОбработкаЗапросовXDTO.ПолучитьСсылкуПоObjectID(ОбъектИд);
		Документ = Ссылка.ПолучитьОбъект();
		
		Объект = ОбработкаЗапросовXDTO.СоздатьОбъект("DMOutgoingDocument");
		ПолучитьДанныеИсходящегоДокумента(Узел, Документ, Объект, НаборКолонок);
		
		Возврат Объект;
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при получении исходящего документа'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;
	
КонецФункции	

// Создает новый исходящий документ по объекту XDTO
// 
// Параметры:
//   Сообщение - ОбъектXDTO типа DMCreateRequest
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMOutgoingDocument или DMError
//
Функция СоздатьИсходящийДокумент(Сообщение) Экспорт 
	
	Попытка 
		
		Узел = ОбработкаЗапросовXDTO.УзелИнтегрированнойСистемы(Сообщение);
		Документ = Справочники.ИсходящиеДокументы.СоздатьЭлемент();
		Объект = Сообщение.object;
		УстановитьСсылкуНовогоДляСправочника(Документ, Объект);
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Если Не ЗаписатьДанныеИсходящегоДокумента(Узел, Документ, Объект, Ошибка, Ложь) Тогда 
			Возврат Ошибка;
		КонецЕсли;
		
		Если Объект.Установлено("externalObject") Тогда 
			ОбработкаЗапросовXDTO.ДобавитьСвязьОбъектаДОИВнешнегоОбъекта(Узел, Объект.externalObject.id, Объект.externalObject.type, Документ.Ссылка);
		КонецЕсли;	
		
		ОбъектИд = ОбработкаЗапросовXDTO.ПолучитьObjectIDПоСсылке(Документ.Ссылка);
		Возврат ПолучитьИсходящийДокумент(Узел, ОбъектИд);
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при создании исходящего документа'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;
	
КонецФункции	

// Изменяет и записывает исходящий документ по объекту XDTO
// 
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   Объект - ОбъектXDTO типа DMOutgoingDocument 
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMOutgoingDocument, заново заполненный, или DMError
//
Функция ИзменитьИсходящийДокумент(Узел, Объект, УдалитьРегистрацию = Ложь) Экспорт 
	
	Попытка 
		
		Ссылка = ОбработкаЗапросовXDTO.ПолучитьСсылкуПоObjectID(Объект.objectId);
		
		ЧислоПодписейДо = ЭлектроннаяПодпись.КоличествоПодписей(Ссылка);
		ЧислоПодписейПосле = Объект.signatures.Количество();
		Если ЧислоПодписейДо > ЧислоПодписейПосле Тогда //удаляем подписи перед изменением карточки
			ОбработкаЗапросовXDTOФайлы.ЗанестиИнформациюОПодписяхОбъекта(Объект.signatures, Ссылка);
		КонецЕсли;	
		
		Документ = Ссылка.ПолучитьОбъект();
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Если Не ЗаписатьДанныеИсходящегоДокумента(Узел, Документ, Объект, Ошибка, УдалитьРегистрацию) Тогда 
			Возврат Ошибка;
		КонецЕсли;
		
		Если ЧислоПодписейДо <= ЧислоПодписейПосле Тогда // добавляем подписи после изменения карточки
			ОбработкаЗапросовXDTOФайлы.ЗанестиИнформациюОПодписяхОбъекта(Объект.signatures, Ссылка);
		КонецЕсли;	
		
		ОбъектИд = ОбработкаЗапросовXDTO.ПолучитьObjectIDПоСсылке(Документ.Ссылка);
		Возврат ПолучитьИсходящийДокумент(Узел, ОбъектИд);
		
	Исключение
		
		Если Ссылка <> Неопределено И УдалитьРегистрацию Тогда
			ПланыОбмена.УдалитьРегистрациюИзменений(Узел, Ссылка);
		КонецЕсли;
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при создании исходящего документа'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;	
	
КонецФункции	

// Получает объект XDTO для нового исходящего документа
// 
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   НаборКолонок - Массив - массив имен реквизитов к заполнению
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMOutgoingDocument или DMError
//
Функция ПолучитьНовыйИсходящийДокумент(Узел, НаборКолонок) Экспорт 
	
	Попытка
		
		Документ = Справочники.ИсходящиеДокументы.СоздатьЭлемент();
		Документ.ОбработкаЗаполнения(Неопределено, Истина);
	
		Объект = ОбработкаЗапросовXDTO.СоздатьОбъект("DMOutgoingDocument");
		ПолучитьДанныеИсходящегоДокумента(Узел, Документ, Объект, НаборКолонок);
		
		Возврат Объект;
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при получении нового исходящего документа'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;
	
КонецФункции

// Заполняет объект XDTO по данным объекта Документооборота
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   Документ - СправочникОбъект.ИсходящиеДокументы
//   ОбъектXDTO - ОбъектXDTO типа DMOutgoingDocument
//   НаборКолонок - Массив - массив имен реквизитов к заполнению
//                - Неопределено - требование заполнить все реквизиты
//
Процедура ПолучитьДанныеИсходящегоДокумента(Узел, Документ, ОбъектXDTO, НаборКолонок = Неопределено)
	
	ДанныеДокумента = Новый Структура;
	
	ПолучитьОбщиеДанныеДокумента(ДанныеДокумента, Документ);
	
	ДанныеДокумента.Вставить("signer", 			Документ.Подписал);
	ДанныеДокумента.Вставить("author", 			Документ.Подготовил);
	
	// данные табл части
	Если Документ.Получатели.Количество() > 0 Тогда 
		ПерваяСтрока = Документ.Получатели[0];
		
		ДанныеДокумента.Вставить("externalNumber", 	ПерваяСтрока.ВходящийНомер);
		ДанныеДокумента.Вставить("externalDate", 	ПерваяСтрока.ВходящаяДата);
		ДанныеДокумента.Вставить("correspondent", 	ПерваяСтрока.Получатель);
		ДанныеДокумента.Вставить("addressee", 		ПерваяСтрока.Адресат);
		ДанныеДокумента.Вставить("deliveryMethod", 	ПерваяСтрока.СпособОтправки);
		ДанныеДокумента.Вставить("sent", 			ПерваяСтрока.Отправлен);
		ДанныеДокумента.Вставить("sendDate", 		ПерваяСтрока.ДатаОтправки);
	КонецЕсли;	
	
	// состояние
	Если ЗначениеЗаполнено(Документ.Ссылка) Тогда 
		СостояниеДокумента = ОбработкаЗапросовXDTOПереопределяемый.ПолучитьСостояниеДокумента(Документ.Ссылка);
	Иначе
		СостояниеДокумента = Перечисления.СостоянияДокументов.Проект;
	КонецЕсли;	
	ДанныеДокумента.Вставить("status", СостояниеДокумента);
	
	ИменаСостояний = Новый Структура("Согласование, Утверждение, Регистрация, Рассмотрение, Исполнение");
	
	ИменСвойствПоСостояниям = Новый Соответствие;
	ИменСвойствПоСостояниям.Вставить("Согласование", "statusApproval");
	ИменСвойствПоСостояниям.Вставить("Утверждение", "statusConfirmation");
	ИменСвойствПоСостояниям.Вставить("Регистрация", "statusRegistration");
	ИменСвойствПоСостояниям.Вставить("Рассмотрение", "statusConsideration");
	ИменСвойствПоСостояниям.Вставить("Исполнение", "statusPerformance");
	
	Для Каждого Строка Из ИменаСостояний Цикл
		ИмяСостояния = Строка.Ключ;
		СтруктураСостояния = Делопроизводство.ПолучитьСтруктуруСостоянияДокумента(Документ.Ссылка, "Состояние" + ИмяСостояния);
		ДанныеДокумента.Вставить(ИменСвойствПоСостояниям.Получить(ИмяСостояния), СтруктураСостояния.Состояние);
	КонецЦикла;
	
	// настройки
	ПолучитьОбщиеНастройкиДокумента(ДанныеДокумента, Документ);
	ДанныеДокумента.Вставить("documentTypeEnabled", 		Константы.ИспользоватьВидыИсходящихДокументов.Получить());
	
	// набор колонок
	Колонки = Новый Массив;
	Если НаборКолонок <> Неопределено Тогда 
		Для Каждого Элемент Из НаборКолонок Цикл
			Колонки.Добавить(НРег(Элемент));
		КонецЦикла;	
	КонецЕсли;
	ПолучатьВсеКолонки = (Колонки.Количество() = 0);
	
	Для Каждого Реквизит Из ДанныеДокумента Цикл
		Если ПолучатьВсеКолонки Или Колонки.Найти(НРег(Реквизит.Ключ)) <> Неопределено Тогда 
			ОбработкаЗапросовXDTO.ЗаполнитьСвойствоXDTOИзРеквизита(ОбъектXDTO, Реквизит.Ключ, Реквизит.Значение);
		КонецЕсли;	
	КонецЦикла;
	
	// вид документа
	Если ОбъектXDTO.Установлено("documentType") Тогда
		ПолучитьДанныеВидаДокумента(ОбъектXDTO.documentType, ДанныеДокумента.documentType);
	КонецЕсли;
	
	// файлы
	Если ЗначениеЗаполнено(Документ.Ссылка) Тогда 
		Если ПолучатьВсеКолонки Или Колонки.Найти(НРег("files")) <> Неопределено Тогда 
			НаборКолонокФайлов = Новый Массив;
			ЗаполнитьКолонкиСпискаФайлов(НаборКолонокФайлов);
			
			МассивОбъектовДО = РаботаСФайламиВызовСервера.ПолучитьВсеПодчиненныеФайлы(Документ.Ссылка, Ложь);
			МассивФайлов = ОбработкаЗапросовXDTOФайлы.ЗаполнитьСписокФайлов(МассивОбъектовДО, НаборКолонокФайлов);
			ОбработкаЗапросовXDTOФайлы.ЗаполнитьСписокФайловИзМассива(ОбъектXDTO, МассивФайлов, НаборКолонокФайлов);
		КонецЕсли;
	КонецЕсли;
	
	// подписи
	Если ЗначениеЗаполнено(Документ.Ссылка) Тогда 
		Если ПолучатьВсеКолонки Или Колонки.Найти(НРег("signatures")) <> Неопределено Тогда 
			МассивПодписей = ЗаполнитьСписокПодписей(Документ.Ссылка);
			ЗаполнитьXDTOСписокПодписей(ОбъектXDTO, МассивПодписей);
		КонецЕсли;
	КонецЕсли;
	
	// слепок
	Если ЗначениеЗаполнено(Документ.Ссылка) Тогда 
		Если ПолучатьВсеКолонки Или Колонки.Найти(НРег("keyPropertiesValue")) <> Неопределено Тогда 
			ОбъектXDTO.keyPropertiesValue = РаботаСЭП.ПолучитьДвоичныеДанныеОбъекта(Документ.Ссылка);
		КонецЕсли;
	КонецЕсли;
	
	// связи
	Если ЗначениеЗаполнено(Документ.Ссылка) Тогда 
		Если ПолучатьВсеКолонки Или Колонки.Найти(НРег("relations")) <> Неопределено Тогда 
			МассивСвязанных = ПолучитьСвязанныеДокументы(Узел, Документ.Ссылка);
			Для Каждого СвязанныйДокумент Из МассивСвязанных Цикл
				ОбъектXDTO.relations.Добавить(СвязанныйДокумент);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// доп. реквизиты
	Если ПолучатьВсеКолонки Или Колонки.Найти(НРег("additionalProperties")) <> Неопределено Тогда 
		ОбработкаЗапросовXDTO.ПолучитьНаборДополнительныхРеквизитовОбъектаДО(Документ, ОбъектXDTO);
	КонецЕсли;	
	
	// доступные и недоступные поля
	Если ПолучатьВсеКолонки Или Колонки.Найти(НРег("enabledProperties")) <> Неопределено Тогда 
	    ДоступныеПоля = ПолучитьДоступностьПолейПоСостоянию(Документ, СостояниеДокумента);
		
		Если ДоступныеПоля <> "" Тогда 
			Для Каждого Строка Из ДоступныеПоля Цикл
				ОбъектXDTO.enabledProperties.Добавить(Строка.Ключ);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// внешний объект
	Если ПолучатьВсеКолонки Или Колонки.Найти(НРег("externalObject")) <> Неопределено Тогда
		ВнешнийОбъект = ОбработкаЗапросовXDTO.ПолучитьСсылкуНаВнешнийОбъект(Узел, Документ.Ссылка);
		Если ЗначениеЗаполнено(ВнешнийОбъект) Тогда
			ВнешнийОбъектXDTO = ОбработкаЗапросовXDTO.СоздатьОбъект("ExternalObject");
			ВнешнийОбъектXDTO.id = ВнешнийОбъект.id;
			ВнешнийОбъектXDTO.type = ВнешнийОбъект.type;
			ВнешнийОбъектXDTO.name = ВнешнийОбъект.name;
			ОбъектXDTO.externalObject = ВнешнийОбъектXDTO;
		КонецЕсли;
	КонецЕсли;
	
	// параметры хронометража
	Если ПолучатьВсеКолонки Или Колонки.Найти(НРег("chronometrationSettings")) <> Неопределено Тогда 
		ОбработкаЗапросовXDTOУчетВремени.УстановитьПараметрыУчетаВремени(ОбъектXDTO, Документ.Ссылка);
	КонецЕсли;
	
	// содержит оригиналы
	Если ПолучатьВсеКолонки Или Колонки.Найти(НРег("containsScannedOriginals")) <> Неопределено Тогда
		ЗаполнитьПризнакСодержитОригиналы(ОбъектXDTO, Документ.Ссылка);
	КонецЕсли;
	
	ОбъектXDTO.objectId = ОбработкаЗапросовXDTO.ПолучитьObjectIDПоСсылке(Документ.Ссылка);
	ОбъектXDTO.name = Строка(Документ.Ссылка);
		
КонецПроцедуры

// Заполняет и записывает объект Документооборота по данным объекта XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   Документ - СправочникОбъект.ИсходящиеДокументы - записываемый объект
//   ОбъектXDTO - ОбъектXDTO типа DMOutgoingDocument - источник данных
//   Ошибка - ОбъектXDTO типа DMError - неявно возвращаемое значение ошибки
//
// Возвращаемое значение:
//   Булево - Истина, если операция завершена успешно, и Ложь в противном случае
//
Функция ЗаписатьДанныеИсходящегоДокумента(Узел, Документ, ОбъектXDTO, Ошибка, УдалитьРегистрацию = Ложь)
	
	НачальныйРегистрационныйНомер = Документ.РегистрационныйНомер;
	НачальнаяДатаРегистрации = Документ.ДатаРегистрации;
	
	Блокировать = ЗначениеЗаполнено(Документ.Ссылка);
	Если Блокировать Тогда 
		Документ.Заблокировать();
	КонецЕсли;	
	ЗаполнитьДанныеИсходящегоДокумента(Узел, Документ, ОбъектXDTO);
	
	// проверка заполнения
	ТекстСообщения = "";
	ОбработкаЗапросовXDTO.ПроверитьЗаполнение(Документ, ТекстСообщения);
	Если Не ЗначениеЗаполнено(Документ.Получатели[0].Получатель) Тогда 
		ТекстСообщения = НСтр("ru = 'Поле ""Получатель"" не заполнено'") + Символы.ПС + ТекстСообщения;
	КонецЕсли;
	
	Если ТекстСообщения <> "" Тогда 
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при записи исходящего документа'");
		Ошибка.description = ТекстСообщения;
		Возврат Ложь;
	КонецЕсли;	
	
	
	// изменение полей по состоянию
	Если ЗначениеЗаполнено(Документ.Ссылка) Тогда 
		ТекущееСостояние = ОбработкаЗапросовXDTOПереопределяемый.ПолучитьСостояниеДокумента(Документ.Ссылка);
		ДоступныеПоля = ПолучитьДоступностьПолейПоСостоянию(Документ, ТекущееСостояние);
		
		Если ДоступныеПоля <> "" Тогда 
		
			ТекущиеДанные = ОбработкаЗапросовXDTO.СоздатьОбъект("DMOutgoingDocument");
			ПолучитьДанныеИсходящегоДокумента(Узел, Документ.Ссылка.ПолучитьОбъект(), ТекущиеДанные);
			
			Для Каждого Свойство Из ОбъектXDTO.Свойства() Цикл
				Если ОбъектXDTO.Установлено(Свойство) И Свойство.НижняяГраница = 0 И Свойство.ВерхняяГраница = 1 И Не ДоступныеПоля.Свойство(Свойство.Имя) Тогда 
					НовоеЗначениеСвойства = ОбъектXDTO.Получить(Свойство);
					ТекущееЗначениеСвойства = ТекущиеДанные.Получить(Свойство);
					
					Если ТипЗнч(НовоеЗначениеСвойства) = Тип("ОбъектXDTO") Тогда 
						Если ТекущееЗначениеСвойства = Неопределено Тогда 
							ТекущееЗначениеСвойства = ОбработкаЗапросовXDTO.СоздатьОбъект("DMObject");
							ТекущееЗначениеСвойства.name = "";
							ТекущееЗначениеСвойства.objectId = ОбработкаЗапросовXDTO.СоздатьОбъект("DMObjectID");
							ТекущееЗначениеСвойства.objectId.id = "";
							ТекущееЗначениеСвойства.objectId.type = "";
						КонецЕсли;
						
						Если НовоеЗначениеСвойства.objectId.id   <> ТекущееЗначениеСвойства.objectId.id 
						 Или НовоеЗначениеСвойства.objectId.type <> ТекущееЗначениеСвойства.objectId.type Тогда 
							Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
							Ошибка.subject = НСтр("ru = 'Ошибка при записи исходящего документа'");
							Ошибка.description = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку( 
								НСтр("ru = 'Свойство ""%1"" не может быть изменено для состояния ""%2""'"), Свойство.Имя, ТекущееСостояние);
							Возврат Ложь;
						КонецЕсли;
					Иначе	
						Если Не ЗначениеЗаполнено(НовоеЗначениеСвойства) И Не ЗначениеЗаполнено(ТекущееЗначениеСвойства) Тогда 
							Продолжить;
						КонецЕсли;	
						
						Если НовоеЗначениеСвойства <> ТекущееЗначениеСвойства Тогда 
							Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
							Ошибка.subject = НСтр("ru = 'Ошибка при записи исходящего документа'");
							Ошибка.description = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку( 
								НСтр("ru = 'Свойство ""%1"" не может быть изменено для состояния ""%2""'"), Свойство.Имя, ТекущееСостояние);
							Возврат Ложь;
						КонецЕсли;	
					КонецЕсли;	
				КонецЕсли;	
			КонецЦикла;	
			
		КонецЕсли;	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Документ.Ссылка) И Не ЗначениеЗаполнено(Документ.ДатаСоздания) Тогда
		Документ.ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Документ.Записать();
	
	// состояние
	ЗаполнитьСостоянияДокумента(Узел, Документ, ОбъектXDTO);
		
	// регистрация
	Если ЗначениеЗаполнено(Документ.РегистрационныйНомер) И Не ЗначениеЗаполнено(НачальныйРегистрационныйНомер) Тогда 
		СостояниеДокумента = Перечисления.СостоянияДокументов.Зарегистрирован;
		
		Делопроизводство.ЗаписатьСостояниеДокумента(
			Документ.Ссылка, 
			ТекущаяДата(), 
			СостояниеДокумента, 
			ПользователиКлиентСервер.ТекущийПользователь());
	КонецЕсли;
	
	Попытка // в отсутствие подходящего нумератора будет выброшено исключение
		Нумератор = Нумерация.ПолучитьНумераторДокумента(Документ);
	Исключение
		Нумератор = Неопределено;
	КонецПопытки;
	Если ЗначениеЗаполнено(Нумератор) Тогда 
		// изменен автоматический номер
		Если Документ.РегистрационныйНомер <> НачальныйРегистрационныйНомер Тогда 
			Документ.ЧисловойНомер = -1;
			Документ.Записать();
		КонецЕсли;
	КонецЕсли;
	
	Если УдалитьРегистрацию Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(Узел, Документ.Ссылка);
	КонецЕсли;
		
	Если Блокировать Тогда 
		Документ.Разблокировать();
	КонецЕсли;	
	
	Возврат Истина;
		
КонецФункции

// Заполняет объект Документооборота по данным объекта XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   ДокументОбъект - СправочникОбъект.ИсходящиеДокументы - заполняемый объект
//   ОбъектXDTO - ОбъектXDTO типа DMOutgoingDocument - источник данных заполнения
//
Процедура ЗаполнитьДанныеИсходящегоДокумента(Узел, ДокументОбъект, ОбъектXDTO)
	
	ЗаполнитьОбщиеДанныеДокумента(Узел, ДокументОбъект, ОбъектXDTO);
	
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ДокументОбъект.Подписал, 		ОбъектXDTO, "signer");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ДокументОбъект.Подготовил, 	ОбъектXDTO, "author");
	
	Если ДокументОбъект.Получатели.Количество() = 0 Тогда 
		ДокументОбъект.Получатели.Добавить();
	КонецЕсли;	
	
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ДокументОбъект.Получатели[0].ВходящийНомер,   ОбъектXDTO, "externalNumber");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ДокументОбъект.Получатели[0].ВходящаяДата,    ОбъектXDTO, "externalDate");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ДокументОбъект.Получатели[0].Получатель,  	ОбъектXDTO, "correspondent");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ДокументОбъект.Получатели[0].Адресат, 		ОбъектXDTO, "addressee");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ДокументОбъект.Получатели[0].Отправлен, 		ОбъектXDTO, "sent");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ДокументОбъект.Получатели[0].ДатаОтправки,	ОбъектXDTO, "sendDate");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ДокументОбъект.Получатели[0].СпособОтправки,  ОбъектXDTO, "deliveryMethod");
	
	ОбработкаЗапросовXDTO.ЗаписатьДополнительныеРеквизиты(Узел, ДокументОбъект, ОбъектXDTO);
	ЗаписатьДанныеФайлов(ДокументОбъект, ОбъектXDTO.files);
	
КонецПроцедуры

#КонецОбласти

#Область ВнутреннийДокумент

// Получает заполненный объект XDTO, соответствующий внутреннему документу
// 
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   ОбъектИд - ОбъектXDTO типа ObjectId, описывающий существующий документ
//   НаборКолонок - Массив - массив имен реквизитов к получению
//                - Неопределено - требование получить все реквизиты
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMInternalDocument или DMError
//
Функция ПолучитьВнутреннийДокумент(Узел, ОбъектИд, НаборКолонок = Неопределено) Экспорт 
	
	Попытка 
		
		Ссылка = ОбработкаЗапросовXDTO.ПолучитьСсылкуПоObjectID(ОбъектИд);
		Документ = Ссылка.ПолучитьОбъект();
		
		Объект = ОбработкаЗапросовXDTO.СоздатьОбъект("DMInternalDocument");
		ПолучитьДанныеВнутреннегоДокумента(Узел, Документ, Объект, НаборКолонок);
		
		Возврат Объект;
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при получении внутреннего документа'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;
	
КонецФункции	

// Создает новый внутренний документ по объекту XDTO
// 
// Параметры:
//   Сообщение - ОбъектXDTO типа DMCreateRequest
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMInternalDocument или DMError
//
Функция СоздатьВнутреннийДокумент(Сообщение) Экспорт 
	
	Попытка 
		
		Узел = ОбработкаЗапросовXDTO.УзелИнтегрированнойСистемы(Сообщение);
		Документ = Справочники.ВнутренниеДокументы.СоздатьЭлемент();
		Объект = Сообщение.object;
		УстановитьСсылкуНовогоДляСправочника(Документ, Объект);
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Если Не ЗаписатьДанныеВнутреннегоДокумента(Узел, Документ, Объект, Ошибка) Тогда 
			Возврат Ошибка;
		КонецЕсли;
		
		Если Объект.Установлено("externalObject") Тогда 
			ОбработкаЗапросовXDTO.ДобавитьСвязьОбъектаДОИВнешнегоОбъекта(Узел, Объект.externalObject.id, Объект.externalObject.type, Документ.Ссылка);
		КонецЕсли;	
		
		
		ОбъектИд = ОбработкаЗапросовXDTO.ПолучитьObjectIDПоСсылке(Документ.Ссылка);
		Возврат ПолучитьВнутреннийДокумент(Узел, ОбъектИд);
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при создании внутреннего документа'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;
	
КонецФункции	

// Изменяет и записывает внутренний документ по объекту XDTO
// 
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   Объект - ОбъектXDTO типа DMInternalDocument 
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMInternalDocument, заново заполненный, или DMError
//
Функция ИзменитьВнутреннийДокумент(Узел, Объект, УдалитьРегистрацию = Ложь) Экспорт 
	
	Попытка 
		
		Ссылка = ОбработкаЗапросовXDTO.ПолучитьСсылкуПоObjectID(Объект.objectId);
		
		ЧислоПодписейДо = ЭлектроннаяПодпись.КоличествоПодписей(Ссылка);
		ЧислоПодписейПосле = Объект.signatures.Количество();
		Если ЧислоПодписейДо > ЧислоПодписейПосле Тогда //удаляем подписи перед изменением карточки
			ОбработкаЗапросовXDTOФайлы.ЗанестиИнформациюОПодписяхОбъекта(Объект.signatures, Ссылка);
		КонецЕсли;	
		
		Документ = Ссылка.ПолучитьОбъект();
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Если Не ЗаписатьДанныеВнутреннегоДокумента(Узел, Документ, Объект, Ошибка, УдалитьРегистрацию) Тогда 
			Возврат Ошибка;
		КонецЕсли;
		
		Если ЧислоПодписейДо <= ЧислоПодписейПосле Тогда // добавляем подписи после изменения карточки
			ОбработкаЗапросовXDTOФайлы.ЗанестиИнформациюОПодписяхОбъекта(Объект.signatures, Ссылка);
		КонецЕсли;	
		
		ОбъектИд = ОбработкаЗапросовXDTO.ПолучитьObjectIDПоСсылке(Документ.Ссылка);
		Возврат ПолучитьВнутреннийДокумент(Узел, ОбъектИд);
		
	Исключение
		
		Если Ссылка <> Неопределено И УдалитьРегистрацию Тогда
			ПланыОбмена.УдалитьРегистрациюИзменений(Узел, Ссылка);
		КонецЕсли;
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при создании внутреннего документа'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;	
	
КонецФункции	

// Получает объект XDTO для нового внутреннего документа
// 
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   НаборКолонок - Массив - массив имен реквизитов к заполнению
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMInternalDocument или DMError
//
Функция ПолучитьНовыйВнутреннийДокумент(Узел, НаборКолонок) Экспорт 
	
	Попытка
		
		Документ = Справочники.ВнутренниеДокументы.СоздатьЭлемент();
		Документ.ОбработкаЗаполнения(Неопределено, Истина);
	
		Объект = ОбработкаЗапросовXDTO.СоздатьОбъект("DMInternalDocument");
		ПолучитьДанныеВнутреннегоДокумента(Узел, Документ, Объект, НаборКолонок);
		
		Возврат Объект;
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при получении нового внутреннего документа'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;
	
КонецФункции

// Заполняет объект XDTO по данным объекта Документооборота
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   Документ - СправочникОбъект.ВнутренниеДокументы
//   ОбъектXDTO - ОбъектXDTO типа DMInternalDocument
//   НаборКолонок - Массив - массив имен реквизитов к заполнению
//                - Неопределено - требование заполнить все реквизиты
//
Процедура ПолучитьДанныеВнутреннегоДокумента(Узел, Документ, ОбъектXDTO, НаборКолонок = Неопределено) Экспорт
	
	ДанныеДокумента = Новый Структура;
	
	ПолучитьОбщиеДанныеДокумента(ДанныеДокумента, Документ);
	
	ДанныеДокумента.Вставить("folder", 			Документ.Папка);
	ДанныеДокумента.Вставить("beginDate", 		Документ.ДатаНачалаДействия);
	ДанныеДокумента.Вставить("endDate", 		Документ.ДатаОкончанияДействия);
	ДанныеДокумента.Вставить("openEnded", 		Документ.Бессрочный);
	ДанныеДокумента.Вставить("correspondent", 	Документ.Корреспондент);
	ДанныеДокумента.Вставить("contactPerson", 	Документ.КонтактноеЛицо);
	ДанныеДокумента.Вставить("signer", 			Документ.Утвердил);
	ДанныеДокумента.Вставить("author", 			Документ.Подготовил);
	ДанныеДокумента.Вставить("prolongationProcedure", Документ.ПорядокПродления);
	
	// Состояние.
	Если ЗначениеЗаполнено(Документ.Ссылка) Тогда 
		СостояниеДокумента = ОбработкаЗапросовXDTOПереопределяемый.ПолучитьСостояниеДокумента(Документ.Ссылка);
	Иначе	
		СостояниеДокумента = Перечисления.СостоянияДокументов.Проект;
	КонецЕсли;
	ДанныеДокумента.Вставить("status", СостояниеДокумента);
		
	ИменаСостояний = Новый Структура("Согласование, Утверждение, Регистрация, Рассмотрение, Исполнение");
	
	Если ЗначениеЗаполнено(Документ.Ссылка) Тогда 
		ИменСвойствПоСостояниям = Новый Соответствие;
		ИменСвойствПоСостояниям.Вставить("Согласование", "statusApproval");
		ИменСвойствПоСостояниям.Вставить("Утверждение", "statusConfirmation");
		ИменСвойствПоСостояниям.Вставить("Регистрация", "statusRegistration");
		ИменСвойствПоСостояниям.Вставить("Рассмотрение", "statusConsideration");
		ИменСвойствПоСостояниям.Вставить("Исполнение", "statusPerformance");
		
		Для Каждого Строка Из ИменаСостояний Цикл
			ИмяСостояния = Строка.Ключ;
			СтруктураСостояния = Делопроизводство.ПолучитьСтруктуруСостоянияДокумента(Документ.Ссылка, "Состояние" + ИмяСостояния);
			ДанныеДокумента.Вставить(ИменСвойствПоСостояниям.Получить(ИмяСостояния), СтруктураСостояния.Состояние);
		КонецЦикла;
	КонецЕсли;
	
	// Настройки.
	ПолучитьОбщиеНастройкиДокумента(ДанныеДокумента, Документ);
	ДанныеДокумента.Вставить("documentTypeEnabled", Константы.ИспользоватьВидыВнутреннихДокументов.Получить());
	ДанныеДокумента.Вставить("filesEnabled", Истина);
	
	// Набор колонок.
	Колонки = Новый Массив;
	Если НаборКолонок <> Неопределено Тогда 
		Для Каждого Элемент Из НаборКолонок Цикл
			Колонки.Добавить(НРег(Элемент));
		КонецЦикла;
	КонецЕсли;
	ПолучатьВсеКолонки = (Колонки.Количество() = 0);
	
	// Заполним простые реквизиты.
	Для Каждого Реквизит Из ДанныеДокумента Цикл
		Если ПолучатьВсеКолонки Или Колонки.Найти(НРег(Реквизит.Ключ)) <> Неопределено Тогда 
			ОбработкаЗапросовXDTO.ЗаполнитьСвойствоXDTOИзРеквизита(ОбъектXDTO, Реквизит.Ключ, Реквизит.Значение);
		КонецЕсли;
	КонецЦикла;
	
	// Заполним реквизиты вида документа.
	Если ОбъектXDTO.Установлено("documentType") Тогда
		ПолучитьДанныеВидаДокумента(ОбъектXDTO.documentType, ДанныеДокумента.documentType);
		
		// Заполним суммы по статьям ДДС.
		Если ЗначениеЗаполнено(Документ.Ссылка)
			И ОбъектXDTO.documentType.Установлено("cashFlowDetailsEnabled")
			И ОбъектXDTO.documentType.cashFlowDetailsEnabled = Истина
			И (ПолучатьВсеКолонки Или Колонки.Найти(НРег("cashFlowItems")) <> Неопределено) Тогда
			
			ОбъектXDTO.cashFlowItems = ОбработкаЗапросовXDTO.СоздатьОбъект("DMCashFlowItemsCollection");
			СтатьиДвиженияДенежныхСредств = Новый ТаблицаЗначений;
			СтатьиДвиженияДенежныхСредств.Колонки.Добавить("СтатьяДвиженияДенежныхСредств");
			РегистрыСведений.СтатьиДвиженияДенежныхСредствДокументов.ПрочитатьСтатьиДокумента(
				Документ.Ссылка, СтатьиДвиженияДенежныхСредств);
				
			Для каждого Строка из СтатьиДвиженияДенежныхСредств Цикл
				СтатьяXDTO = ОбработкаЗапросовXDTO.СоздатьОбъект("DMCashFlowItem");
				СтатьяXDTO.objectId = ОбработкаЗапросовXDTO.ПолучитьObjectIDПоСсылке(
					Строка.СтатьяДвиженияДенежныхСредств);
				СтатьяXDTO.name = Строка(Строка.СтатьяДвиженияДенежныхСредств);
				ОбъектXDTO.cashFlowItems.items.Добавить(СтатьяXDTO);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	// Заполним файлы.
	Если ЗначениеЗаполнено(Документ.Ссылка) Тогда 
		Если ПолучатьВсеКолонки Или Колонки.Найти(НРег("files")) <> Неопределено Тогда 
			НаборКолонокФайлов = Новый Массив;
			ЗаполнитьКолонкиСпискаФайлов(НаборКолонокФайлов);
			
			МассивОбъектовДО = РаботаСФайламиВызовСервера.ПолучитьВсеПодчиненныеФайлы(Документ.Ссылка, Ложь);
			МассивФайлов = ОбработкаЗапросовXDTOФайлы.ЗаполнитьСписокФайлов(МассивОбъектовДО, НаборКолонокФайлов);
			ОбработкаЗапросовXDTOФайлы.ЗаполнитьСписокФайловИзМассива(ОбъектXDTO, МассивФайлов, НаборКолонокФайлов);
		КонецЕсли;
	КонецЕсли;
	
	// Заполним подписи.
	Если ЗначениеЗаполнено(Документ.Ссылка) Тогда 
		Если ПолучатьВсеКолонки Или Колонки.Найти(НРег("signatures")) <> Неопределено Тогда 
			МассивПодписей = ЗаполнитьСписокПодписей(Документ.Ссылка);
			ЗаполнитьXDTOСписокПодписей(ОбъектXDTO, МассивПодписей);
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(Документ.Ссылка) Тогда 
		Если ПолучатьВсеКолонки Или Колонки.Найти(НРег("keyPropertiesValue")) <> Неопределено Тогда 
			ОбъектXDTO.KeyPropertiesValue = РаботаСЭП.ПолучитьДвоичныеДанныеОбъекта(Документ.Ссылка);
		КонецЕсли;
	КонецЕсли;
	
	// Заполним связи.
	Если ЗначениеЗаполнено(Документ.Ссылка) Тогда 
		Если ПолучатьВсеКолонки Или Колонки.Найти(НРег("relations")) <> Неопределено Тогда 
			МассивСвязанных = ПолучитьСвязанныеДокументы(Узел, Документ.Ссылка);
			Для Каждого СвязанныйДокумент Из МассивСвязанных Цикл
				ОбъектXDTO.Relations.Добавить(СвязанныйДокумент);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// Заполним дополнительные реквизиты.
	Если ПолучатьВсеКолонки Или Колонки.Найти(НРег("additionalProperties")) <> Неопределено Тогда 
		ОбработкаЗапросовXDTO.ПолучитьНаборДополнительныхРеквизитовОбъектаДО(Документ, ОбъектXDTO);
	КонецЕсли;
	
	// Определим доступные поля.
	Если ПолучатьВсеКолонки Или Колонки.Найти(НРег("enabledProperties")) <> Неопределено Тогда 
		ДоступныеПоля = ПолучитьДоступностьПолейПоСостоянию(Документ, СостояниеДокумента);
		Если ДоступныеПоля <> "" Тогда 
			Для Каждого Строка Из ДоступныеПоля Цикл
				ОбъектXDTO.enabledProperties.Добавить(Строка.Ключ);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// Заполним ссылку на внешний объект.
	Если ПолучатьВсеКолонки Или Колонки.Найти(НРег("externalObject")) <> Неопределено Тогда
		ВнешнийОбъект = ОбработкаЗапросовXDTO.ПолучитьСсылкуНаВнешнийОбъект(Узел, Документ.Ссылка);
		Если ЗначениеЗаполнено(ВнешнийОбъект) Тогда
			ВнешнийОбъектXDTO = ОбработкаЗапросовXDTO.СоздатьОбъект("ExternalObject");
			ВнешнийОбъектXDTO.id = ВнешнийОбъект.id;
			ВнешнийОбъектXDTO.type = ВнешнийОбъект.type;
			ВнешнийОбъектXDTO.name = ВнешнийОбъект.name;
			ОбъектXDTO.externalObject = ВнешнийОбъектXDTO;
		КонецЕсли;
	КонецЕсли;
	
	ОбъектXDTO.objectId = ОбработкаЗапросовXDTO.ПолучитьObjectIDПоСсылке(Документ.Ссылка);
	ОбъектXDTO.name = Строка(Документ.Ссылка);
	
	// Заполним параметры хронометража.
	Если ПолучатьВсеКолонки Или Колонки.Найти(НРег("chronometrationSettings")) <> Неопределено Тогда 
		ОбработкаЗапросовXDTOУчетВремени.УстановитьПараметрыУчетаВремени(ОбъектXDTO, Документ.Ссылка);
	КонецЕсли;
	
	// Заполним признак "Содержит оригиналы".
	Если ПолучатьВсеКолонки Или Колонки.Найти(НРег("containsScannedOriginals")) <> Неопределено Тогда
		ЗаполнитьПризнакСодержитОригиналы(ОбъектXDTO, Документ.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

// Заполняет и записывает объект Документооборота по данным объекта XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   Документ - СправочникОбъект.ВнутренниеДокументы - записываемый объект
//   ОбъектXDTO - ОбъектXDTO типа DMInternalDocument - источник данных
//   Ошибка - ОбъектXDTO типа DMError - неявно возвращаемое значение ошибки
//
// Возвращаемое значение:
//   Булево - Истина, если операция завершена успешно, и Ложь в противном случае
//
Функция ЗаписатьДанныеВнутреннегоДокумента(Узел, Документ, ОбъектXDTO, Ошибка, УдалитьРегистрацию = Ложь)
	
	НачальныйРегистрационныйНомер = Документ.РегистрационныйНомер;
	НачальнаяДатаРегистрации = Документ.ДатаРегистрации;
	
	Блокировать = ЗначениеЗаполнено(Документ.Ссылка);
	Если Блокировать Тогда 
		Документ.Заблокировать();
	КонецЕсли;	
	ЗаполнитьДанныеВнутреннегоДокумента(Узел, Документ, ОбъектXDTO);
	
	// проверка заполнения
	ТекстСообщения = "";
	Если Не ОбработкаЗапросовXDTO.ПроверитьЗаполнение(Документ, ТекстСообщения) Тогда 
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при записи внутреннего документа'");
		Ошибка.description = ТекстСообщения;
		Возврат Ложь;
	КонецЕсли;	
	
	// изменение полей по состоянию
	Если ЗначениеЗаполнено(Документ.Ссылка) Тогда 
		ТекущееСостояние = ОбработкаЗапросовXDTOПереопределяемый.ПолучитьСостояниеДокумента(Документ.Ссылка);
		ДоступныеПоля = ПолучитьДоступностьПолейПоСостоянию(Документ, ТекущееСостояние);
		
		Если ДоступныеПоля <> "" Тогда 
		
			ТекущиеДанные = ОбработкаЗапросовXDTO.СоздатьОбъект("DMInternalDocument");
			ПолучитьДанныеВнутреннегоДокумента(Узел, Документ.Ссылка.ПолучитьОбъект(), ТекущиеДанные);
			
			Для Каждого Свойство Из ОбъектXDTO.Свойства() Цикл
				Если ОбъектXDTO.Установлено(Свойство) И Свойство.НижняяГраница = 0 И Свойство.ВерхняяГраница = 1 И Не ДоступныеПоля.Свойство(Свойство.Имя) Тогда 
					НовоеЗначениеСвойства = ОбъектXDTO.Получить(Свойство);
					ТекущееЗначениеСвойства = ТекущиеДанные.Получить(Свойство);
					
					Если ТипЗнч(НовоеЗначениеСвойства) = Тип("ОбъектXDTO") Тогда 
						Если ТекущееЗначениеСвойства = Неопределено Тогда 
							ТекущееЗначениеСвойства = ОбработкаЗапросовXDTO.СоздатьОбъект("DMObject");
							ТекущееЗначениеСвойства.name = "";
							ТекущееЗначениеСвойства.objectId = ОбработкаЗапросовXDTO.СоздатьОбъект("DMObjectID");
							ТекущееЗначениеСвойства.objectId.id = "";
							ТекущееЗначениеСвойства.objectId.type = "";
						КонецЕсли;
						
						Если НовоеЗначениеСвойства.objectId.id   <> ТекущееЗначениеСвойства.objectId.id 
						 Или НовоеЗначениеСвойства.objectId.type <> ТекущееЗначениеСвойства.objectId.type Тогда 
							Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
							Ошибка.subject = НСтр("ru = 'Ошибка при записи внутреннего документа'");
							Ошибка.description = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку( 
								НСтр("ru = 'Свойство ""%1"" не может быть изменено для состояния ""%2""'"), Свойство.Имя, ТекущееСостояние);
							Возврат Ложь;
						КонецЕсли;
					Иначе	
						Если Не ЗначениеЗаполнено(НовоеЗначениеСвойства) И Не ЗначениеЗаполнено(ТекущееЗначениеСвойства) Тогда 
							Продолжить;
						КонецЕсли;	
						
						Если НовоеЗначениеСвойства <> ТекущееЗначениеСвойства Тогда 
							Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
							Ошибка.subject = НСтр("ru = 'Ошибка при записи внутреннего документа'");
							Ошибка.description = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку( 
								НСтр("ru = 'Свойство ""%1"" не может быть изменено для состояния ""%2""'"), Свойство.Имя, ТекущееСостояние);
							Возврат Ложь;
						КонецЕсли;	
					КонецЕсли;	
				КонецЕсли;	
			КонецЦикла;	
			
		КонецЕсли;	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Документ.Ссылка) И Не ЗначениеЗаполнено(Документ.ДатаСоздания) Тогда
		Документ.ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Документ.Записать();
	
	// состояние
	ЗаполнитьСостоянияДокумента(Узел, Документ, ОбъектXDTO);
	
	// регистрация
	Если ЗначениеЗаполнено(Документ.РегистрационныйНомер) И Не ЗначениеЗаполнено(НачальныйРегистрационныйНомер) Тогда 
		СостояниеДокумента = Перечисления.СостоянияДокументов.Зарегистрирован;
		
		Делопроизводство.ЗаписатьСостояниеДокумента(
			Документ.Ссылка, 
			ТекущаяДата(), 
			СостояниеДокумента, 
			ПользователиКлиентСервер.ТекущийПользователь());
	КонецЕсли;
	
	Попытка // в отсутствие подходящего нумератора будет выброшено исключение
		Нумератор = Нумерация.ПолучитьНумераторДокумента(Документ);
	Исключение
		Нумератор = Неопределено;
	КонецПопытки;
	Если ЗначениеЗаполнено(Нумератор) Тогда 
		// изменен автоматический номер
		Если Документ.РегистрационныйНомер <> НачальныйРегистрационныйНомер Тогда 
			Документ.ЧисловойНомер = -1;
			Документ.Записать();
		КонецЕсли;
	КонецЕсли;
	
	Если УдалитьРегистрацию Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(Узел, Документ.Ссылка);
	КонецЕсли;
		
	Если Блокировать Тогда 
		Документ.Разблокировать();
	КонецЕсли;	
	
	Возврат Истина;
		
КонецФункции

// Заполняет объект Документооборота по данным объекта XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   ДокументОбъект - СправочникОбъект.ВнутренниеДокументы - заполняемый объект
//   ОбъектXDTO - ОбъектXDTO типа DMInternalDocument - источник данных заполнения
//
Процедура ЗаполнитьДанныеВнутреннегоДокумента(Узел, ДокументОбъект, ОбъектXDTO)
	
	ЗаполнитьОбщиеДанныеДокумента(Узел, ДокументОбъект, ОбъектXDTO);
	
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ДокументОбъект.Папка, 		 	 	ОбъектXDTO, "folder");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ДокументОбъект.ДатаНачалаДействия, 	ОбъектXDTO, "beginDate");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ДокументОбъект.ДатаОкончанияДействия, ОбъектXDTO, "endDate");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ДокументОбъект.Бессрочный,  			ОбъектXDTO, "openEnded");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ДокументОбъект.ПорядокПродления, 		ОбъектXDTO, "prolongationProcedure");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ДокументОбъект.Корреспондент, 		ОбъектXDTO, "correspondent");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ДокументОбъект.КонтактноеЛицо, 		ОбъектXDTO, "contactPerson");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ДокументОбъект.Утвердил, 				ОбъектXDTO, "signer");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ДокументОбъект.Подготовил, 			ОбъектXDTO, "author");
	
	// Запись корреспондента и контактного лица в табличную часть Корреспонденты.
	Если ЗначениеЗаполнено(ДокументОбъект.Корреспондент) Тогда
		Если ДокументОбъект.Корреспонденты.Количество() <= 1 Тогда
			ДокументОбъект.Корреспонденты.Очистить();
			СтрокаКорреспондента = ДокументОбъект.Корреспонденты.Добавить();
		Иначе
			СтрокаКорреспондента = ДокументОбъект.Корреспонденты[0];
		КонецЕсли;
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, СтрокаКорреспондента.Корреспондент, ОбъектXDTO, "correspondent");
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, СтрокаКорреспондента.КонтактноеЛицо, ОбъектXDTO, "contactPerson");
	КонецЕсли;
	
	// Заполним статьи ДДС.
	Если ДокументОбъект.ВидДокумента.ВестиУчетПоСтатьямДДС
		и ОбъектXDTO.Установлено("cashFlowItems") Тогда
		
		СтатьиДвиженияДенежныхСредств = Новый ТаблицаЗначений;
		СтатьиДвиженияДенежныхСредств.Колонки.Добавить("СтатьяДвиженияДенежныхСредств");
		
		Для каждого СтатьяXDTO из ОбъектXDTO.cashFlowItems.items Цикл
			Строка = СтатьиДвиженияДенежныхСредств.Добавить();
			Если Не ЗначениеЗаполнено(СтатьяXDTO.objectId.id) 
				И СтатьяXDTO.Установлено("ExternalObject") Тогда 
				Строка.СтатьяДвиженияДенежныхСредств 
					= НайтиСоздатьСтатьюДвиженияДенежныхСредств(Узел, СтатьяXDTO);
			Иначе
				Строка.СтатьяДвиженияДенежныхСредств 
					= ОбработкаЗапросовXDTO.ПолучитьСсылкуПоObjectID(СтатьяXDTO.objectId);
			КонецЕсли;
		КонецЦикла;
			
		РегистрыСведений.СтатьиДвиженияДенежныхСредствДокументов.ЗаписатьСтатьиДокумента(
			ДокументОбъект.Ссылка, СтатьиДвиженияДенежныхСредств)
			
	КонецЕсли;
	
	ОбработкаЗапросовXDTO.ЗаписатьДополнительныеРеквизиты(Узел, ДокументОбъект, ОбъектXDTO);
	ЗаписатьДанныеФайлов(ДокументОбъект, ОбъектXDTO.files);
	
КонецПроцедуры

// Получает массив вложенных папок
//
// Параметры:
//   ИдентификаторКорневойПапки - Строка - идентификатор папки-родителя
//
// Возвращаемое значение:
//   Массив - массив структур, описывающих вложенные папки следующего уровня:
//     * УникальныйИдентификатор - Строка - идентификатор вложенной папки
//     * Наименование - Строка - наименование вложенной папки
//
Функция ПолучитьСписокПапок(ИдентификаторКорневойПапки) Экспорт
	
	СсылкаПапки = Справочники.ПапкиВнутреннихДокументов.ПустаяСсылка();
	
	Если НЕ ПустаяСтрока(ИдентификаторКорневойПапки) Тогда
		УникальныйИдентификатор = Новый УникальныйИдентификатор(ИдентификаторКорневойПапки);
		СсылкаПапки = Справочники.ПапкиВнутреннихДокументов.ПолучитьСсылку(УникальныйИдентификатор);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПапкиВнутреннихДокументов.Ссылка КАК Ссылка,
		|	ПапкиВнутреннихДокументов.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ПапкиВнутреннихДокументов КАК ПапкиВнутреннихДокументов
		|ГДЕ
		|	ПапкиВнутреннихДокументов.Родитель = &Ссылка
		|	И ПапкиВнутреннихДокументов.ПометкаУдаления = &ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
		
	Запрос.УстановитьПараметр("Ссылка", СсылкаПапки);
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	
	МассивПапок = Новый Массив;
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураПапки = Новый Структура("УникальныйИдентификатор, Наименование", 
			Выборка.Ссылка.УникальныйИдентификатор(), Выборка.Наименование);
		МассивПапок.Добавить(СтруктураПапки);
	КонецЦикла;
	
	Возврат МассивПапок;
	
КонецФункции

#КонецОбласти

#Область Корреспондент

// Получает заполненный объект XDTO, соответствующий корреспонденту
// 
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   ОбъектИд - ОбъектXDTO типа ObjectId, описывающий существующего корреспондента
//   НаборКолонок - Массив - массив имен реквизитов к получению
//                - Неопределено - требование получить все реквизиты
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMCorrespondent или DMError
//
Функция ПолучитьКорреспондента(Узел, ОбъектИд, НаборКолонок = Неопределено) Экспорт 
	
	Попытка 
		
		Ссылка = ОбработкаЗапросовXDTO.ПолучитьСсылкуПоObjectID(ОбъектИд);
		Корреспондент = Ссылка.ПолучитьОбъект();
		
		Объект = ОбработкаЗапросовXDTO.СоздатьОбъект("DMCorrespondent");
		ПолучитьДанныеКорреспондента(Узел, Корреспондент, Объект, НаборКолонок);
		
		Возврат Объект;
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при получении корреспондента'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;
	
КонецФункции

// Создает нового корреспондента по объекту XDTO
// 
// Параметры:
//   Сообщение - ОбъектXDTO типа DMCreateRequest
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMCorrespondent или DMError
//
Функция СоздатьКорреспондента(Сообщение) Экспорт 
	
	Попытка 
		
		Узел = ОбработкаЗапросовXDTO.УзелИнтегрированнойСистемы(Сообщение);
		Корреспондент = Справочники.Корреспонденты.СоздатьЭлемент();
		Объект = Сообщение.object;
		УстановитьСсылкуНовогоДляСправочника(Корреспондент, Объект);
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Если Не ЗаписатьДанныеКорреспондента(Узел, Корреспондент, Объект, Ошибка, Ложь) Тогда 
			Возврат Ошибка;
		КонецЕсли;
		
		Если Объект.Установлено("externalObject") Тогда 
			ОбработкаЗапросовXDTO.ДобавитьСвязьОбъектаДОИВнешнегоОбъекта(Узел, Объект.externalObject.id, Объект.externalObject.type, Корреспондент.Ссылка);
		КонецЕсли;	
		
		ОбъектИд = ОбработкаЗапросовXDTO.ПолучитьObjectIDПоСсылке(Корреспондент.Ссылка);
		Возврат ПолучитьКорреспондента(Узел, ОбъектИд);
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при создании корреспондента'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;
	
КонецФункции

// Изменяет и записывает корреспондента по объекту XDTO
// 
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   Объект - ОбъектXDTO типа DMCorrespondent 
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMCorrespondent, заново заполненный, или DMError
//
Функция ИзменитьКорреспондента(Узел, Объект, УдалитьРегистрацию = Ложь) Экспорт 
	
	Попытка 
		
		Ссылка = ОбработкаЗапросовXDTO.ПолучитьСсылкуПоObjectID(Объект.objectId);
		Корреспондент = Ссылка.ПолучитьОбъект();
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Если Не ЗаписатьДанныеКорреспондента(Узел, Корреспондент, Объект, Ошибка, УдалитьРегистрацию) Тогда 
			Возврат Ошибка;
		КонецЕсли;
		
		ОбъектИд = ОбработкаЗапросовXDTO.ПолучитьObjectIDПоСсылке(Корреспондент.Ссылка);
		Возврат ПолучитьКорреспондента(Узел, ОбъектИд);
		
	Исключение
		
		Если Ссылка <> Неопределено И УдалитьРегистрацию Тогда
			ПланыОбмена.УдалитьРегистрациюИзменений(Узел, Ссылка);
		КонецЕсли;
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при создании корреспондента'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;	
	
КонецФункции

// Получает объект XDTO для нового корреспондента
// 
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   НаборКолонок - Массив - массив имен реквизитов к заполнению
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMCorrespondent или DMError
//
Функция ПолучитьНовогоКорреспондента(Узел, НаборКолонок) Экспорт 
	
	Попытка
		
		Корреспондент = Справочники.Корреспонденты.СоздатьЭлемент();
		Корреспондент.Заполнить(Неопределено);
	
		Объект = ОбработкаЗапросовXDTO.СоздатьОбъект("DMCorrespondent");
		ПолучитьДанныеКорреспондента(Узел, Корреспондент, Объект, НаборКолонок);
		
		Возврат Объект;
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при получении нового корреспондента'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;
	
КонецФункции

// Заполняет объект XDTO по данным объекта Документооборота
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   Корреспондент - СправочникОбъект.Корреспонденты
//   ОбъектXDTO - ОбъектXDTO типа DMCorrespondent
//   НаборКолонок - Массив - массив имен реквизитов к заполнению
//                - Неопределено - требование заполнить все реквизиты
//
Процедура ПолучитьДанныеКорреспондента(Узел, Корреспондент, ОбъектXDTO, НаборКолонок = Неопределено) 
	
	ДанныеКорреспондента = Новый Структура;
	ДанныеКорреспондента.Вставить("inn", 	  Корреспондент.ИНН);
	ДанныеКорреспондента.Вставить("kpp", 	  Корреспондент.КПП);
	ДанныеКорреспондента.Вставить("okpo", 	  Корреспондент.КодПоОКПО);
	ДанныеКорреспондента.Вставить("fullName", Корреспондент.ПолноеНаименование);
	ДанныеКорреспондента.Вставить("comment",  Корреспондент.Комментарий);
	
	ДанныеКорреспондента.Вставить("privatePerson", 		Корреспондент.ФизЛицо);
	ДанныеКорреспондента.Вставить("legalPrivatePerson", Корреспондент.ЮрФизЛицо);
	ДанныеКорреспондента.Вставить("responsible", 		Корреспондент.Ответственный);
	
	// набор колонок
	Колонки = Новый Массив;
	Если НаборКолонок <> Неопределено Тогда 
		Для Каждого Элемент Из НаборКолонок Цикл
			Колонки.Добавить(НРег(Элемент));
		КонецЦикла;	
	КонецЕсли;
	ПолучатьВсеКолонки = (Колонки.Количество() = 0);
	
	Для Каждого Реквизит Из ДанныеКорреспондента Цикл
		Если Колонки.Количество() = 0 Или Колонки.Найти(НРег(Реквизит.Ключ)) <> Неопределено Тогда 
			ОбработкаЗапросовXDTO.ЗаполнитьСвойствоXDTOИзРеквизита(ОбъектXDTO, Реквизит.Ключ, Реквизит.Значение);
		КонецЕсли;	
	КонецЦикла;
	
	// контактная информация
	Если ПолучатьВсеКолонки Или Колонки.Найти(НРег("contactInformation")) <> Неопределено Тогда 
		ПолучитьКонтактнуюИнформациюОбъектаДО(Корреспондент, ОбъектXDTO);
	КонецЕсли;	
	
	// доп. реквизиты
	Если ПолучатьВсеКолонки Или Колонки.Найти(НРег("additionalProperties")) <> Неопределено Тогда 
		ОбработкаЗапросовXDTO.ПолучитьНаборДополнительныхРеквизитовОбъектаДО(Корреспондент, ОбъектXDTO);
	КонецЕсли;	
	
	// внешний объект
	Если ПолучатьВсеКолонки Или Колонки.Найти(НРег("externalObject")) <> Неопределено Тогда
		ВнешнийОбъект = ОбработкаЗапросовXDTO.ПолучитьСсылкуНаВнешнийОбъект(Узел, Корреспондент.Ссылка);
		Если ЗначениеЗаполнено(ВнешнийОбъект) Тогда
			ВнешнийОбъектXDTO = ОбработкаЗапросовXDTO.СоздатьОбъект("ExternalObject");
			ВнешнийОбъектXDTO.id = ВнешнийОбъект.id;
			ВнешнийОбъектXDTO.type = ВнешнийОбъект.type;
			ВнешнийОбъектXDTO.name = ВнешнийОбъект.name;
			ОбъектXDTO.externalObject = ВнешнийОбъектXDTO;
		КонецЕсли;
	КонецЕсли;
	
	ОбъектXDTO.objectId = ОбработкаЗапросовXDTO.ПолучитьObjectIDПоСсылке(Корреспондент.Ссылка);
	ОбъектXDTO.name = Корреспондент.Наименование;
	
КонецПроцедуры	

// Заполняет и записывает объект Документооборота по данным объекта XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   Корреспондент - СправочникОбъект.Корреспонденты - записываемый объект
//   ОбъектXDTO - ОбъектXDTO типа DMCorrespondent - источник данных
//   Ошибка - ОбъектXDTO типа DMError - неявно возвращаемое значение ошибки
//
// Возвращаемое значение:
//   Булево - Истина, если операция завершена успешно, и Ложь в противном случае
//
Функция ЗаписатьДанныеКорреспондента(Узел, Корреспондент, ОбъектXDTO, Ошибка, УдалитьРегистрацию = Ложь) 
	
	Блокировать = ЗначениеЗаполнено(Корреспондент.Ссылка);
	Если Блокировать Тогда 
		Корреспондент.Заблокировать();
	КонецЕсли;	
	
	ЗаполнитьДанныеКорреспондента(Узел, Корреспондент, ОбъектXDTO);
	
	// проверка заполнения
	ТекстСообщения = "";
	Если Не ОбработкаЗапросовXDTO.ПроверитьЗаполнение(Корреспондент, ТекстСообщения) Тогда 
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при записи корреспондента'");
		Ошибка.description = ТекстСообщения;
		Возврат Ложь;
	КонецЕсли;
	
	Корреспондент.Записать();
	
	Если УдалитьРегистрацию Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(Узел, Корреспондент.Ссылка);
	КонецЕсли;
		
	Если Блокировать Тогда 
		Корреспондент.Разблокировать();
	КонецЕсли;	
	
	Возврат Истина;
	
КонецФункции	

// Заполняет объект Документооборота по данным объекта XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   Корреспондент - СправочникОбъект.Корреспонденты - заполняемый объект
//   ОбъектXDTO - ОбъектXDTO типа DMCorrespondent - источник данных заполнения
//
Процедура ЗаполнитьДанныеКорреспондента(Узел, Корреспондент, ОбъектXDTO) 
	
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Корреспондент.Наименование, ОбъектXDTO, "name");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Корреспондент.ИНН, 		  ОбъектXDTO, "inn");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Корреспондент.КПП, 		  ОбъектXDTO, "kpp");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Корреспондент.КодПоОКПО, 	  ОбъектXDTO, "okpo");
	
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Корреспондент.ПолноеНаименование, ОбъектXDTO, "fullName");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Корреспондент.Комментарий,  ОбъектXDTO, "comment");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Корреспондент.ФизЛицо, 	  ОбъектXDTO, "privatePerson");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Корреспондент.Ответственный, ОбъектXDTO, "responsible");
	
	Если ОбъектXDTO.Установлено("legalPrivatePerson") Тогда 
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Корреспондент.ЮрФизЛицо, ОбъектXDTO, "legalPrivatePerson");
	Иначе
		Если Не ЗначениеЗаполнено(Корреспондент.ЮрФизЛицо) Тогда
			Корреспондент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо;
		КонецЕсли; 
	КонецЕсли;	
	
	ЗаполнитьКонтактнуюИнформациюОбъектаДО(Корреспондент, ОбъектXDTO);
	ОбработкаЗапросовXDTO.ЗаписатьДополнительныеРеквизиты(Узел, Корреспондент, ОбъектXDTO);
	
КонецПроцедуры	

// Находит подходящего или создает нового корреспондента по объекту XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   ОбъектXDTO - ОбъектXDTO типа DMCorrespondent
//
// Возвращаемое значение:
//   СправочникСсылка.Корреспонденты - найденный или созданный корреспондент
//
Функция НайтиСоздатьКорреспондента(Узел, ОбъектXDTO) Экспорт 
	
	ВнешнийID = ОбъектXDTO.externalObject.id;
	ВнешнийТип = ОбъектXDTO.externalObject.type;
	СсылкаДО = Неопределено;
	
	// синхронизация по наименованию
	Если Не ЗначениеЗаполнено(ВнешнийID) Тогда 
		
		Наименование = Неопределено;
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Наименование, ОбъектXDTO, "name");
		СсылкаДО = Справочники.Корреспонденты.НайтиПоНаименованию(Наименование, Истина); 
		Если Не ЗначениеЗаполнено(СсылкаДО) Тогда 
			ОбъектДО = Справочники.Корреспонденты.СоздатьЭлемент();
			ОбъектДО.Наименование = Наименование;
			ОбъектДО.Записать();
			СсылкаДО = ОбъектДО.Ссылка;
		КонецЕсли;	
		
		Возврат СсылкаДО;
	КонецЕсли;
		
	СсылкаДО = СправочникСсылкаПоИдентификаторуВнешнегоОбъекта(Узел, ОбъектXDTO, "Корреспонденты");
	Если СсылкаДО <> Неопределено Тогда
		ОбъектДО = СсылкаДО.ПолучитьОбъект();
		ОбъектДО.Заблокировать();
		ЗаполнитьДанныеКорреспондента(Узел, ОбъектДО, ОбъектXDTO);
		Если ОбъектДО.Модифицированность() Тогда
			ОбъектДО.Записать();
		КонецЕсли;
		Возврат СсылкаДО;
	КонецЕсли;
		
	// переопределяемый поиск
	СсылкаДО = ОбработкаЗапросовXDTOПереопределяемый.НайтиСоответствиеДляВнешнегоОбъекта(ОбъектXDTO);
	Если ЗначениеЗаполнено(СсылкаДО) Тогда 
		
		ОбъектДО = СсылкаДО.ПолучитьОбъект();
		ОбъектДО.Заблокировать();
		ЗаполнитьДанныеКорреспондента(Узел, ОбъектДО, ОбъектXDTO);
		Если ОбъектДО.Модифицированность() Тогда
			ОбъектДО.Записать();
		КонецЕсли;
	
		Возврат ОбъектДО.Ссылка;
		
	КонецЕсли;
	
	// стандартный поиск
	Наименование = "";
	ИНН = "";
	КПП = "";
	
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Наименование, 	ОбъектXDTO, "name");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ИНН, 			ОбъектXDTO, "inn");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, КПП, 			ОбъектXDTO, "kpp");
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Ссылка
	|ИЗ
	|	Справочник.Корреспонденты";
	
	РезультатПустой = Истина;
	Если ЗначениеЗаполнено(ИНН) И ЗначениеЗаполнено(КПП) Тогда 
		Запрос.Текст = ТекстЗапроса + " ГДЕ ИНН = &ИНН И КПП = &КПП ";
		Запрос.УстановитьПараметр("ИНН", ИНН);
		Запрос.УстановитьПараметр("КПП", КПП);
		
		Результат = Запрос.Выполнить();
		РезультатПустой = Результат.Пустой();
	КонецЕсли;
	
	Если РезультатПустой И ЗначениеЗаполнено(ИНН) Тогда 
		Запрос.Текст = ТекстЗапроса + " ГДЕ ИНН = &ИНН И Наименование = &Наименование ";
		Запрос.УстановитьПараметр("ИНН", ИНН);
		Запрос.УстановитьПараметр("Наименование", Наименование);
		
		Результат = Запрос.Выполнить();
		РезультатПустой = Результат.Пустой();
	КонецЕсли;
	
	Если РезультатПустой Тогда 
		Запрос.Текст = ТекстЗапроса + " ГДЕ Наименование = &Наименование ";
		Запрос.УстановитьПараметр("Наименование", Наименование);
		
		Результат = Запрос.Выполнить();
		РезультатПустой = Результат.Пустой();
	КонецЕсли;
	
	
	Если РезультатПустой Тогда 
		ОбъектДО = Справочники.Корреспонденты.СоздатьЭлемент();
		УстановитьСсылкуНовогоДляСправочника(ОбъектДО, ОбъектXDTO);
	Иначе	
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ОбъектДО = Выборка.Ссылка.ПолучитьОбъект();
	КонецЕсли;	
	ОбъектДО.Заблокировать();
	ЗаполнитьДанныеКорреспондента(Узел, ОбъектДО, ОбъектXDTO);
	Если ОбъектДО.Модифицированность() Тогда
		ОбъектДО.Записать();
	КонецЕсли;
	
	Возврат ОбъектДО.Ссылка;
	
КонецФункции

#КонецОбласти

#Область Организация

// Получает заполненный объект XDTO, соответствующий организации
// 
// Параметры:
//   ОбъектИд - ОбъектXDTO типа ObjectId, описывающий существующую организацию
//   НаборКолонок - Массив - массив имен реквизитов к получению
//                - Неопределено - требование получить все реквизиты
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMOrganization или DMError
//
Функция ПолучитьОрганизацию(ОбъектИд, НаборКолонок = Неопределено) Экспорт 
	
	Попытка 
		
		Ссылка = ОбработкаЗапросовXDTO.ПолучитьСсылкуПоObjectID(ОбъектИд);
		Организация = Ссылка.ПолучитьОбъект();
		
		Объект = ОбработкаЗапросовXDTO.СоздатьОбъект("DMOrganization");
		ПолучитьДанныеОрганизации(Организация, Объект, НаборКолонок);
		
		Возврат Объект;
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при получении организации'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;
	
КонецФункции

// Заполняет объект XDTO по данным объекта Документооборота
//
// Параметры:
//   Организация - СправочникОбъект.Организации
//   ОбъектXDTO - ОбъектXDTO типа DMOrganization
//   НаборКолонок - Массив - массив имен реквизитов к заполнению
//                - Неопределено - требование заполнить все реквизиты
//
Процедура ПолучитьДанныеОрганизации(Организация, ОбъектXDTO, НаборКолонок = Неопределено) 
	
	ДанныеОрганизации = Новый Структура;
	ДанныеОрганизации.Вставить("inn", 	  	Организация.ИНН);
	ДанныеОрганизации.Вставить("kpp", 	  	Организация.КПП);
	ДанныеОрганизации.Вставить("okpo", 	  	Организация.КодПоОКПО);
	ДанныеОрганизации.Вставить("fullName", 	Организация.ПолноеНаименование);
	ДанныеОрганизации.Вставить("comment",  	Организация.Комментарий);
	ДанныеОрганизации.Вставить("prefix",   	Организация.Префикс);
	ДанныеОрганизации.Вставить("legalPrivatePerson", Организация.ЮрФизЛицо);
	
	// набор колонок
	Колонки = Новый Массив;
	Если НаборКолонок <> Неопределено Тогда 
		Для Каждого Элемент Из НаборКолонок Цикл
			Колонки.Добавить(НРег(Элемент));
		КонецЦикла;	
	КонецЕсли;
	
	Для Каждого Реквизит Из ДанныеОрганизации Цикл
		Если Колонки.Количество() = 0 Или Колонки.Найти(НРег(Реквизит.Ключ)) <> Неопределено Тогда 
			ОбработкаЗапросовXDTO.ЗаполнитьСвойствоXDTOИзРеквизита(ОбъектXDTO, Реквизит.Ключ, Реквизит.Значение);
		КонецЕсли;	
	КонецЦикла;
	
	ОбъектXDTO.objectId = ОбработкаЗапросовXDTO.ПолучитьObjectIDПоСсылке(Организация.Ссылка);
	ОбъектXDTO.name = Организация.Наименование;
	
КонецПроцедуры	

// Создает новую организацию по объекту XDTO
// 
// Параметры:
//   Сообщение - ОбъектXDTO типа DMCreateRequest
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMOrganization или DMError
//
Функция СоздатьОрганизацию(Сообщение) Экспорт 
	
	Попытка 
		
		Узел = ОбработкаЗапросовXDTO.УзелИнтегрированнойСистемы(Сообщение);
		Организация = Справочники.Организации.СоздатьЭлемент();
		Объект = Сообщение.object;
		УстановитьСсылкуНовогоДляСправочника(Организация, Объект);
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Если Не ЗаписатьДанныеОрганизации(Узел, Организация, Объект, Ошибка) Тогда 
			Возврат Ошибка;
		КонецЕсли;
		
		Если Объект.Установлено("externalObject") Тогда 
			ОбработкаЗапросовXDTO.ДобавитьСвязьОбъектаДОИВнешнегоОбъекта(Узел, Объект.externalObject.id, Объект.externalObject.type, Организация.Ссылка);
		КонецЕсли;	
		
		
		ОбъектИд = ОбработкаЗапросовXDTO.ПолучитьObjectIDПоСсылке(Организация.Ссылка);
		Возврат ПолучитьОрганизацию(ОбъектИд);
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при создании организации'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;
	
КонецФункции

// Изменяет и записывает организацию по объекту XDTO
// 
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   Объект - ОбъектXDTO типа DMOrganization 
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMOrganization, заново заполненный, или DMError
//
Функция ИзменитьОрганизацию(Узел, Объект) Экспорт 
	
	Попытка 
		
		Ссылка = ОбработкаЗапросовXDTO.ПолучитьСсылкуПоObjectID(Объект.objectId);
		Организация = Ссылка.ПолучитьОбъект();
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Если Не ЗаписатьДанныеОрганизации(Узел, Организация, Объект, Ошибка) Тогда 
			Возврат Ошибка;
		КонецЕсли;
		
		ОбъектИд = ОбработкаЗапросовXDTO.ПолучитьObjectIDПоСсылке(Организация.Ссылка);
		Возврат ПолучитьОрганизацию(ОбъектИд);
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при создании организации'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;	
	
КонецФункции

// Заполняет и записывает объект Документооборота по данным объекта XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   Организация - СправочникОбъект.Организации - записываемый объект
//   ОбъектXDTO - ОбъектXDTO типа DMOrganization - источник данных
//   Ошибка - ОбъектXDTO типа DMError - неявно возвращаемое значение ошибки
//
// Возвращаемое значение:
//   Булево - Истина, если операция завершена успешно, и Ложь в противном случае
//
Функция ЗаписатьДанныеОрганизации(Узел, Организация, ОбъектXDTO, Ошибка) 
	
	Организация.Заблокировать();
	ЗаполнитьДанныеОрганизации(Узел, Организация, ОбъектXDTO);
	
	// проверка заполнения
	ТекстСообщения = "";
	Если Не ОбработкаЗапросовXDTO.ПроверитьЗаполнение(Организация, ТекстСообщения) Тогда 
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при записи организации'");
		Ошибка.description = ТекстСообщения;
		Возврат Ложь;
	КонецЕсли;
	
	Организация.Записать();
	
	Возврат Истина;
	
КонецФункции	

// Заполняет объект Документооборота по данным объекта XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   Организация - СправочникОбъект.Организации - заполняемый объект
//   ОбъектXDTO - ОбъектXDTO типа DMOrganization - источник данных заполнения
//
Процедура ЗаполнитьДанныеОрганизации(Узел, Организация, ОбъектXDTO) Экспорт 
	
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Организация.Наименование, 	ОбъектXDTO, "name");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Организация.ИНН, 			ОбъектXDTO, "inn");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Организация.КПП, 			ОбъектXDTO, "kpp");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Организация.КодПоОКПО, 		ОбъектXDTO, "okpo");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Организация.Префикс, 		ОбъектXDTO, "prefix");
	
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Организация.ПолноеНаименование, 	ОбъектXDTO, "fullName");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Организация.Комментарий, 			ОбъектXDTO, "comment");
	
	Если ОбъектXDTO.Установлено("legalPrivatePerson") Тогда 
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Организация.ЮрФизЛицо, 	ОбъектXDTO, "legalPrivatePerson");
	Иначе
		Организация.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо;
	КонецЕсли;
	
КонецПроцедуры

// Находит подходящую или создает новую организацию по объекту XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   ОбъектXDTO - ОбъектXDTO типа DMOrganization
//
// Возвращаемое значение:
//   СправочникСсылка.Организации - найденная или созданная организация
//
Функция НайтиСоздатьОрганизацию(Узел, ОбъектXDTO) Экспорт
	
	ВнешнийID = ОбъектXDTO.externalObject.id;
	ВнешнийТип = ОбъектXDTO.externalObject.type;
	СсылкаДО = Неопределено;
	
	// синхронизация по наименованию
	Если Не ЗначениеЗаполнено(ВнешнийID) Тогда 
		
		Наименование = Неопределено;
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Наименование, ОбъектXDTO, "name");
		СсылкаДО = Справочники.Организации.НайтиПоНаименованию(Наименование, Истина); 
		Если Не ЗначениеЗаполнено(СсылкаДО) Тогда 
			ОбъектДО = Справочники.Организации.СоздатьЭлемент();
			ОбъектДО.Наименование = Наименование;
			ОбъектДО.Записать();
			СсылкаДО = ОбъектДО.Ссылка;
		КонецЕсли;
		
		Возврат СсылкаДО;
	КонецЕсли;
	
	// синхронизация по ID
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СсылкаНаОбъектДО
	|ИЗ
	|	РегистрСведений.СвязиОбъектовИнтегрированныхСистем
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(СсылкаНаОбъектДО) = ТИП(Справочник.Организации)
	|	И ИДВнешнегоОбъекта = &ИДВнешнегоОбъекта И (ТипВнешнегоОбъекта = &ТипВнешнегоОбъекта ИЛИ ТипВнешнегоОбъекта = """")";
	
	Запрос.УстановитьПараметр("ИДВнешнегоОбъекта", ВнешнийID);
	Запрос.УстановитьПараметр("ТипВнешнегоОбъекта", ВнешнийТип);
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда 
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		СсылкаДО = Выборка.СсылкаНаОбъектДО;
		
		ОбъектДО = СсылкаДО.ПолучитьОбъект();
		ОбъектДО.Заблокировать();
		ЗаполнитьДанныеОрганизации(Узел, ОбъектДО, ОбъектXDTO);
		Если ОбъектДО.Модифицированность() Тогда
			ОбъектДО.Записать();
		КонецЕсли;
		
		Возврат ОбъектДО.Ссылка;
		
	КонецЕсли;
		
	// переопределяемый поиск
	СсылкаДО = ОбработкаЗапросовXDTOПереопределяемый.НайтиСоответствиеДляВнешнегоОбъекта(ОбъектXDTO);
	Если ЗначениеЗаполнено(СсылкаДО) Тогда 
		
		ОбъектДО = СсылкаДО.ПолучитьОбъект();
		ОбъектДО.Заблокировать();
		ЗаполнитьДанныеОрганизации(Узел, ОбъектДО, ОбъектXDTO);
		Если ОбъектДО.Модифицированность() Тогда
			ОбъектДО.Записать();
		КонецЕсли;
	
		Возврат ОбъектДО.Ссылка;
		
	КонецЕсли;
	
	// стандартный поиск
	Наименование = "";
	ИНН = "";
	КПП = "";
	
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Наименование, 	ОбъектXDTO, "name");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ИНН, 			ОбъектXDTO, "inn");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, КПП, 			ОбъектXDTO, "kpp");
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Организации.Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации";
	
	РезультатПустой = Истина;
	Если ЗначениеЗаполнено(ИНН) И ЗначениеЗаполнено(КПП) Тогда 
		Запрос.Текст = ТекстЗапроса + " ГДЕ ИНН = &ИНН И КПП = &КПП ";
		Запрос.УстановитьПараметр("ИНН", ИНН);
		Запрос.УстановитьПараметр("КПП", КПП);
		
		Результат = Запрос.Выполнить();
		РезультатПустой = Результат.Пустой();
	КонецЕсли;	
	
	Если РезультатПустой И ЗначениеЗаполнено(ИНН) Тогда 
		Запрос.Текст = ТекстЗапроса + " ГДЕ ИНН = &ИНН И Наименование = &Наименование ";
		Запрос.УстановитьПараметр("ИНН", ИНН);
		Запрос.УстановитьПараметр("Наименование", Наименование);
		
		Результат = Запрос.Выполнить();
		РезультатПустой = Результат.Пустой();
	КонецЕсли;	
	
	Если РезультатПустой Тогда 
		Запрос.Текст = ТекстЗапроса + " ГДЕ Наименование = &Наименование ";
		Запрос.УстановитьПараметр("Наименование", Наименование);
		
		Результат = Запрос.Выполнить();
		РезультатПустой = Результат.Пустой();
	КонецЕсли;
	
	
	Если РезультатПустой Тогда 
		ОбъектДО = Справочники.Организации.СоздатьЭлемент();
		УстановитьСсылкуНовогоДляСправочника(ОбъектДО, ОбъектXDTO);
	Иначе	
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ОбъектДО = Выборка.Ссылка.ПолучитьОбъект();
	КонецЕсли;	
	ОбъектДО.Заблокировать();
	ЗаполнитьДанныеОрганизации(Узел, ОбъектДО, ОбъектXDTO);
	Если ОбъектДО.Модифицированность() Тогда
		ОбъектДО.Записать();
	КонецЕсли;
	
	Возврат ОбъектДО.Ссылка;
	
КонецФункции	

#КонецОбласти

#Область ФизическоеЛицо

// Получает заполненный объект XDTO, соответствующий физическому лицу
// 
// Параметры:
//   ОбъектИд - ОбъектXDTO типа ObjectId, описывающий существующее физлицо
//   НаборКолонок - Массив - массив имен реквизитов к получению
//                - Неопределено - требование получить все реквизиты
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMPrivatePerson или DMError
//
Функция ПолучитьФизическоеЛицо(ОбъектИд, НаборКолонок = Неопределено) Экспорт 
	
	Попытка 
		
		Ссылка = ОбработкаЗапросовXDTO.ПолучитьСсылкуПоObjectID(ОбъектИд);
		ФизЛицо = Ссылка.ПолучитьОбъект();
		
		Объект = ОбработкаЗапросовXDTO.СоздатьОбъект("DMPrivatePerson");
		ПолучитьДанныеФизическогоЛица(ФизЛицо, Объект, НаборКолонок);
		
		Возврат Объект;
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при получении физического лица'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;
	
КонецФункции

// Заполняет объект XDTO по данным объекта Документооборота
//
// Параметры:
//   ФизЛицо - СправочникОбъект.ФизическиеЛица
//   ОбъектXDTO - ОбъектXDTO типа DMPrivatePerson
//   НаборКолонок - Массив - массив имен реквизитов к заполнению
//                - Неопределено - требование заполнить все реквизиты
//
Процедура ПолучитьДанныеФизическогоЛица(ФизЛицо, ОбъектXDTO, НаборКолонок = Неопределено) 
	
	ДанныеФизЛица = Новый Структура;
	ДанныеФизЛица.Вставить("birthDay", ФизЛицо.ДатаРождения);
	ДанныеФизЛица.Вставить("comment",  ФизЛицо.Комментарий);
	
	// набор колонок
	Колонки = Новый Массив;
	Если НаборКолонок <> Неопределено Тогда 
		Для Каждого Элемент Из НаборКолонок Цикл
			Колонки.Добавить(НРег(Элемент));
		КонецЦикла;	
	КонецЕсли;
	
	Для Каждого Реквизит Из ДанныеФизЛица Цикл
		Если Колонки.Количество() = 0 Или Колонки.Найти(НРег(Реквизит.Ключ)) <> Неопределено Тогда 
			ОбработкаЗапросовXDTO.ЗаполнитьСвойствоXDTOИзРеквизита(ОбъектXDTO, Реквизит.Ключ, Реквизит.Значение);
		КонецЕсли;	
	КонецЦикла;
	
	ОбъектXDTO.objectId = ОбработкаЗапросовXDTO.ПолучитьObjectIDПоСсылке(ФизЛицо.Ссылка);
	ОбъектXDTO.name = ФизЛицо.Наименование;
	
КонецПроцедуры	

// Создает новое физическое лицо по объекту XDTO
// 
// Параметры:
//   Сообщение - ОбъектXDTO типа DMCreateRequest
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMPrivatePerson или DMError
//
Функция СоздатьФизическоеЛицо(Сообщение) Экспорт 
	
	Попытка 
		
		Узел = ОбработкаЗапросовXDTO.УзелИнтегрированнойСистемы(Сообщение);
		ФизЛицо = Справочники.ФизическиеЛица.СоздатьЭлемент();
		Объект = Сообщение.object;
		УстановитьСсылкуНовогоДляСправочника(ФизЛицо, Объект);
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Если Не ЗаписатьДанныеФизическогоЛица(Узел, ФизЛицо, Объект, Ошибка) Тогда 
			Возврат Ошибка;
		КонецЕсли;
		
		Если Объект.Установлено("externalObject") Тогда 
			ОбработкаЗапросовXDTO.ДобавитьСвязьОбъектаДОИВнешнегоОбъекта(Узел, Объект.externalObject.id, Объект.externalObject.type, ФизЛицо.Ссылка);
		КонецЕсли;	
		
		
		ОбъектИд = ОбработкаЗапросовXDTO.ПолучитьObjectIDПоСсылке(ФизЛицо.Ссылка);
		Возврат ПолучитьФизическоеЛицо(ОбъектИд);
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при создании физического лица'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;
	
КонецФункции

// Изменяет и записывает физическое лицо по объекту XDTO
// 
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   Объект - ОбъектXDTO типа DMPrivatePerson 
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMPrivatePerson, заново заполненный, или DMError
//
Функция ИзменитьФизическоеЛицо(Узел, Объект) Экспорт 
	
	Попытка 
		
		Ссылка = ОбработкаЗапросовXDTO.ПолучитьСсылкуПоObjectID(Объект.objectId);
		ФизЛицо = Ссылка.ПолучитьОбъект();
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Если Не ЗаписатьДанныеФизическогоЛица(Узел, ФизЛицо, Объект, Ошибка) Тогда 
			Возврат Ошибка;
		КонецЕсли;
		
		ОбъектИд = ОбработкаЗапросовXDTO.ПолучитьObjectIDПоСсылке(ФизЛицо.Ссылка);
		Возврат ПолучитьФизическоеЛицо(ОбъектИд);
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при изменении физического лица'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;	
	
КонецФункции

// Заполняет и записывает объект Документооборота по данным объекта XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   ФизЛицо - СправочникОбъект.ФизическиеЛица - записываемый объект
//   ОбъектXDTO - ОбъектXDTO типа DMPrivatePerson - источник данных
//   Ошибка - ОбъектXDTO типа DMError - неявно возвращаемое значение ошибки
//
// Возвращаемое значение:
//   Булево - Истина, если операция завершена успешно, и Ложь в противном случае
//
Функция ЗаписатьДанныеФизическогоЛица(Узел, ФизЛицо, ОбъектXDTO, Ошибка) 
	
	ФизЛицо.Заблокировать();
	ЗаполнитьДанныеФизическогоЛица(Узел, ФизЛицо, ОбъектXDTO);
	
	// проверка заполнения
	ТекстСообщения = "";
	Если Не ОбработкаЗапросовXDTO.ПроверитьЗаполнение(ФизЛицо, ТекстСообщения) Тогда 
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при записи физического лица'");
		Ошибка.description = ТекстСообщения;
		Возврат Ложь;
	КонецЕсли;
	ФизЛицо.Записать();
	
	Возврат Истина;
	
КонецФункции	

// Заполняет объект Документооборота по данным объекта XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   ФизЛицо - СправочникОбъект.ФизическиеЛица - заполняемый объект
//   ОбъектXDTO - ОбъектXDTO типа DMPrivatePerson - источник данных заполнения
//
Процедура ЗаполнитьДанныеФизическогоЛица(Узел, ФизЛицо, ОбъектXDTO) Экспорт 
	
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ФизЛицо.Наименование, ОбъектXDTO, "name");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ФизЛицо.ДатаРождения, ОбъектXDTO, "birthDay");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ФизЛицо.Комментарий,  ОбъектXDTO, "comment");
	
КонецПроцедуры

// Находит подходящее или создает новое физическое лицо по объекту XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   ОбъектXDTO - ОбъектXDTO типа DMOrganization
//
// Возвращаемое значение:
//   СправочникСсылка.ФизическиеЛица - найденное или созданное физическое лицо
//
Функция НайтиСоздатьФизическоеЛицо(Узел, ОбъектXDTO) Экспорт
	
	ВнешнийID = ОбъектXDTO.externalObject.id;
	ВнешнийТип = ОбъектXDTO.externalObject.type;
	СсылкаДО = Неопределено;
	
	// синхронизация по наименованию
	Если Не ЗначениеЗаполнено(ВнешнийID) Тогда 
		
		Наименование = Неопределено;
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Наименование, ОбъектXDTO, "name");
		СсылкаДО = Справочники.ФизическиеЛица.НайтиПоНаименованию(Наименование, Истина); 
		Если Не ЗначениеЗаполнено(СсылкаДО) Тогда 
			ОбъектДО = Справочники.ФизическиеЛица.СоздатьЭлемент();
			ОбъектДО.Наименование = Наименование;
			ОбъектДО.Записать();
			СсылкаДО = ОбъектДО.Ссылка;
		КонецЕсли;
		
		Возврат СсылкаДО;
	КонецЕсли;
	
	СсылкаДО = СправочникСсылкаПоИдентификаторуВнешнегоОбъекта(Узел, ОбъектXDTO, "ФизическиеЛица");
	Если СсылкаДО <> Неопределено Тогда
		ОбъектДО = СсылкаДО.ПолучитьОбъект();
		ОбъектДО.Заблокировать();
		ЗаполнитьДанныеФизическогоЛица(Узел, ОбъектДО, ОбъектXDTO);
		Если ОбъектДО.Модифицированность() Тогда
			ОбъектДО.Записать();
		КонецЕсли;
		Возврат СсылкаДО;
	КонецЕсли;
		
	// переопределяемый поиск
	СсылкаДО = ОбработкаЗапросовXDTOПереопределяемый.НайтиСоответствиеДляВнешнегоОбъекта(ОбъектXDTO);
	
	// стандартный поиск
	Если Не ЗначениеЗаполнено(СсылкаДО) Тогда 
		
		Наименование = "";
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Наименование, ОбъектXDTO, "name");
		СсылкаДО = Справочники.ФизическиеЛица.НайтиПоНаименованию(Наименование, Истина);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СсылкаДО) Тогда 
		ОбъектДО = СсылкаДО.ПолучитьОбъект();
	Иначе	
		ОбъектДО = Справочники.ФизическиеЛица.СоздатьЭлемент();
		УстановитьСсылкуНовогоДляСправочника(ОбъектДО, ОбъектXDTO);
	КонецЕсли;	
	ОбъектДО.Заблокировать();
	ЗаполнитьДанныеФизическогоЛица(Узел, ОбъектДО, ОбъектXDTO);
	Если ОбъектДО.Модифицированность() Тогда
		ОбъектДО.Записать();
	КонецЕсли;
	
	Возврат ОбъектДО.Ссылка;
	
КонецФункции	

#КонецОбласти

#Область КонтактноеЛицо

// Получает заполненный объект XDTO, соответствующий контактному лицу
// 
// Параметры:
//   ОбъектИд - ОбъектXDTO типа ObjectId, описывающий существующее контактное лицо
//   НаборКолонок - Массив - массив имен реквизитов к получению
//                - Неопределено - требование получить все реквизиты
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMContactPerson или DMError
//
Функция ПолучитьКонтактноеЛицо(ОбъектИд, НаборКолонок = Неопределено) Экспорт 
	
	Попытка 
		
		Ссылка = ОбработкаЗапросовXDTO.ПолучитьСсылкуПоObjectID(ОбъектИд);
		КонтактноеЛицо = Ссылка.ПолучитьОбъект();
		
		Объект = ОбработкаЗапросовXDTO.СоздатьОбъект("DMContactPerson");
		ПолучитьДанныеКонтактногоЛица(КонтактноеЛицо, Объект, НаборКолонок);
		
		Возврат Объект;
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при получении контактного лица'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;
	
КонецФункции

// Создает новое контактное лицо по объекту XDTO
// 
// Параметры:
//   Сообщение - ОбъектXDTO типа DMCreateRequest
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMContactPerson или DMError
//
Функция СоздатьКонтактноеЛицо(Сообщение) Экспорт 
	
	Попытка 
		
		Узел = ОбработкаЗапросовXDTO.УзелИнтегрированнойСистемы(Сообщение);
		КонтактноеЛицо = Справочники.КонтактныеЛица.СоздатьЭлемент();
		Объект = Сообщение.object;
		УстановитьСсылкуНовогоДляСправочника(КонтактноеЛицо, Объект);
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Если Не ЗаписатьДанныеКонтактногоЛица(Узел, КонтактноеЛицо, Объект, Ошибка) Тогда 
			Возврат Ошибка;
		КонецЕсли;
		
		Если Объект.Установлено("externalObject") Тогда 
			ОбработкаЗапросовXDTO.ДобавитьСвязьОбъектаДОИВнешнегоОбъекта(Узел, Объект.externalObject.id, Объект.externalObject.type, КонтактноеЛицо.Ссылка);
		КонецЕсли;	
		
		
		ОбъектИд = ОбработкаЗапросовXDTO.ПолучитьObjectIDПоСсылке(КонтактноеЛицо.Ссылка);
		Возврат ПолучитьКонтактноеЛицо(ОбъектИд);
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при создании контактного лица'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;
	
КонецФункции

// Изменяет и записывает контактное лицо по объекту XDTO
// 
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   Объект - ОбъектXDTO типа DMContactPerson 
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMContactPerson, заново заполненный, или DMError
//
Функция ИзменитьКонтактноеЛицо(Узел, Объект) Экспорт 
	
	Попытка 
		
		Ссылка = ОбработкаЗапросовXDTO.ПолучитьСсылкуПоObjectID(Объект.objectId);
		КонтактноеЛицо = Ссылка.ПолучитьОбъект();
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Если Не ЗаписатьДанныеКонтактногоЛица(Узел, КонтактноеЛицо, Объект, Ошибка) Тогда 
			Возврат Ошибка;
		КонецЕсли;
		
		ОбъектИд = ОбработкаЗапросовXDTO.ПолучитьObjectIDПоСсылке(КонтактноеЛицо.Ссылка);
		Возврат ПолучитьКонтактноеЛицо(ОбъектИд);
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при изменении контактного лица'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;	
	
КонецФункции

// Получает объект XDTO для нового контактного лица
// 
// Параметры:
//   НаборКолонок - Массив - массив имен реквизитов к заполнению
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMContactPerson или DMError
//
Функция ПолучитьНовоеКонтактноеЛицо(НаборКолонок) Экспорт 
	
	Попытка
		
		КонтактноеЛицо = Справочники.КонтактныеЛица.СоздатьЭлемент();
		КонтактноеЛицо.Заполнить(Неопределено);
	
		Объект = ОбработкаЗапросовXDTO.СоздатьОбъект("DMContactPerson");
		ПолучитьДанныеКонтактногоЛица(КонтактноеЛицо, Объект, НаборКолонок);
		
		Возврат Объект;
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при получении нового контактного лица'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;
	
КонецФункции

// Заполняет объект XDTO по данным объекта Документооборота
//
// Параметры:
//   КонтактноеЛицо - СправочникОбъект.КонтактныеЛица
//   ОбъектXDTO - ОбъектXDTO типа DMContactPerson
//   НаборКолонок - Массив - массив имен реквизитов к заполнению
//                - Неопределено - требование заполнить все реквизиты
//
Процедура ПолучитьДанныеКонтактногоЛица(КонтактноеЛицо, ОбъектXDTO, НаборКолонок = Неопределено) 
	
	ДанныеКонтактногоЛица = Новый Структура;
	ДанныеКонтактногоЛица.Вставить("correspondent", КонтактноеЛицо.Владелец);
	ДанныеКонтактногоЛица.Вставить("position", 		КонтактноеЛицо.Должность);
	ДанныеКонтактногоЛица.Вставить("comment",  		КонтактноеЛицо.Комментарий);
	ДанныеКонтактногоЛица.Вставить("privatePerson", КонтактноеЛицо.ФизЛицо);
	
	// набор колонок
	Колонки = Новый Массив;
	Если НаборКолонок <> Неопределено Тогда 
		Для Каждого Элемент Из НаборКолонок Цикл
			Колонки.Добавить(НРег(Элемент));
		КонецЦикла;	
	КонецЕсли;
	
	Для Каждого Реквизит Из ДанныеКонтактногоЛица Цикл
		Если Колонки.Количество() = 0 Или Колонки.Найти(НРег(Реквизит.Ключ)) <> Неопределено Тогда 
			ОбработкаЗапросовXDTO.ЗаполнитьСвойствоXDTOИзРеквизита(ОбъектXDTO, Реквизит.Ключ, Реквизит.Значение);
		КонецЕсли;	
	КонецЦикла;
	
	// контактная информация
	Если НаборКолонок = Неопределено Или Колонки.Найти(НРег("contactInformation")) <> Неопределено Тогда 
		ПолучитьКонтактнуюИнформациюОбъектаДО(КонтактноеЛицо, ОбъектXDTO);
	КонецЕсли;	
	
	ОбъектXDTO.objectId = ОбработкаЗапросовXDTO.ПолучитьObjectIDПоСсылке(КонтактноеЛицо.Ссылка);
	ОбъектXDTO.name = КонтактноеЛицо.Наименование;
	
КонецПроцедуры	

// Заполняет и записывает объект Документооборота по данным объекта XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   КонтактноеЛицо - СправочникОбъект.КонтактныеЛица - записываемый объект
//   ОбъектXDTO - ОбъектXDTO типа DMContactPerson - источник данных
//   Ошибка - ОбъектXDTO типа DMError - неявно возвращаемое значение ошибки
//
// Возвращаемое значение:
//   Булево - Истина, если операция завершена успешно, и Ложь в противном случае
//
Функция ЗаписатьДанныеКонтактногоЛица(Узел, КонтактноеЛицо, ОбъектXDTO, Ошибка) 
	
	КонтактноеЛицо.Заблокировать();
	ЗаполнитьДанныеКонтактногоЛица(Узел, КонтактноеЛицо, ОбъектXDTO);
	
	// проверка заполнения
	ТекстСообщения = "";
	Если Не ОбработкаЗапросовXDTO.ПроверитьЗаполнение(КонтактноеЛицо, ТекстСообщения) Тогда 
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при записи контактного лица'");
		Ошибка.description = ТекстСообщения;
		Возврат Ложь;
	КонецЕсли;
	
	КонтактноеЛицо.Записать();
	
	Возврат Истина;
	
КонецФункции	

// Заполняет объект Документооборота по данным объекта XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   КонтактноеЛицо - СправочникОбъект.КонтактныеЛица - заполняемый объект
//   ОбъектXDTO - ОбъектXDTO типа DMContactPerson - источник данных заполнения
//
Процедура ЗаполнитьДанныеКонтактногоЛица(Узел, КонтактноеЛицо, ОбъектXDTO) Экспорт 
	
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, КонтактноеЛицо.Наименование,  	ОбъектXDTO, "name");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, КонтактноеЛицо.Владелец, 		ОбъектXDTO, "correspondent");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, КонтактноеЛицо.Должность, 		ОбъектXDTO, "position");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, КонтактноеЛицо.Комментарий, 	ОбъектXDTO, "comment");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, КонтактноеЛицо.ФизЛицо, 		ОбъектXDTO, "privatePerson");
	
	ЗаполнитьКонтактнуюИнформациюОбъектаДО(КонтактноеЛицо, ОбъектXDTO);
	
КонецПроцедуры

// Находит подходящее или создает новое контактное лицо по объекту XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   ОбъектXDTO - ОбъектXDTO типа DMContactPerson
//
// Возвращаемое значение:
//   СправочникСсылка.КонтактныеЛица - найденное или созданное контактное лицо
//
Функция НайтиСоздатьКонтактноеЛицо(Узел, ОбъектXDTO) Экспорт
	
	ВнешнийID = ОбъектXDTO.externalObject.id;
	ВнешнийТип = ОбъектXDTO.externalObject.type;
	СсылкаДО = Неопределено;
	
	// синхронизация по наименованию
	Если Не ЗначениеЗаполнено(ВнешнийID) Тогда 
		
		Наименование = Неопределено;
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Наименование, ОбъектXDTO, "name");
		СсылкаДО = Справочники.КонтактныеЛица.НайтиПоНаименованию(Наименование, Истина); 
		Если Не ЗначениеЗаполнено(СсылкаДО) Тогда 
			ОбъектДО = Справочники.КонтактныеЛица.СоздатьЭлемент();
			ОбъектДО.Наименование = Наименование;
			ОбъектДО.Записать();
			СсылкаДО = ОбъектДО.Ссылка;
		КонецЕсли;	
		
		Возврат СсылкаДО;
	КонецЕсли;
	
	СсылкаДО = СправочникСсылкаПоИдентификаторуВнешнегоОбъекта(Узел, ОбъектXDTO, "КонтактныеЛица");
	Если СсылкаДО <> Неопределено Тогда
		ОбъектДО = СсылкаДО.ПолучитьОбъект();
		ОбъектДО.Заблокировать();
		ЗаполнитьДанныеКонтактногоЛица(Узел, ОбъектДО, ОбъектXDTO);
		Если ОбъектДО.Модифицированность() Тогда
			ОбъектДО.Записать();
		КонецЕсли;
		Возврат СсылкаДО;
	КонецЕсли;
	
	// переопределяемый поиск
	СсылкаДО = ОбработкаЗапросовXDTOПереопределяемый.НайтиСоответствиеДляВнешнегоОбъекта(ОбъектXDTO);
	
	// стандартный поиск
	Если Не ЗначениеЗаполнено(СсылкаДО) Тогда 
		
		Наименование = "";
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Наименование, ОбъектXDTO, "name");
		СсылкаДО = Справочники.КонтактныеЛица.НайтиПоНаименованию(Наименование, Истина);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СсылкаДО) Тогда 
		ОбъектДО = СсылкаДО.ПолучитьОбъект();
	Иначе	
		ОбъектДО = Справочники.КонтактныеЛица.СоздатьЭлемент();
		УстановитьСсылкуНовогоДляСправочника(ОбъектДО, ОбъектXDTO);
	КонецЕсли;	
	ОбъектДО.Заблокировать();
	ЗаполнитьДанныеКонтактногоЛица(Узел, ОбъектДО, ОбъектXDTO);
	Если ОбъектДО.Модифицированность() Тогда
		ОбъектДО.Записать();
	КонецЕсли;
	
	Возврат ОбъектДО.Ссылка;
	
КонецФункции

#КонецОбласти

#Область Пользователь

// Получает заполненный объект XDTO, соответствующий пользователю
// 
// Параметры:
//   ОбъектИд - ОбъектXDTO типа ObjectId, описывающий существующего пользователя
//   НаборКолонок - Массив - массив имен реквизитов к получению
//                - Неопределено - требование получить все реквизиты
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMUser или DMError
//
Функция ПолучитьПользователя(ОбъектИд, НаборКолонок = Неопределено) Экспорт 
	
	Попытка 
		
		Ссылка = ОбработкаЗапросовXDTO.ПолучитьСсылкуПоObjectID(ОбъектИд);
		Пользователь = Ссылка.ПолучитьОбъект();
		
		Объект = ОбработкаЗапросовXDTO.СоздатьОбъект("DMUser");
		ПолучитьДанныеПользователя(Пользователь, Объект, НаборКолонок);
		
		Возврат Объект;
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при получении пользователя'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;
	
КонецФункции

// Заполняет объект XDTO по данным объекта Документооборота
//
// Параметры:
//   Пользователь - СправочникОбъект.Пользователи
//   ОбъектXDTO - ОбъектXDTO типа DMUser
//   НаборКолонок - Массив - массив имен реквизитов к заполнению
//                - Неопределено - требование заполнить все реквизиты
//
Процедура ПолучитьДанныеПользователя(Пользователь, ОбъектXDTO, НаборКолонок = Неопределено) 
	
	ДанныеПользователя = Новый Структура;
	ДанныеПользователя.Вставить("privatePerson", Пользователь.ФизЛицо);
	
	// набор колонок
	Колонки = Новый Массив;
	Если НаборКолонок <> Неопределено Тогда 
		Для Каждого Элемент Из НаборКолонок Цикл
			Колонки.Добавить(НРег(Элемент));
		КонецЦикла;	
	КонецЕсли;
	
	Для Каждого Реквизит Из ДанныеПользователя Цикл
		Если Колонки.Количество() = 0 Или Колонки.Найти(НРег(Реквизит.Ключ)) <> Неопределено Тогда 
			ОбработкаЗапросовXDTO.ЗаполнитьСвойствоXDTOИзРеквизита(ОбъектXDTO, Реквизит.Ключ, Реквизит.Значение);
		КонецЕсли;	
	КонецЦикла;
	
	ОбъектXDTO.objectId = ОбработкаЗапросовXDTO.ПолучитьObjectIDПоСсылке(Пользователь.Ссылка);
	ОбъектXDTO.name = Пользователь.Наименование;
	
КонецПроцедуры	

// Создает нового пользователя по объекту XDTO
// 
// Параметры:
//   Сообщение - ОбъектXDTO типа DMCreateRequest
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMUser или DMError
//
Функция СоздатьПользователя(Сообщение) Экспорт 
	
	Попытка 
		
		Узел = ОбработкаЗапросовXDTO.УзелИнтегрированнойСистемы(Сообщение);
		Пользователь = Справочники.Пользователи.СоздатьЭлемент();
		Объект = Сообщение.object;
		УстановитьСсылкуНовогоДляСправочника(Пользователь, Объект);
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Если Не ЗаписатьДанныеПользователя(Узел, Пользователь, Объект, Ошибка) Тогда 
			Возврат Ошибка;
		КонецЕсли;
		
		ПользователиСлужебный.ОбновитьСоставыГруппПользователей(Справочники.ГруппыПользователей.ВсеПользователи);
		
		Если Объект.Установлено("externalObject") Тогда 
			ОбработкаЗапросовXDTO.ДобавитьСвязьОбъектаДОИВнешнегоОбъекта(Узел, Объект.externalObject.id, Объект.externalObject.type, Пользователь.Ссылка);
		КонецЕсли;	
		
		ОбъектИд = ОбработкаЗапросовXDTO.ПолучитьObjectIDПоСсылке(Пользователь.Ссылка);
		Возврат ПолучитьПользователя(ОбъектИд);
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при создании пользователя'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;
	
КонецФункции

// Изменяет и записывает пользователя по объекту XDTO
// 
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   Объект - ОбъектXDTO типа DMUser
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMUser, заново заполненный, или DMError
//
Функция ИзменитьПользователя(Узел, Объект) Экспорт 
	
	Попытка 
		
		Ссылка = ОбработкаЗапросовXDTO.ПолучитьСсылкуПоObjectID(Объект.objectId);
		Пользователь = Ссылка.ПолучитьОбъект();
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Если Не ЗаписатьДанныеПользователя(Узел, Пользователь, Объект, Ошибка) Тогда 
			Возврат Ошибка;
		КонецЕсли;
		
		ОбъектИд = ОбработкаЗапросовXDTO.ПолучитьObjectIDПоСсылке(Пользователь.Ссылка);
		Возврат ПолучитьПользователя(ОбъектИд);
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при изменении пользователя'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;	
	
КонецФункции

// Заполняет и записывает объект Документооборота по данным объекта XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   Пользователь - СправочникОбъект.Пользователи - записываемый объект
//   ОбъектXDTO - ОбъектXDTO типа DMUser - источник данных
//   Ошибка - ОбъектXDTO типа DMError - неявно возвращаемое значение ошибки
//
// Возвращаемое значение:
//   Булево - Истина, если операция завершена успешно, и Ложь в противном случае
//
Функция ЗаписатьДанныеПользователя(Узел, Пользователь, ОбъектXDTO, Ошибка) 
	
	Пользователь.Заблокировать();
	ЗаполнитьДанныеПользователя(Узел, Пользователь, ОбъектXDTO);
	
	// проверка заполнения
	ТекстСообщения = "";
	Если Не ОбработкаЗапросовXDTO.ПроверитьЗаполнение(Пользователь, ТекстСообщения) Тогда 
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при записи пользователя'");
		Ошибка.description = ТекстСообщения;
		Возврат Ложь;
	КонецЕсли;
	
	Пользователь.Записать();
	
	СвязатьПользователяСПодразделением(Узел, Пользователь, ОбъектXDTO);
	
	Возврат Истина;
	
КонецФункции

// Заполняет объект Документооборота по данным объекта XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   Пользователь - СправочникОбъект.Пользователи - заполняемый объект
//   ОбъектXDTO - ОбъектXDTO типа DMUser - источник данных заполнения
//
Процедура ЗаполнитьДанныеПользователя(Узел, Пользователь, ОбъектXDTO) Экспорт 
	
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Пользователь.Наименование,  ОбъектXDTO, "name");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Пользователь.ФизЛицо, 	  ОбъектXDTO, "privatePerson");
	
КонецПроцедуры

// Находит подходящего или создает нового пользователя по объекту XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   ОбъектXDTO - ОбъектXDTO типа DMUser
//
// Возвращаемое значение:
//   СправочникСсылка.Пользователи - найденный или созданный пользователь
//
Функция НайтиСоздатьПользователя(Узел, ОбъектXDTO) Экспорт
	
	ВнешнийID = ОбъектXDTO.externalObject.id;
	ВнешнийТип = ОбъектXDTO.externalObject.type;
	СсылкаДО = Неопределено;
	
	// синхронизация по наименованию
	Если Не ЗначениеЗаполнено(ВнешнийID) Тогда 
		
		Наименование = Неопределено;
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Наименование, ОбъектXDTO, "name");
		СсылкаДО = Справочники.Пользователи.НайтиПоНаименованию(Наименование, Истина); 
		Если Не ЗначениеЗаполнено(СсылкаДО) Тогда 
			ОбъектДО = Справочники.Пользователи.СоздатьЭлемент();
			ОбъектДО.Наименование = Наименование;
			ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(ОбъектДО.ФизЛицо, ОбъектXDTO, "privatePerson");
			ОбъектДО.Записать();
			СвязатьПользователяСПодразделением(Узел, ОбъектДО, ОбъектXDTO);
			СсылкаДО = ОбъектДО.Ссылка;
		КонецЕсли;	
		
		Возврат СсылкаДО;
	КонецЕсли;	
	
	СсылкаДО = СправочникСсылкаПоИдентификаторуВнешнегоОбъекта(Узел, ОбъектXDTO, "Пользователи");
	Если СсылкаДО <> Неопределено Тогда
		ОбъектДО = СсылкаДО.ПолучитьОбъект();
		ОбъектДО.Заблокировать();
		ЗаполнитьДанныеПользователя(Узел, ОбъектДО, ОбъектXDTO);
		Если ОбъектДО.Модифицированность() Тогда
			ОбъектДО.Записать();
		КонецЕсли;
		Возврат СсылкаДО;
	КонецЕсли;
		
	// переопределяемый поиск
	СсылкаДО = ОбработкаЗапросовXDTOПереопределяемый.НайтиСоответствиеДляВнешнегоОбъекта(ОбъектXDTO);
	
	// стандартный поиск
	Если Не ЗначениеЗаполнено(СсылкаДО) Тогда 
		
		Наименование = "";
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Наименование, ОбъектXDTO, "name");
		СсылкаДО = Справочники.Пользователи.НайтиПоНаименованию(Наименование, Истина);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СсылкаДО) Тогда 
		ОбъектДО = СсылкаДО.ПолучитьОбъект();
	Иначе	
		ОбъектДО = Справочники.Пользователи.СоздатьЭлемент();
		УстановитьСсылкуНовогоДляСправочника(ОбъектДО, ОбъектXDTO);
	КонецЕсли;	
	ОбъектДО.Заблокировать();
	ЗаполнитьДанныеПользователя(Узел, ОбъектДО, ОбъектXDTO);
	Если ОбъектДО.Модифицированность() Тогда
		ОбъектДО.Записать();
	КонецЕсли;
	
	СвязатьПользователяСПодразделением(Узел, ОбъектДО, ОбъектXDTO);
	
	Возврат ОбъектДО.Ссылка;
	
КонецФункции	

// Связывает пользователя с подразделением, указанным в свойствах объекта XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы
//   ОбъектДО - СправочникСсылка.Пользователи, СправочникОбъект.Пользователи
//   ОбъектXDTO - ОбъектXDTO типа DMUser
//
Процедура СвязатьПользователяСПодразделением(Узел, ОбъектДО, ОбъектXDTO)
	
	Подразделение = Неопределено;
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Подразделение, ОбъектXDTO, "subdivision");
	Если ЗначениеЗаполнено(Подразделение) Тогда 
		МенеджерЗаписи = РегистрыСведений.СведенияОПользователях.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Пользователь = ОбъектДО.Ссылка;

		МенеджерЗаписи.Подразделение = Подразделение;
		МенеджерЗаписи.Записать();
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область Валюта

// Получает заполненный объект XDTO, соответствующий валюте
// 
// Параметры:
//   ОбъектИд - ОбъектXDTO типа ObjectId, описывающий существующую валюту
//   НаборКолонок - Массив - массив имен реквизитов к получению
//                - Неопределено - требование получить все реквизиты
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMCurrency или DMError
//
Функция ПолучитьВалюту(ОбъектИд, НаборКолонок = Неопределено) Экспорт 
	
	Попытка 
		
		Ссылка = ОбработкаЗапросовXDTO.ПолучитьСсылкуПоObjectID(ОбъектИд);
		Валюта = Ссылка.ПолучитьОбъект();
		
		Объект = ОбработкаЗапросовXDTO.СоздатьОбъект("DMCurrency");
		ПолучитьДанныеВалюты(Валюта, Объект, НаборКолонок);
		
		Возврат Объект;
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при получении валюты'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;
	
КонецФункции

// Заполняет объект XDTO по данным объекта Документооборота
//
// Параметры:
//   Валюта - СправочникОбъект.Валюты
//   ОбъектXDTO - ОбъектXDTO типа DMCurrency
//   НаборКолонок - Массив - массив имен реквизитов к заполнению
//                - Неопределено - требование заполнить все реквизиты
//
Процедура ПолучитьДанныеВалюты(Валюта, ОбъектXDTO, НаборКолонок = Неопределено) 
	
	ДанныеВалюты = Новый Структура;
	ДанныеВалюты.Вставить("code", 	  Валюта.Код);
	ДанныеВалюты.Вставить("fullName", Валюта.НаименованиеПолное);
	
	// набор колонок
	Колонки = Новый Массив;
	Если НаборКолонок <> Неопределено Тогда 
		Для Каждого Элемент Из НаборКолонок Цикл
			Колонки.Добавить(НРег(Элемент));
		КонецЦикла;	
	КонецЕсли;
	
	Для Каждого Реквизит Из ДанныеВалюты Цикл
		Если Колонки.Количество() = 0 Или Колонки.Найти(НРег(Реквизит.Ключ)) <> Неопределено Тогда 
			ОбработкаЗапросовXDTO.ЗаполнитьСвойствоXDTOИзРеквизита(ОбъектXDTO, Реквизит.Ключ, Реквизит.Значение);
		КонецЕсли;	
	КонецЦикла;
	
	ОбъектXDTO.objectId = ОбработкаЗапросовXDTO.ПолучитьObjectIDПоСсылке(Валюта.Ссылка);
	ОбъектXDTO.name = Валюта.Наименование;
	
КонецПроцедуры	

// Создает новую валюту по объекту XDTO
// 
// Параметры:
//   Сообщение - ОбъектXDTO типа DMCreateRequest
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMCurrency или DMError
//
Функция СоздатьВалюту(Сообщение) Экспорт 
	
	Попытка 
		
		Узел = ОбработкаЗапросовXDTO.УзелИнтегрированнойСистемы(Сообщение);
		Валюта = Справочники.Валюты.СоздатьЭлемент();
		Объект = Сообщение.object;
		УстановитьСсылкуНовогоДляСправочника(Валюта, Объект);
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Если Не ЗаписатьДанныеВалюты(Узел, Валюта, Объект, Ошибка) Тогда 
			Возврат Ошибка;
		КонецЕсли;
		
		Если Объект.Установлено("externalObject") Тогда 
			ОбработкаЗапросовXDTO.ДобавитьСвязьОбъектаДОИВнешнегоОбъекта(Узел, Объект.externalObject.id, Объект.externalObject.type, Валюта.Ссылка);
		КонецЕсли;	
		
		
		ОбъектИд = ОбработкаЗапросовXDTO.ПолучитьObjectIDПоСсылке(Валюта.Ссылка);
		Возврат ПолучитьВалюту(ОбъектИд);
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при создании валюты'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;
	
КонецФункции

// Изменяет и записывает валюту по объекту XDTO
// 
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   Объект - ОбъектXDTO типа DMCurrency
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMCurrency, заново заполненный, или DMError
//
Функция ИзменитьВалюту(Узел, Объект) Экспорт 
	
	Попытка 
		
		Ссылка = ОбработкаЗапросовXDTO.ПолучитьСсылкуПоObjectID(Объект.objectId);
		Валюта = Ссылка.ПолучитьОбъект();
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Если Не ЗаписатьДанныеВалюты(Узел, Валюта, Объект, Ошибка) Тогда 
			Возврат Ошибка;
		КонецЕсли;
		
		ОбъектИд = ОбработкаЗапросовXDTO.ПолучитьObjectIDПоСсылке(Валюта.Ссылка);
		Возврат ПолучитьВалюту(ОбъектИд);
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при изменении валюты'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;	
	
КонецФункции

// Заполняет и записывает объект Документооборота по данным объекта XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   Валюта - СправочникОбъект.Валюты - записываемый объект
//   ОбъектXDTO - ОбъектXDTO типа DMCurrency - источник данных
//   Ошибка - ОбъектXDTO типа DMError - неявно возвращаемое значение ошибки
//
// Возвращаемое значение:
//   Булево - Истина, если операция завершена успешно, и Ложь в противном случае
//
Функция ЗаписатьДанныеВалюты(Узел, Валюта, ОбъектXDTO, Ошибка) 
	
	Валюта.Заблокировать();
	ЗаполнитьДанныеВалюты(Узел, Валюта, ОбъектXDTO);
	
	// проверка заполнения
	ТекстСообщения = "";
	Если Не ОбработкаЗапросовXDTO.ПроверитьЗаполнение(Валюта, ТекстСообщения) Тогда 
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при записи валюты'");
		Ошибка.description = ТекстСообщения;
		Возврат Ложь;
	КонецЕсли;
	Валюта.Записать();
	
	Возврат Истина;
	
КонецФункции	

// Заполняет объект Документооборота по данным объекта XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   Валюта - СправочникОбъект.Валюты - заполняемый объект
//   ОбъектXDTO - ОбъектXDTO типа DMCurrency - источник данных заполнения
//
Процедура ЗаполнитьДанныеВалюты(Узел, Валюта, ОбъектXDTO) Экспорт 
	
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Валюта.Код,  			  ОбъектXDTO, "code");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Валюта.Наименование,  	  ОбъектXDTO, "name");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Валюта.НаименованиеПолное,ОбъектXDTO, "fullName");
	
КонецПроцедуры	

// Находит подходящую или создает новую валюту по объекту XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   ОбъектXDTO - ОбъектXDTO типа DMCurrency
//
// Возвращаемое значение:
//   СправочникСсылка.Валюты - найденная или созданная валюта
//
Функция НайтиСоздатьВалюту(Узел, ОбъектXDTO) Экспорт
	
	ВнешнийID = ОбъектXDTO.externalObject.id;
	ВнешнийТип = ОбъектXDTO.externalObject.type;
	
	// синхронизация по наименованию
	Если Не ЗначениеЗаполнено(ВнешнийID) Тогда 
		
		Наименование = Неопределено;
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Наименование, ОбъектXDTO, "name");
		СсылкаДО = Справочники.Валюты.НайтиПоНаименованию(Наименование, Истина); 
		Если Не ЗначениеЗаполнено(СсылкаДО) Тогда 
			ОбъектДО = Справочники.Валюты.СоздатьЭлемент();
			ОбъектДО.Наименование = Наименование;
			ОбъектДО.Записать();
			СсылкаДО = ОбъектДО.Ссылка;
		КонецЕсли;	
		
		Возврат СсылкаДО;
	КонецЕсли;	
	
	СсылкаДО = СправочникСсылкаПоИдентификаторуВнешнегоОбъекта(Узел, ОбъектXDTO, "Валюты");
	Если СсылкаДО <> Неопределено Тогда
		ОбъектДО = СсылкаДО.ПолучитьОбъект();
		ОбъектДО.Заблокировать();
		ЗаполнитьДанныеВалюты(Узел, ОбъектДО, ОбъектXDTO);
		Если ОбъектДО.Модифицированность() Тогда
			ОбъектДО.Записать();
		КонецЕсли;
		Возврат СсылкаДО;
	КонецЕсли;
	
	// переопределяемый поиск
	СсылкаДО = ОбработкаЗапросовXDTOПереопределяемый.НайтиСоответствиеДляВнешнегоОбъекта(ОбъектXDTO);
	
	// стандартный поиск
	Если Не ЗначениеЗаполнено(СсылкаДО) Тогда 
		
		Наименование = "";
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Наименование, ОбъектXDTO, "name");
		СсылкаДО = Справочники.Валюты.НайтиПоНаименованию(Наименование, Истина);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СсылкаДО) Тогда 
		ОбъектДО = СсылкаДО.ПолучитьОбъект();
	Иначе	
		ОбъектДО = Справочники.Валюты.СоздатьЭлемент();
		УстановитьСсылкуНовогоДляСправочника(ОбъектДО, ОбъектXDTO);
	КонецЕсли;	
	ОбъектДО.Заблокировать();
	ЗаполнитьДанныеВалюты(Узел, ОбъектДО, ОбъектXDTO);
	Если ОбъектДО.Модифицированность() Тогда
		ОбъектДО.Записать();
	КонецЕсли;
	
	Возврат ОбъектДО.Ссылка;
	
КонецФункции	

#КонецОбласти

#Область Подразделение

// Получает заполненный объект XDTO, соответствующий подразделению 
// 
// Параметры:
//   ОбъектИд - ОбъектXDTO типа ObjectId, описывающий существующее подразделение
//   НаборКолонок - Массив - массив имен реквизитов к получению
//                - Неопределено - требование получить все реквизиты
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMSubdivision или DMError
//
Функция ПолучитьПодразделение(ОбъектИд, НаборКолонок = Неопределено) Экспорт 
	
	Попытка 
		
		Ссылка = ОбработкаЗапросовXDTO.ПолучитьСсылкуПоObjectID(ОбъектИд);
		Подразделение = Ссылка.ПолучитьОбъект();
		
		Объект = ОбработкаЗапросовXDTO.СоздатьОбъект("DMSubdivision");
		ПолучитьДанныеПодразделения(Подразделение, Объект, НаборКолонок);
		
		Возврат Объект;
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при получении подразделения'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;
	
КонецФункции

// Заполняет объект XDTO по данным объекта Документооборота
//
// Параметры:
//   Подразделение - СправочникОбъект.СтруктураПредприятия
//   ОбъектXDTO - ОбъектXDTO типа DMSubdivision
//   НаборКолонок - Массив - массив имен реквизитов к заполнению
//                - Неопределено - требование заполнить все реквизиты
//
Процедура ПолучитьДанныеПодразделения(Подразделение, ОбъектXDTO, НаборКолонок = Неопределено) Экспорт 
	
	ДанныеПодразделения = Новый Структура;
	ДанныеПодразделения.Вставить("head", Подразделение.Руководитель);
	
	// набор колонок
	Колонки = Новый Массив;
	Если НаборКолонок <> Неопределено Тогда 
		Для Каждого Элемент Из НаборКолонок Цикл
			Колонки.Добавить(НРег(Элемент));
		КонецЦикла;	
	КонецЕсли;
	
	Для Каждого Реквизит Из ДанныеПодразделения Цикл
		Если Колонки.Количество() = 0 Или Колонки.Найти(НРег(Реквизит.Ключ)) <> Неопределено Тогда 
			ОбработкаЗапросовXDTO.ЗаполнитьСвойствоXDTOИзРеквизита(ОбъектXDTO, Реквизит.Ключ, Реквизит.Значение);
		КонецЕсли;	
	КонецЦикла;
	
	ОбъектXDTO.objectId = ОбработкаЗапросовXDTO.ПолучитьObjectIDПоСсылке(Подразделение.Ссылка);
	ОбъектXDTO.name = Подразделение.Наименование;
	
КонецПроцедуры	

// Создает новое подразделение по объекту XDTO
// 
// Параметры:
//   Сообщение - ОбъектXDTO типа DMCreateRequest
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMSubdivision или DMError
//
Функция СоздатьПодразделение(Сообщение) Экспорт 
	
	Попытка 
		
		Узел = ОбработкаЗапросовXDTO.УзелИнтегрированнойСистемы(Сообщение);
		Подразделение = Справочники.СтруктураПредприятия.СоздатьЭлемент();
		Объект = Сообщение.object;
		УстановитьСсылкуНовогоДляСправочника(Подразделение, Объект);
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Если Не ЗаписатьДанныеПодразделения(Узел, Подразделение, Объект, Ошибка) Тогда 
			Возврат Ошибка;
		КонецЕсли;
		
		Если Объект.Установлено("externalObject") Тогда 
			ОбработкаЗапросовXDTO.ДобавитьСвязьОбъектаДОИВнешнегоОбъекта(Узел, Объект.externalObject.id, Объект.externalObject.type, Подразделение.Ссылка);
		КонецЕсли;	
		
		ОбъектИд = ОбработкаЗапросовXDTO.ПолучитьObjectIDПоСсылке(Подразделение.Ссылка);
		Возврат ПолучитьПодразделение(ОбъектИд);
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при создании подразделения'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;
	
КонецФункции

// Изменяет и записывает подразделение по объекту XDTO
// 
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   Объект - ОбъектXDTO типа DMSubdivision
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMSubdivision, заново заполненный, или DMError
//
Функция ИзменитьПодразделение(Узел, Объект) Экспорт 
	
	Попытка 
		
		Ссылка = ОбработкаЗапросовXDTO.ПолучитьСсылкуПоObjectID(Объект.objectId);
		Подразделение = Ссылка.ПолучитьОбъект();
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Если Не ЗаписатьДанныеПодразделения(Узел, Подразделение, Объект, Ошибка) Тогда 
			Возврат Ошибка;
		КонецЕсли;
		
		ОбъектИд = ОбработкаЗапросовXDTO.ПолучитьObjectIDПоСсылке(Подразделение.Ссылка);
		Возврат ПолучитьПодразделение(ОбъектИд);
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при изменении подразделения'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;	
	
КонецФункции

// Заполняет и записывает объект Документооборота по данным объекта XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   Подразделение - СправочникОбъект.Подразделения - записываемый объект
//   ОбъектXDTO - ОбъектXDTO типа DMSubdivision - источник данных
//   Ошибка - ОбъектXDTO типа DMError - неявно возвращаемое значение ошибки
//
// Возвращаемое значение:
//   Булево - Истина, если операция завершена успешно, и Ложь в противном случае
//
Функция ЗаписатьДанныеПодразделения(Узел, Подразделение, ОбъектXDTO, Ошибка) 
	
	Подразделение.Заблокировать();
	ЗаполнитьДанныеПодразделения(Узел, Подразделение, ОбъектXDTO);
	
	// проверка заполнения
	ТекстСообщения = "";
	Если Не ОбработкаЗапросовXDTO.ПроверитьЗаполнение(Подразделение, ТекстСообщения) Тогда 
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при записи подразделения'");
		Ошибка.description = ТекстСообщения;
		Возврат Ложь;
	КонецЕсли;
	Подразделение.Записать();
	
	Возврат Истина;
	
КонецФункции	

// Заполняет объект Документооборота по данным объекта XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   Подразделение - СправочникОбъект.Подразделения - заполняемый объект
//   ОбъектXDTO - ОбъектXDTO типа DMSubdivision - источник данных заполнения
//
Процедура ЗаполнитьДанныеПодразделения(Узел, Подразделение, ОбъектXDTO) Экспорт 
	
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Подразделение.Наименование, ОбъектXDTO, "name");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Подразделение.Руководитель,	ОбъектXDTO, "head");
	
КонецПроцедуры

// Находит подходящее или создает новое подразделение по объекту XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   ОбъектXDTO - ОбъектXDTO типа DMSubdivision
//
// Возвращаемое значение:
//   СправочникСсылка.Подразделения - найденная или созданная подразделение
//
Функция НайтиСоздатьПодразделение(Узел, ОбъектXDTO) Экспорт
	
	ВнешнийID = ОбъектXDTO.externalObject.id;
	ВнешнийТип = ОбъектXDTO.externalObject.type;
	СсылкаДО = Неопределено;
	
	// синхронизация по наименованию
	Если Не ЗначениеЗаполнено(ВнешнийID) Тогда 
		
		Наименование = Неопределено;
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Наименование, ОбъектXDTO, "name");
		СсылкаДО = Справочники.СтруктураПредприятия.НайтиПоНаименованию(Наименование, Истина); 
		Если Не ЗначениеЗаполнено(СсылкаДО) Тогда 
			ОбъектДО = Справочники.СтруктураПредприятия.СоздатьЭлемент();
			ОбъектДО.Наименование = Наименование;
			ОбъектДО.Записать();
			СсылкаДО = ОбъектДО.Ссылка;
		КонецЕсли;	
		
		Возврат СсылкаДО;
	КонецЕсли;
	
	СсылкаДО = СправочникСсылкаПоИдентификаторуВнешнегоОбъекта(Узел, ОбъектXDTO, "СтруктураПредприятия");
	Если СсылкаДО <> Неопределено Тогда
		ОбъектДО = СсылкаДО.ПолучитьОбъект();
		ОбъектДО.Заблокировать();
		ЗаполнитьДанныеПодразделения(Узел, ОбъектДО, ОбъектXDTO);
		Если ОбъектДО.Модифицированность() Тогда
			ОбъектДО.Записать();
		КонецЕсли;
		Возврат СсылкаДО;
	КонецЕсли;
	
	// переопределяемый поиск
	СсылкаДО = ОбработкаЗапросовXDTOПереопределяемый.НайтиСоответствиеДляВнешнегоОбъекта(ОбъектXDTO);
	
	// стандартный поиск
	Если Не ЗначениеЗаполнено(СсылкаДО) Тогда 
		
		Наименование = "";
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Наименование, ОбъектXDTO, "name");
		СсылкаДО = Справочники.СтруктураПредприятия.НайтиПоНаименованию(Наименование, Истина);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СсылкаДО) Тогда 
		ОбъектДО = СсылкаДО.ПолучитьОбъект();
	Иначе	
		ОбъектДО = Справочники.СтруктураПредприятия.СоздатьЭлемент();
		УстановитьСсылкуНовогоДляСправочника(ОбъектДО, ОбъектXDTO);
	КонецЕсли;	
	ОбъектДО.Заблокировать();
	ЗаполнитьДанныеПодразделения(Узел, ОбъектДО, ОбъектXDTO);
	Если ОбъектДО.Модифицированность() Тогда
		ОбъектДО.Записать();
	КонецЕсли;
	
	Возврат ОбъектДО.Ссылка;
	
КонецФункции

#КонецОбласти

#Область СтатьяДвиженияДенежныхСредств

// Получает заполненный объект XDTO, соответствующий статье ДДС 
// 
// Параметры:
//   ОбъектИд - ОбъектXDTO типа ObjectId, описывающий существующую статью ДДС.
//   НаборКолонок - Массив - массив имен реквизитов к получению
//                - Неопределено - требование получить все реквизиты
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMCashFlowItem или DMError
//
Функция ПолучитьСтатьюДвиженияДенежныхСредств(ОбъектИд, НаборКолонок = Неопределено) Экспорт 
	
	Попытка 
		
		Ссылка = ОбработкаЗапросовXDTO.ПолучитьСсылкуПоObjectID(ОбъектИд);
		СтатьяДвиженияДенежныхСредств = Ссылка.ПолучитьОбъект();
		
		Объект = ОбработкаЗапросовXDTO.СоздатьОбъект("DMCashFlowItem");
		ПолучитьДанныеСтатьиДвиженияДенежныхСредств(СтатьяДвиженияДенежныхСредств, Объект, НаборКолонок);
		
		Возврат Объект;
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при получении статьи ДДС'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;
	
КонецФункции

// Заполняет объект XDTO по данным объекта Документооборота
//
// Параметры:
//   СтатьяДвиженияДенежныхСредств - СправочникОбъект.СтатьиДвиженияДенежныхСредств
//   ОбъектXDTO - ОбъектXDTO типа DMCashFlowItem
//   НаборКолонок - Массив - массив имен реквизитов к заполнению
//                - Неопределено - требование заполнить все реквизиты
//
Процедура ПолучитьДанныеСтатьиДвиженияДенежныхСредств(СтатьяДвиженияДенежныхСредств, ОбъектXDTO, 
	НаборКолонок = Неопределено) Экспорт 
	
	ДанныеСтатьиДвиженияДенежныхСредств = Новый Структура;
	ДанныеСтатьиДвиженияДенежныхСредств.Вставить("description", СтатьяДвиженияДенежныхСредств.Описание);
	
	// набор колонок
	Колонки = Новый Массив;
	Если НаборКолонок <> Неопределено Тогда 
		Для Каждого Элемент Из НаборКолонок Цикл
			Колонки.Добавить(НРег(Элемент));
		КонецЦикла;	
	КонецЕсли;
	
	Для Каждого Реквизит Из ДанныеСтатьиДвиженияДенежныхСредств Цикл
		Если Колонки.Количество() = 0 Или Колонки.Найти(НРег(Реквизит.Ключ)) <> Неопределено Тогда 
			ОбработкаЗапросовXDTO.ЗаполнитьСвойствоXDTOИзРеквизита(ОбъектXDTO, Реквизит.Ключ, Реквизит.Значение);
		КонецЕсли;
	КонецЦикла;
	
	ОбъектXDTO.objectId = ОбработкаЗапросовXDTO.ПолучитьObjectIDПоСсылке(СтатьяДвиженияДенежныхСредств.Ссылка);
	ОбъектXDTO.name = СтатьяДвиженияДенежныхСредств.Наименование;
	
КонецПроцедуры	

// Создает новую статью ДДС по объекту XDTO
// 
// Параметры:
//   Сообщение - ОбъектXDTO типа DMCashFlowItem
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMCashFlowItem или DMError
//
Функция СоздатьСтатьюДвиженияДенежныхСредств(Сообщение) Экспорт 
	
	Попытка 
		
		Узел = ОбработкаЗапросовXDTO.УзелИнтегрированнойСистемы(Сообщение);
		СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
		Объект = Сообщение.object;
		УстановитьСсылкуНовогоДляСправочника(СтатьяДвиженияДенежныхСредств, Объект);
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Если Не ЗаписатьДанныеСтатьиДвиженияДенежныхСредств(Узел, СтатьяДвиженияДенежныхСредств,
			Объект, Ошибка) Тогда 
			Возврат Ошибка;
		КонецЕсли;
		
		Если Объект.Установлено("externalObject") Тогда 
			ОбработкаЗапросовXDTO.ДобавитьСвязьОбъектаДОИВнешнегоОбъекта(Узел, Объект.externalObject.id, 
				Объект.externalObject.type, СтатьяДвиженияДенежныхСредств.Ссылка);
		КонецЕсли;	
		
		ОбъектИд = ОбработкаЗапросовXDTO.ПолучитьObjectIDПоСсылке(СтатьяДвиженияДенежныхСредств.Ссылка);
		Возврат ПолучитьСтатьюДвиженияДенежныхСредств(ОбъектИд);
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при создании статьи ДДС'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;
	
КонецФункции

// Изменяет и записывает статью ДДС по объекту XDTO
// 
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   Объект - ОбъектXDTO типа DMCashFlowItem
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMCashFlowItem, заново заполненный, или DMError
//
Функция ИзменитьСтатьюДвиженияДенежныхСредств(Узел, Объект) Экспорт 
	
	Попытка 
		
		Ссылка = ОбработкаЗапросовXDTO.ПолучитьСсылкуПоObjectID(Объект.objectId);
		СтатьяДвиженияДенежныхСредств = Ссылка.ПолучитьОбъект();
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Если Не ЗаписатьДанныеСтатьиДвиженияДенежныхСредств(Узел, СтатьяДвиженияДенежныхСредств,
			Объект, Ошибка) Тогда 
			Возврат Ошибка;
		КонецЕсли;
		
		ОбъектИд = ОбработкаЗапросовXDTO.ПолучитьObjectIDПоСсылке(СтатьяДвиженияДенежныхСредств.Ссылка);
		Возврат ПолучитьСтатьюДвиженияДенежныхСредств(ОбъектИд);
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при изменении статьи ДДС'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;	
	
КонецФункции

// Заполняет и записывает объект Документооборота по данным объекта XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   СтатьяДвиженияДенежныхСредств - СправочникОбъект.СтатьиДвиженияДенежныхСредств - записываемый объект
//   ОбъектXDTO - ОбъектXDTO типа DMCashFlowItem - источник данных
//   Ошибка - ОбъектXDTO типа DMError - неявно возвращаемое значение ошибки
//
// Возвращаемое значение:
//   Булево - Истина, если операция завершена успешно, и Ложь в противном случае
//
Функция ЗаписатьДанныеСтатьиДвиженияДенежныхСредств(Узел, СтатьяДвиженияДенежныхСредств, ОбъектXDTO, 
	Ошибка) 
	
	СтатьяДвиженияДенежныхСредств.Заблокировать();
	ЗаполнитьДанныеСтатьиДвиженияДенежныхСредств(Узел, СтатьяДвиженияДенежныхСредств, ОбъектXDTO);
	
	// проверка заполнения
	ТекстСообщения = "";
	Если Не ОбработкаЗапросовXDTO.ПроверитьЗаполнение(СтатьяДвиженияДенежныхСредств, ТекстСообщения) Тогда 
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при записи статьи ДДС'");
		Ошибка.description = ТекстСообщения;
		Возврат Ложь;
	КонецЕсли;
	СтатьяДвиженияДенежныхСредств.Записать();
	
	Возврат Истина;
	
КонецФункции	

// Заполняет объект Документооборота по данным объекта XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   СтатьяДвиженияДенежныхСредств - СправочникОбъект.СтатьиДвиженияДенежныхСредств - заполняемый объект
//   ОбъектXDTO - ОбъектXDTO типа DMCashFlowItem - источник данных заполнения
//
Процедура ЗаполнитьДанныеСтатьиДвиженияДенежныхСредств(Узел, СтатьяДвиженияДенежныхСредств, 
	ОбъектXDTO) Экспорт 
	
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, СтатьяДвиженияДенежныхСредств.Наименование,
		ОбъектXDTO, "name");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, СтатьяДвиженияДенежныхСредств.Описание,
		ОбъектXDTO, "description");
	
КонецПроцедуры

// Находит подходящую или создает новую статью ДДС по объекту XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   ОбъектXDTO - ОбъектXDTO типа DMCashFlowItem
//
// Возвращаемое значение:
//   СправочникСсылка.СтатьиДвиженияДенежныхСредств - найденная или созданная статья ДДС
//
Функция НайтиСоздатьСтатьюДвиженияДенежныхСредств(Узел, ОбъектXDTO) Экспорт
	
	ВнешнийID = ОбъектXDTO.externalObject.id;
	ВнешнийТип = ОбъектXDTO.externalObject.type;
	СсылкаДО = Неопределено;
	
	// синхронизация по наименованию
	Если Не ЗначениеЗаполнено(ВнешнийID) Тогда 
		
		Наименование = Неопределено;
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Наименование, ОбъектXDTO, "name");
		СсылкаДО = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию(Наименование, Истина); 
		Если Не ЗначениеЗаполнено(СсылкаДО) Тогда 
			ОбъектДО = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
			ОбъектДО.Наименование = Наименование;
			ОбъектДО.Записать();
			СсылкаДО = ОбъектДО.Ссылка;
		КонецЕсли;
		
		Возврат СсылкаДО;
	КонецЕсли;
	
	СсылкаДО = СправочникСсылкаПоИдентификаторуВнешнегоОбъекта(Узел, ОбъектXDTO, 
		"СтатьиДвиженияДенежныхСредств");
	Если СсылкаДО <> Неопределено Тогда
		ОбъектДО = СсылкаДО.ПолучитьОбъект();
		ОбъектДО.Заблокировать();
		ЗаполнитьДанныеСтатьиДвиженияДенежныхСредств(Узел, ОбъектДО, ОбъектXDTO);
		Если ОбъектДО.Модифицированность() Тогда
			ОбъектДО.Записать();
		КонецЕсли;
		Возврат СсылкаДО;
	КонецЕсли;
	
	// переопределяемый поиск
	СсылкаДО = ОбработкаЗапросовXDTOПереопределяемый.НайтиСоответствиеДляВнешнегоОбъекта(ОбъектXDTO);
	
	// стандартный поиск
	Если Не ЗначениеЗаполнено(СсылкаДО) Тогда 
		
		Наименование = "";
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Наименование, ОбъектXDTO, "name");
		СсылкаДО = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию(Наименование, Истина);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СсылкаДО) Тогда 
		ОбъектДО = СсылкаДО.ПолучитьОбъект();
	Иначе	
		ОбъектДО = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
		УстановитьСсылкуНовогоДляСправочника(ОбъектДО, ОбъектXDTO);
	КонецЕсли;	
	ОбъектДО.Заблокировать();
	ЗаполнитьДанныеСтатьиДвиженияДенежныхСредств(Узел, ОбъектДО, ОбъектXDTO);
	Если ОбъектДО.Модифицированность() Тогда
		ОбъектДО.Записать();
	КонецЕсли;
	
	Возврат ОбъектДО.Ссылка;
	
КонецФункции

#КонецОбласти

#Область КонтактнаяИнформация

// Получает заполненный объект XDTO, соответствующий виду контактной информации 
// 
// Параметры:
//   ОбъектИд - ОбъектXDTO типа ObjectId, описывающий существующий вид КИ
//   НаборКолонок - Массив - массив имен реквизитов к получению
//                - Неопределено - требование получить все реквизиты
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMContactInformationKind или DMError
//
Функция ПолучитьВидКонтактнойИнформации(ОбъектИд, НаборКолонок = Неопределено) Экспорт 
	
	Попытка 
		
		Ссылка = ОбработкаЗапросовXDTO.ПолучитьСсылкуПоObjectID(ОбъектИд);
		Валюта = Ссылка.ПолучитьОбъект();
		
		Объект = ОбработкаЗапросовXDTO.СоздатьОбъект("DMContactInformationKind");
		ПолучитьДанныеВидаКонтактнойИнформации(Валюта, Объект, НаборКолонок);
		
		Возврат Объект;
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при получении вида контактной информации'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;
	
КонецФункции

// Заполняет объект XDTO по данным объекта Документооборота
//
// Параметры:
//   ВидКонтактнойИнформации - СправочникОбъект.ВидыКонтактнойИнформации
//   ОбъектXDTO - ОбъектXDTO типа DMContactInformationKind
//   НаборКолонок - Массив - массив имен реквизитов к заполнению
//                - Неопределено - требование заполнить все реквизиты
//
Процедура ПолучитьДанныеВидаКонтактнойИнформации(ВидКонтактнойИнформации, ОбъектXDTO, НаборКолонок = Неопределено) 
	
	ДанныеВидаКИ = Новый Структура;
	ДанныеВидаКИ.Вставить("type", 	  ВидКонтактнойИнформации.Тип);
	ДанныеВидаКИ.Вставить("mandatory", ВидКонтактнойИнформации.ОбязательноеЗаполнение);
	ДанныеВидаКИ.Вставить("parent", ВидКонтактнойИнформации.Родитель);
	ДанныеВидаКИ.Вставить("predefinedName", ОбщегоНазначения.ИмяПредопределенного(ВидКонтактнойИнформации.Ссылка));
	
	// набор колонок
	Колонки = Новый Массив;
	Если НаборКолонок <> Неопределено Тогда 
		Для Каждого Элемент Из НаборКолонок Цикл
			Колонки.Добавить(НРег(Элемент));
		КонецЦикла;	
	КонецЕсли;
	
	Для Каждого Реквизит Из ДанныеВидаКИ Цикл
		Если Колонки.Количество() = 0 Или Колонки.Найти(НРег(Реквизит.Ключ)) <> Неопределено Тогда 
			ОбработкаЗапросовXDTO.ЗаполнитьСвойствоXDTOИзРеквизита(ОбъектXDTO, Реквизит.Ключ, Реквизит.Значение);
		КонецЕсли;	
	КонецЦикла;
	
	ОбъектXDTO.objectId = ОбработкаЗапросовXDTO.ПолучитьObjectIDПоСсылке(ВидКонтактнойИнформации.Ссылка);
	ОбъектXDTO.name = ВидКонтактнойИнформации.Наименование;
	
КонецПроцедуры	

// Дополняет объект XDTO данными табличной части Контактная информация объекта ДО
//
// Параметры:
//   ОбъектДО - СправочникОбъект.Корреспонденты, СправочникОбъект.КонтактныеЛица
//   ОбъектXDTO - ОбъектXDTO типа DMCorrespondent, DMContactPerson 
//
Процедура ПолучитьКонтактнуюИнформациюОбъектаДО(ОбъектДО, ОбъектXDTO) Экспорт
	
	Для каждого СтрокаКонтактнаяИнформация из ОбъектДО.КонтактнаяИнформация Цикл
		
		ОбъектКИ = ОбработкаЗапросовXDTO.СоздатьОбъект("DMContactInformationItem");
		
		ОбработкаЗапросовXDTO.ЗаполнитьСвойствоXDTOИзРеквизита(ОбъектКИ, "type", СтрокаКонтактнаяИнформация.Тип);
		ОбработкаЗапросовXDTO.ЗаполнитьСвойствоXDTOИзРеквизита(ОбъектКИ, "kind", СтрокаКонтактнаяИнформация.Вид);
		ПолучитьДанныеВидаКонтактнойИнформации(СтрокаКонтактнаяИнформация.Вид, ОбъектКИ.kind);
		
		ОбъектКИ.description = СтрокаКонтактнаяИнформация.Представление;
		ОбъектКИ.fieldValues = СтрокаКонтактнаяИнформация.ЗначенияПолей;
		ОбъектКИ.country = СтрокаКонтактнаяИнформация.Страна;
		ОбъектКИ.territory = СтрокаКонтактнаяИнформация.Регион;
		ОбъектКИ.city = СтрокаКонтактнаяИнформация.Город;
		ОбъектКИ.email = СтрокаКонтактнаяИнформация.АдресЭП;
		ОбъектКИ.serverDomainName = СтрокаКонтактнаяИнформация.ДоменноеИмяСервера;
		ОбъектКИ.phoneNumber = СтрокаКонтактнаяИнформация.НомерТелефона;
		ОбъектКИ.localPhoneNumber = СтрокаКонтактнаяИнформация.НомерТелефонаБезКодов;
		
		ОбъектXDTO.contactInformation.Добавить(ОбъектКИ);
		
	КонецЦикла;
	
КонецПроцедуры

// Переносит в табличную часть Контактная информация данные из свойства contactInformation объекта XDTO
//
// Параметры:
//   ОбъектДО - СправочникОбъект.Корреспонденты, СправочникОбъект.КонтактныеЛица
//   ОбъектXDTO - ОбъектXDTO типа DMCorrespondent, DMContactPerson 
//
Процедура ЗаполнитьКонтактнуюИнформациюОбъектаДО(ОбъектДО, ОбъектXDTO) Экспорт
	
	Для каждого contactInformationItem из ОбъектXDTO.contactInformation Цикл
		
		СтрокаКИ = ОбъектДО.КонтактнаяИнформация.Добавить();
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(СтрокаКИ.Тип, contactInformationItem, "type");
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(СтрокаКИ.Вид, contactInformationItem, "kind");
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(СтрокаКИ.Представление, contactInformationItem, "description");
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(СтрокаКИ.ЗначенияПолей, contactInformationItem, "fieldValues");
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(СтрокаКИ.Страна, contactInformationItem, "country");
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(СтрокаКИ.Регион, contactInformationItem, "territory");
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(СтрокаКИ.Город, contactInformationItem, "city");
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(СтрокаКИ.АдресЭП, contactInformationItem, "email");
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(СтрокаКИ.ДоменноеИмяСервера, contactInformationItem, "serverDomainName");
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(СтрокаКИ.НомерТелефона, contactInformationItem, "phoneNumber");
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(СтрокаКИ.НомерТелефонаБезКодов, contactInformationItem, "localPhoneNumber");
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ВидДокумента

// Создает новый вид документа по объекту XDTO
// 
// Параметры:
//   Сообщение - ОбъектXDTO типа DMCreateRequest
//
// Возвращаемое значение:
//   ОбъектXDTO типа DM<...>DocumentType или DMError
//
Функция СоздатьВидДокумента(Сообщение) Экспорт 
	
	Попытка 
		
		Узел = ОбработкаЗапросовXDTO.УзелИнтегрированнойСистемы(Сообщение);
		Объект = Сообщение.object;
		ТипОбъекта = Объект.objectId.type;
		Если ТипОбъекта = "DMInternalDocumentType" Тогда
			ВидСправочника = "ВидыВнутреннихДокументов";
		ИначеЕсли ТипОбъекта = "DMIncomingDocumentType" Тогда
			ВидСправочника = "ВидыВходящихДокументов";
		Иначе
			ВидСправочника = "ВидыИсходящихДокументов";
		КонецЕсли;
		ВидДокумента = Справочники[ВидСправочника].СоздатьЭлемент();
		УстановитьСсылкуНовогоДляСправочника(ВидДокумента, Объект);
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Если Не ЗаписатьДанныеВидаДокумента(Узел, ВидДокумента, Объект, Ошибка, Ложь) Тогда 
			Возврат Ошибка;
		КонецЕсли;
		
		Если Объект.automaticNumeration = Истина Тогда // запишем настройки автонумерации
			ЗаписьНастроекНумерации = РегистрыСведений.НастройкиНумерации.СоздатьМенеджерЗаписи();
			Если ТипОбъекта = "DMInternalDocumentType" Тогда
				ЗаписьНастроекНумерации.ТипДокумента = Перечисления.ТипыОбъектов.ВнутренниеДокументы;
				ЗаписьНастроекНумерации.Нумератор = Справочники.Нумераторы.ВнутренниеДокументы;
			ИначеЕсли ТипОбъекта = "DMIncomingDocumentType" Тогда
				ЗаписьНастроекНумерации.ТипДокумента = Перечисления.ТипыОбъектов.ВходящиеДокументы;
				ЗаписьНастроекНумерации.Нумератор = Справочники.Нумераторы.ВходящиеДокументы;
			Иначе
				ЗаписьНастроекНумерации.ТипДокумента = Перечисления.ТипыОбъектов.ИсходящиеДокументы;
				ЗаписьНастроекНумерации.Нумератор = Справочники.Нумераторы.ИсходящиеДокументы;
			КонецЕсли;
			ЗаписьНастроекНумерации.ВидДокумента = ВидДокумента.Ссылка;
			ЗаписьНастроекНумерации.СпособНумерации = Перечисления.СпособыНумерации.Автоматически;
			ЗаписьНастроекНумерации.Нумеровать = Нумерация.СформироватьПолеНумеровать(
				ЗаписьНастроекНумерации.СпособНумерации, ЗаписьНастроекНумерации.Нумератор);
			ЗаписьНастроекНумерации.Записать();
		КонецЕсли;
		
		Если Объект.Установлено("externalObject") Тогда 
			ОбработкаЗапросовXDTO.ДобавитьСвязьОбъектаДОИВнешнегоОбъекта(Узел, Объект.externalObject.id, Объект.externalObject.type, 
				ВидДокумента.Ссылка);
		КонецЕсли;	
		
		ОбъектИд = ОбработкаЗапросовXDTO.ПолучитьObjectIDПоСсылке(ВидДокумента.Ссылка);
		Возврат ПолучитьВидДокумента(ОбъектИд);
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при создании вида документа'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;
	
КонецФункции

// Получает заполненный объект XDTO, соответствующий виду документа
// 
// Параметры:
//   ОбъектИд - ОбъектXDTO типа ObjectId, описывающий существующий вид документа
//
// Возвращаемое значение:
//   ОбъектXDTO типа DM<>DocumentType
//
Функция ПолучитьВидДокумента(ОбъектИд) Экспорт 
	
	Попытка 
		
		Ссылка = ОбработкаЗапросовXDTO.ПолучитьСсылкуПоObjectID(ОбъектИд);
		ИмяТипа = ОбработкаЗапросовXDTO.ПолучитьИмяТипаСсылки(Ссылка);
		
		Объект = ОбработкаЗапросовXDTO.СоздатьОбъект(ИмяТипа);
		Объект.objectId = ОбработкаЗапросовXDTO.ПолучитьObjectIDПоСсылке(Ссылка);
		Объект.name = Строка(Ссылка);
		
		ПолучитьДанныеВидаДокумента(Объект, Ссылка);
		
		Возврат Объект;
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при получении вида документа'");
		Инфо = ИнформацияОбОшибке();  
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;
	
КонецФункции	

// Заполняет объект XDTO по данным объекта Документооборота
//
// Параметры:
//   ОбъектXDTO - ОбъектXDTO типа DM<...>DocumentType
//   Ссылка - СправочникСсылка.Виды<...>Документов
//
Процедура ПолучитьДанныеВидаДокумента(ОбъектXDTO, Ссылка)
	
	ОбработкаЗапросовXDTO.ЗаполнитьСвойствоXDTOИзРеквизита(ОбъектXDTO, "performanceDateEnabled", Ссылка.ИспользоватьСрокИсполнения);
	ОбработкаЗапросовXDTO.ЗаполнитьСвойствоXDTOИзРеквизита(ОбъектXDTO, "sumEnabled", Ссылка.УчитыватьСуммуДокумента);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиНумерации.СпособНумерации
	|ИЗ
	|	РегистрСведений.НастройкиНумерации КАК НастройкиНумерации
	|ГДЕ
	|	НастройкиНумерации.ВидДокумента = &ВидДокумента";
	Запрос.УстановитьПараметр("ВидДокумента", Ссылка);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		АвтоНумерация = Ложь;
	Иначе
		АвтоНумерация = Результат.Выгрузить()[0].СпособНумерации = Перечисления.СпособыНумерации.Автоматически
	КонецЕсли;
	
	ОбработкаЗапросовXDTO.ЗаполнитьСвойствоXDTOИзРеквизита(ОбъектXDTO, "automaticNumeration", АвтоНумерация);
	
	Если ОбработкаЗапросовXDTO.ПроверитьТип(ОбъектXDTO, "DMIncomingDocumentType") Тогда 
		
	ИначеЕсли ОбработкаЗапросовXDTO.ПроверитьТип(ОбъектXDTO, "DMOutgoingDocumentType") Тогда 
		ОбработкаЗапросовXDTO.ЗаполнитьСвойствоXDTOИзРеквизита(ОбъектXDTO, "externalNumberEnabled", Ссылка.УчитыватьВходящийНомерИДатуПолучателя);
		
	ИначеЕсли ОбработкаЗапросовXDTO.ПроверитьТип(ОбъектXDTO, "DMInternalDocumentType") Тогда 
		ОбработкаЗапросовXDTO.ЗаполнитьСвойствоXDTOИзРеквизита(ОбъектXDTO, "durationEnabled", Ссылка.УчитыватьСрокДействия);
		ОбработкаЗапросовXDTO.ЗаполнитьСвойствоXDTOИзРеквизита(ОбъектXDTO, "correspondentEnabled", Ссылка.ВестиУчетПоКорреспондентам);
		ОбработкаЗапросовXDTO.ЗаполнитьСвойствоXDTOИзРеквизита(ОбъектXDTO, "cashFlowDetailsEnabled", Ссылка.ВестиУчетПоСтатьямДДС);
		
	КонецЕсли;
		
КонецПроцедуры

// Заполняет и записывает объект Документооборота по данным объекта XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   ВидДокумента - СправочникОбъект.Виды<...>Документов - записываемый объект
//   ОбъектXDTO - ОбъектXDTO типа DM<...>DocumentType - источник данных
//   Ошибка - ОбъектXDTO типа DMError - неявно возвращаемое значение ошибки
//
// Возвращаемое значение:
//   Булево - Истина, если операция завершена успешно, и Ложь в противном случае
//
Функция ЗаписатьДанныеВидаДокумента(Узел, ВидДокумента, ОбъектXDTO, Ошибка, УдалитьРегистрацию = Ложь) 
	
	Блокировать = ЗначениеЗаполнено(ВидДокумента.Ссылка);
	Если Блокировать Тогда 
		ВидДокумента.Заблокировать();
	КонецЕсли;	
	
	ЗаполнитьДанныеВидаДокумента(Узел, ВидДокумента, ОбъектXDTO);
	
	// проверка заполнения
	ТекстСообщения = "";
	Если Не ОбработкаЗапросовXDTO.ПроверитьЗаполнение(ВидДокумента, ТекстСообщения) Тогда 
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при записи вида документа'");
		Ошибка.description = ТекстСообщения;
		Возврат Ложь;
	КонецЕсли;
	
	ВидДокумента.Записать();
	
	Если УдалитьРегистрацию Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(Узел, ВидДокумента.Ссылка);
	КонецЕсли;
		
	Если Блокировать Тогда 
		ВидДокумента.Разблокировать();
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции	

// Заполняет объект Документооборота по данным объекта XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   ВидДокумента - СправочникОбъект.Виды<...>Документов - заполняемый объект
//   ОбъектXDTO - ОбъектXDTO типа DM<...>DocumentType - источник данных заполнения
//
Процедура ЗаполнитьДанныеВидаДокумента(Узел, ВидДокумента, ОбъектXDTO) Экспорт 
	
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ВидДокумента.Наименование, ОбъектXDTO, "name");
	
	Если ОбработкаЗапросовXDTO.ПроверитьТип(ОбъектXDTO, "DMInternalDocumentType") Тогда
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ВидДокумента.ВестиУчетПоКорреспондентам, ОбъектXDTO, "correspondentEnabled");
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ВидДокумента.УчитыватьСрокДействия, ОбъектXDTO, "durationEnabled");
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ВидДокумента.ВестиУчетПоСтатьямДДС, ОбъектXDTO, "cashFlowDetailsEnabled");
	КонецЕсли;
	
КонецПроцедуры

// Находит подходящий или создает новый вид входящего документа по объекту XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   ОбъектXDTO - ОбъектXDTO типа DMIncomingDocumentType
//
// Возвращаемое значение:
//   СправочникСсылка.ВидыВходящихДокументов - найденный или созданный вид входящего документа
//
Функция НайтиСоздатьВидВходящегоДокумента(Узел, ОбъектXDTO) Экспорт 
	
	ВнешнийID = ОбъектXDTO.externalObject.id;
	ВнешнийТип = ОбъектXDTO.externalObject.type;
	СсылкаДО = Неопределено;
	
	// синхронизация по наименованию
	Если Не ЗначениеЗаполнено(ВнешнийID) Тогда 
		
		Наименование = Неопределено;
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Наименование, ОбъектXDTO, "name");
		СсылкаДО = Справочники.ВидыВходящихДокументов.НайтиПоНаименованию(Наименование, Истина); 
		Если Не ЗначениеЗаполнено(СсылкаДО) Тогда 
			ОбъектДО = Справочники.ВидыВходящихДокументов.СоздатьЭлемент();
			ОбъектДО.Наименование = Наименование;
			ОбъектДО.Записать();
			СсылкаДО = ОбъектДО.Ссылка;
		КонецЕсли;	
		
		Возврат СсылкаДО;
	КонецЕсли;
	
	СсылкаДО = СправочникСсылкаПоИдентификаторуВнешнегоОбъекта(Узел, ОбъектXDTO, "ВидыВходящихДокументов");
	Если СсылкаДО <> Неопределено Тогда
		ОбъектДО = СсылкаДО.ПолучитьОбъект();
		ОбъектДО.Заблокировать();
		ЗаполнитьДанныеВидаДокумента(Узел, ОбъектДО, ОбъектXDTO);
		Если ОбъектДО.Модифицированность() Тогда
			ОбъектДО.Записать();
		КонецЕсли;
		Возврат СсылкаДО;
	КонецЕсли;
	
	// переопределяемый поиск
	СсылкаДО = ОбработкаЗапросовXDTOПереопределяемый.НайтиСоответствиеДляВнешнегоОбъекта(ОбъектXDTO);
	
	// стандартный поиск
	Если Не ЗначениеЗаполнено(СсылкаДО) Тогда 
		
		Наименование = "";
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Наименование, ОбъектXDTO, "name");
		СсылкаДО = Справочники.ВидыВходящихДокументов.НайтиПоНаименованию(Наименование, Истина);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СсылкаДО) Тогда 
		ОбъектДО = СсылкаДО.ПолучитьОбъект();
	Иначе	
		ОбъектДО = Справочники.ВидыВходящихДокументов.СоздатьЭлемент();
		УстановитьСсылкуНовогоДляСправочника(ОбъектДО, ОбъектXDTO);
	КонецЕсли;	
	ОбъектДО.Заблокировать();
	ЗаполнитьДанныеВидаДокумента(Узел, ОбъектДО, ОбъектXDTO);
	Если ОбъектДО.Модифицированность() Тогда
		ОбъектДО.Записать();
	КонецЕсли;
	
	Возврат ОбъектДО.Ссылка;
	
КонецФункции

// Находит подходящий или создает новый вид исходящего документа по объекту XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   ОбъектXDTO - ОбъектXDTO типа DMOutgoingDocumentType
//
// Возвращаемое значение:
//   СправочникСсылка.ВидыИсходящихДокументов - найденный или созданный вид исходящего документа
//
Функция НайтиСоздатьВидИсходящегоДокумента(Узел, ОбъектXDTO) Экспорт 
	
	ВнешнийID = ОбъектXDTO.externalObject.id;
	ВнешнийТип = ОбъектXDTO.externalObject.type;
	СсылкаДО = Неопределено;
	
	// синхронизация по наименованию
	Если Не ЗначениеЗаполнено(ВнешнийID) Тогда 
		
		Наименование = Неопределено;
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Наименование, ОбъектXDTO, "name");
		СсылкаДО = Справочники.ВидыИсходящихДокументов.НайтиПоНаименованию(Наименование, Истина); 
		Если Не ЗначениеЗаполнено(СсылкаДО) Тогда 
			ОбъектДО = Справочники.ВидыИсходящихДокументов.СоздатьЭлемент();
			ОбъектДО.Наименование = Наименование;
			ОбъектДО.Записать();
			СсылкаДО = ОбъектДО.Ссылка;
		КонецЕсли;	
		
		Возврат СсылкаДО;
	КонецЕсли;
	
	СсылкаДО = СправочникСсылкаПоИдентификаторуВнешнегоОбъекта(Узел, ОбъектXDTO, "ВидыИсходящихДокументов");
	Если СсылкаДО <> Неопределено Тогда
		ОбъектДО = СсылкаДО.ПолучитьОбъект();
		ОбъектДО.Заблокировать();
		ЗаполнитьДанныеВидаДокумента(Узел, ОбъектДО, ОбъектXDTO);
		Если ОбъектДО.Модифицированность() Тогда
			ОбъектДО.Записать();
		КонецЕсли;
		Возврат СсылкаДО;
	КонецЕсли;
		
	// переопределяемый поиск
	СсылкаДО = ОбработкаЗапросовXDTOПереопределяемый.НайтиСоответствиеДляВнешнегоОбъекта(ОбъектXDTO);
	
	// стандартный поиск
	Если Не ЗначениеЗаполнено(СсылкаДО) Тогда 
		
		Наименование = "";
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Наименование, ОбъектXDTO, "name");
		СсылкаДО = Справочники.ВидыИсходящихДокументов.НайтиПоНаименованию(Наименование, Истина);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СсылкаДО) Тогда 
		ОбъектДО = СсылкаДО.ПолучитьОбъект();
	Иначе	
		ОбъектДО = Справочники.ВидыИсходящихДокументов.СоздатьЭлемент();
		УстановитьСсылкуНовогоДляСправочника(ОбъектДО, ОбъектXDTO);
	КонецЕсли;	
	ОбъектДО.Заблокировать();
	ЗаполнитьДанныеВидаДокумента(Узел, ОбъектДО, ОбъектXDTO);
	Если ОбъектДО.Модифицированность() Тогда
		ОбъектДО.Записать();
	КонецЕсли;
	
	Возврат ОбъектДО.Ссылка;
	
	
КонецФункции

// Находит подходящий или создает новый вид внутреннего документа по объекту XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   ОбъектXDTO - ОбъектXDTO типа DMInternalDocumentType
//
// Возвращаемое значение:
//   СправочникСсылка.ВидыВнутреннихДокументов - найденный или созданный вид внутреннего документа
//
Функция НайтиСоздатьВидВнутреннегоДокумента(Узел, ОбъектXDTO) Экспорт 
	
	ВнешнийID = ОбъектXDTO.externalObject.id;
	ВнешнийТип = ОбъектXDTO.externalObject.type;
	СсылкаДО = Неопределено;
	
	// синхронизация по наименованию
	Если Не ЗначениеЗаполнено(ВнешнийID) Тогда 
		
		Наименование = Неопределено;
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Наименование, ОбъектXDTO, "name");
		СсылкаДО = Справочники.ВидыВнутреннихДокументов.НайтиПоНаименованию(Наименование, Истина); 
		Если Не ЗначениеЗаполнено(СсылкаДО) Тогда 
			ОбъектДО = Справочники.ВидыВнутреннихДокументов.СоздатьЭлемент();
			ОбъектДО.Наименование = Наименование;
			ОбъектДО.Записать();
			СсылкаДО = ОбъектДО.Ссылка;
		КонецЕсли;
		
		Возврат СсылкаДО;
	КонецЕсли;
	
	СсылкаДО = СправочникСсылкаПоИдентификаторуВнешнегоОбъекта(Узел, ОбъектXDTO, "ВидыВнутреннихДокументов");
	Если СсылкаДО <> Неопределено Тогда
		ОбъектДО = СсылкаДО.ПолучитьОбъект();
		ОбъектДО.Заблокировать();
		ЗаполнитьДанныеВидаДокумента(Узел, ОбъектДО, ОбъектXDTO);
		Если ОбъектДО.Модифицированность() Тогда
			ОбъектДО.Записать();
		КонецЕсли;
		Возврат СсылкаДО;
	КонецЕсли;
	
	// переопределяемый поиск
	СсылкаДО = ОбработкаЗапросовXDTOПереопределяемый.НайтиСоответствиеДляВнешнегоОбъекта(ОбъектXDTO);
	
	// стандартный поиск
	Если Не ЗначениеЗаполнено(СсылкаДО) Тогда 
		
		Наименование = "";
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Наименование, ОбъектXDTO, "name");
		СсылкаДО = Справочники.ВидыВнутреннихДокументов.НайтиПоНаименованию(Наименование, Истина);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СсылкаДО) Тогда 
		ОбъектДО = СсылкаДО.ПолучитьОбъект();
	Иначе	
		ОбъектДО = Справочники.ВидыВнутреннихДокументов.СоздатьЭлемент();
		УстановитьСсылкуНовогоДляСправочника(ОбъектДО, ОбъектXDTO);
	КонецЕсли;	
	ОбъектДО.Заблокировать();
	ЗаполнитьДанныеВидаДокумента(Узел, ОбъектДО, ОбъектXDTO);
	Если ОбъектДО.Модифицированность() Тогда
		ОбъектДО.Записать();
	КонецЕсли;
	
	Возврат ОбъектДО.Ссылка;
	
КонецФункции

#КонецОбласти

#Область ПапкаВнутреннихДокументов

// Создает новую папку внутренних документов по объекту XDTO
// 
// Параметры:
//   Сообщение - ОбъектXDTO типа DMCreateRequest
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMInternalDocumentFolder или DMError
//
Функция СоздатьПапкуВнутреннихДокументов(Сообщение) Экспорт 
	
	Попытка 
		
		Узел = ОбработкаЗапросовXDTO.УзелИнтегрированнойСистемы(Сообщение);
		Папка = Справочники.ПапкиВнутреннихДокументов.СоздатьЭлемент();
		Объект = Сообщение.object;
		УстановитьСсылкуНовогоДляСправочника(Папка, Объект);
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Если Не ЗаписатьДанныеПапкиВнутреннихДокументов(Узел, Папка, Объект, Ошибка, Ложь) Тогда 
			Возврат Ошибка;
		КонецЕсли;
		
		Если Объект.Установлено("externalObject") Тогда 
			ОбработкаЗапросовXDTO.ДобавитьСвязьОбъектаДОИВнешнегоОбъекта(Узел, Объект.externalObject.id, Объект.externalObject.type, 
				Папка.Ссылка);
		КонецЕсли;	
		
		ОбъектИд = ОбработкаЗапросовXDTO.ПолучитьObjectIDПоСсылке(Папка.Ссылка);
		Возврат ПолучитьПапкуВнутреннихДокументов(Узел, ОбъектИд);
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при создании папки внутренних документов'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;
	
КонецФункции

// Получает заполненный объект XDTO, соответствующий папке внутренних документов
// 
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   ОбъектИд - ОбъектXDTO типа ObjectId, описывающий существующую папку
//   НаборКолонок - Массив - массив имен реквизитов к получению
//                - Неопределено - требование получить все реквизиты
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMInternalDocumentFolder или DMError
//
Функция ПолучитьПапкуВнутреннихДокументов(Узел, ОбъектИд, НаборКолонок = Неопределено) Экспорт 
	
	Попытка 
		
		Ссылка = ОбработкаЗапросовXDTO.ПолучитьСсылкуПоObjectID(ОбъектИд);
		Папка = Ссылка.ПолучитьОбъект();
		
		Объект = ОбработкаЗапросовXDTO.СоздатьОбъект("DMInternalDocumentFolder");
		ПолучитьДанныеПапкиВнутреннихДокументов(Узел, Папка, Объект, НаборКолонок);
		
		Возврат Объект;
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при получении папки внутренних документов'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;
	
КонецФункции

// Заполняет объект XDTO по данным объекта Документооборота
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   Папка - СправочникОбъект.ПапкиВнутреннихДокументов
//   ОбъектXDTO - ОбъектXDTO типа DMInternalDocumentFolder
//   НаборКолонок - Массив - массив имен реквизитов к заполнению
//                - Неопределено - требование заполнить все реквизиты
//
Процедура ПолучитьДанныеПапкиВнутреннихДокументов(Узел, Папка, ОбъектXDTO, НаборКолонок = Неопределено) 
	
	ДанныеПапки = Новый Структура;
	ДанныеПапки.Вставить("description", 	  Папка.Описание);
	ДанныеПапки.Вставить("responsible", 	  Папка.Ответственный);
	ДанныеПапки.Вставить("creationDate", 	  Папка.ДатаСоздания);
	
	ДанныеПапки.Вставить("parent", Папка.Родитель);
	
	// набор колонок
	Колонки = Новый Массив;
	Если НаборКолонок <> Неопределено Тогда 
		Для Каждого Элемент Из НаборКолонок Цикл
			Колонки.Добавить(НРег(Элемент));
		КонецЦикла;	
	КонецЕсли;
	ПолучатьВсеКолонки = (Колонки.Количество() = 0);
	
	Для Каждого Реквизит Из ДанныеПапки Цикл
		Если Колонки.Количество() = 0 Или Колонки.Найти(НРег(Реквизит.Ключ)) <> Неопределено Тогда 
			ОбработкаЗапросовXDTO.ЗаполнитьСвойствоXDTOИзРеквизита(ОбъектXDTO, Реквизит.Ключ, Реквизит.Значение);
		КонецЕсли;	
	КонецЦикла;
	
	// внешний объект
	Если ПолучатьВсеКолонки Или Колонки.Найти(НРег("externalObject")) <> Неопределено Тогда
		ВнешнийОбъект = ОбработкаЗапросовXDTO.ПолучитьСсылкуНаВнешнийОбъект(Узел, Папка.Ссылка);
		Если ЗначениеЗаполнено(ВнешнийОбъект) Тогда
			ВнешнийОбъектXDTO = ОбработкаЗапросовXDTO.СоздатьОбъект("ExternalObject");
			ВнешнийОбъектXDTO.id = ВнешнийОбъект.id;
			ВнешнийОбъектXDTO.type = ВнешнийОбъект.type;
			ВнешнийОбъектXDTO.name = ВнешнийОбъект.name;
			ОбъектXDTO.externalObject = ВнешнийОбъектXDTO;
		КонецЕсли;
	КонецЕсли;
	
	ОбъектXDTO.objectId = ОбработкаЗапросовXDTO.ПолучитьObjectIDПоСсылке(Папка.Ссылка);
	ОбъектXDTO.name = Папка.Наименование;
	
КонецПроцедуры	

// Заполняет и записывает объект Документооборота по данным объекта XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   Папка - СправочникОбъект.ПапкиВнутреннихДокументов - записываемый объект
//   ОбъектXDTO - ОбъектXDTO типа DMInternalDocumentFolder - источник данных
//   Ошибка - ОбъектXDTO типа DMError - неявно возвращаемое значение ошибки
//
// Возвращаемое значение:
//   Булево - Истина, если операция завершена успешно, и Ложь в противном случае
//
Функция ЗаписатьДанныеПапкиВнутреннихДокументов(Узел, Папка, ОбъектXDTO, Ошибка, УдалитьРегистрацию = Ложь) 
	
	Блокировать = ЗначениеЗаполнено(Папка.Ссылка);
	Если Блокировать Тогда 
		Папка.Заблокировать();
	КонецЕсли;	
	
	ЗаполнитьДанныеПапкиВнутреннихДокументов(Узел, Папка, ОбъектXDTO);
	
	// проверка заполнения
	ТекстСообщения = "";
	Если Не ОбработкаЗапросовXDTO.ПроверитьЗаполнение(Папка, ТекстСообщения) Тогда 
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при записи папки внутренних документов'");
		Ошибка.description = ТекстСообщения;
		Возврат Ложь;
	КонецЕсли;
	
	Папка.Записать();
	
	Если УдалитьРегистрацию Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(Узел, Папка.Ссылка);
	КонецЕсли;
		
	Если Блокировать Тогда 
		Папка.Разблокировать();
	КонецЕсли;	
	
	Возврат Истина;
	
КонецФункции	

// Заполняет объект Документооборота по данным объекта XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   Папка - СправочникОбъект.ПапкиВнутреннихДокументов - заполняемый объект
//   ОбъектXDTO - ОбъектXDTO типа DMInternalDocumentFolder - источник данных заполнения
//
Процедура ЗаполнитьДанныеПапкиВнутреннихДокументов(Узел, Папка, ОбъектXDTO) 
	
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Папка.Наименование, ОбъектXDTO, "name");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Папка.Описание, ОбъектXDTO, "description");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Папка.Ответственный, ОбъектXDTO, "responsible");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Папка.ДатаСоздания, ОбъектXDTO, "creationDate");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Папка.Родитель, ОбъектXDTO, "parent");
	
КонецПроцедуры	

#КонецОбласти

#Область РеквизитыДокумента

// Заполняет объект Документооборота по данным объекта XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   ГрифДоступа - СправочникОбъект.ГрифыДоступа - заполняемый объект
//   ОбъектXDTO - ОбъектXDTO типа DMAccessLevel - источник данных заполнения
//
Процедура ЗаполнитьДанныеГрифаДоступа(Узел, ГрифаДоступа, ОбъектXDTO) Экспорт 
	
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ГрифаДоступа.Наименование, ОбъектXDTO, "name");
	
КонецПроцедуры	

// Заполняет объект Документооборота по данным объекта XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   ВопросДеятельности - СправочникОбъект.ВидыДеятельности - заполняемый объект
//   ОбъектXDTO - ОбъектXDTO типа DMActivityMatter - источник данных заполнения
//
Процедура ЗаполнитьДанныеВопросаДеятельности(Узел, ВопросДеятельности, ОбъектXDTO) Экспорт 
	
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ВопросДеятельности.Наименование, ОбъектXDTO, "name");
	
КонецПроцедуры	

// Заполняет объект Документооборота по данным объекта XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   СпособДоставки - СправочникОбъект.СпособыДоставки - заполняемый объект
//   ОбъектXDTO - ОбъектXDTO типа DMDeliveryMethod - источник данных заполнения
//
Процедура ЗаполнитьДанныеСпособаДоставки(Узел, СпособДоставки, ОбъектXDTO) Экспорт 
	
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, СпособДоставки.Наименование, ОбъектXDTO, "name");
	
КонецПроцедуры

// Заполняет объект Документооборота по данным объекта XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   Проект - СправочникСсылка.Проекты - заполняемый объект 
//   ОбъектXDTO - ОбъектXDTO типа DMProject - источник данных заполнения
//
Процедура ЗаполнитьДанныеПроекта(Узел, Проект, ОбъектXDTO) Экспорт
	
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Проект.Наименование, ОбъектXDTO, "name");
	
КонецПроцедуры

// Находит подходящий или создает новый гриф доступа по объекту XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   ОбъектXDTO - ОбъектXDTO типа DMAccessLevel
//
// Возвращаемое значение:
//   СправочникСсылка.ГрифыДоступа - найденный или созданный элемент справочника
//
Функция НайтиСоздатьГрифДоступа(Узел, ОбъектXDTO) Экспорт 
	
	ВнешнийID = ОбъектXDTO.externalObject.id;
	ВнешнийТип = ОбъектXDTO.externalObject.type;
	СсылкаДО = Неопределено;
	
	// синхронизация по наименованию
	Если Не ЗначениеЗаполнено(ВнешнийID) Тогда 
		
		Наименование = Неопределено;
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Наименование, ОбъектXDTO, "name");
		СсылкаДО = Справочники.ГрифыДоступа.НайтиПоНаименованию(Наименование, Истина); 
		Если Не ЗначениеЗаполнено(СсылкаДО) Тогда 
			ОбъектДО = Справочники.ГрифыДоступа.СоздатьЭлемент();
			ОбъектДО.Наименование = Наименование;
			ОбъектДО.Записать();
			СсылкаДО = ОбъектДО.Ссылка;
		КонецЕсли;	
		
		Возврат СсылкаДО;
	КонецЕсли;
	
	СсылкаДО = СправочникСсылкаПоИдентификаторуВнешнегоОбъекта(Узел, ОбъектXDTO, "ГрифыДоступа");
	Если СсылкаДО <> Неопределено Тогда
		ОбъектДО = СсылкаДО.ПолучитьОбъект();
		ОбъектДО.Заблокировать();
		ЗаполнитьДанныеГрифаДоступа(Узел, ОбъектДО, ОбъектXDTO);
		Если ОбъектДО.Модифицированность() Тогда
			ОбъектДО.Записать();
		КонецЕсли;
		Возврат СсылкаДО;
	КонецЕсли;
		
	// переопределяемый поиск
	СсылкаДО = ОбработкаЗапросовXDTOПереопределяемый.НайтиСоответствиеДляВнешнегоОбъекта(ОбъектXDTO);
	
	// стандартный поиск
	Если Не ЗначениеЗаполнено(СсылкаДО) Тогда 
		
		Наименование = "";
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Наименование, ОбъектXDTO, "name");
		СсылкаДО = Справочники.ГрифыДоступа.НайтиПоНаименованию(Наименование, Истина);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СсылкаДО) Тогда 
		ОбъектДО = СсылкаДО.ПолучитьОбъект();
	Иначе	
		ОбъектДО = Справочники.ГрифыДоступа.СоздатьЭлемент();
		УстановитьСсылкуНовогоДляСправочника(ОбъектДО, ОбъектXDTO);
	КонецЕсли;	
	ОбъектДО.Заблокировать();
	ЗаполнитьДанныеГрифаДоступа(Узел, ОбъектДО, ОбъектXDTO);
	Если ОбъектДО.Модифицированность() Тогда
		ОбъектДО.Записать();
	КонецЕсли;
	
	Возврат ОбъектДО.Ссылка;
	
КонецФункции

// Находит подходящий или создает новый вопрос деятельности по объекту XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   ОбъектXDTO - ОбъектXDTO типа DMActivityMatter
//
// Возвращаемое значение:
//   СправочникСсылка.ВопросыДеятельности - найденный или созданный элемент справочника
//
Функция НайтиСоздатьВопросДеятельности(Узел, ОбъектXDTO) Экспорт 
	
	ВнешнийID = ОбъектXDTO.externalObject.id;
	ВнешнийТип = ОбъектXDTO.externalObject.type;
	СсылкаДО = Неопределено;
	
	// синхронизация по наименованию
	Если Не ЗначениеЗаполнено(ВнешнийID) Тогда 
		
		Наименование = Неопределено;
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Наименование, ОбъектXDTO, "name");
		СсылкаДО = Справочники.ВопросыДеятельности.НайтиПоНаименованию(Наименование, Истина); 
		Если Не ЗначениеЗаполнено(СсылкаДО) Тогда 
			ОбъектДО = Справочники.ВопросыДеятельности.СоздатьЭлемент();
			ОбъектДО.Наименование = Наименование;
			ОбъектДО.Записать();
			СсылкаДО = ОбъектДО.Ссылка;
		КонецЕсли;	
		
		Возврат СсылкаДО;
	КонецЕсли;
	
	СсылкаДО = СправочникСсылкаПоИдентификаторуВнешнегоОбъекта(Узел, ОбъектXDTO, "ВопросыДеятельности");
	Если СсылкаДО <> Неопределено Тогда
		ОбъектДО = СсылкаДО.ПолучитьОбъект();
		ОбъектДО.Заблокировать();
		ЗаполнитьДанныеВопросаДеятельности(Узел, ОбъектДО, ОбъектXDTO);
		Если ОбъектДО.Модифицированность() Тогда
			ОбъектДО.Записать();
		КонецЕсли;
		Возврат СсылкаДО;
	КонецЕсли;
		
	// переопределяемый поиск
	СсылкаДО = ОбработкаЗапросовXDTOПереопределяемый.НайтиСоответствиеДляВнешнегоОбъекта(ОбъектXDTO);
	
	// стандартный поиск
	Если Не ЗначениеЗаполнено(СсылкаДО) Тогда 
		
		Наименование = "";
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Наименование, ОбъектXDTO, "Name");
		СсылкаДО = Справочники.ВопросыДеятельности.НайтиПоНаименованию(Наименование, Истина);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СсылкаДО) Тогда 
		ОбъектДО = СсылкаДО.ПолучитьОбъект();
	Иначе	
		ОбъектДО = Справочники.ВопросыДеятельности.СоздатьЭлемент();
		УстановитьСсылкуНовогоДляСправочника(ОбъектДО, ОбъектXDTO);
	КонецЕсли;	
	
	ЗаполнитьДанныеВопросаДеятельности(Узел, ОбъектДО, ОбъектXDTO);
	Если ОбъектДО.Модифицированность() Тогда
		ОбъектДО.Записать();
	КонецЕсли;
	
	Возврат ОбъектДО.Ссылка;
	
КонецФункции

// Находит подходящий или создает новый способ доставки по объекту XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   ОбъектXDTO - ОбъектXDTO типа DMDeliveryMethod
//
// Возвращаемое значение:
//   СправочникСсылка.СпособыДоставки - найденный или созданный элемент справочника
//
Функция НайтиСоздатьСпособДоставки(Узел, ОбъектXDTO) Экспорт 
	
	ВнешнийID = ОбъектXDTO.externalObject.id;
	ВнешнийТип = ОбъектXDTO.externalObject.type;
	СсылкаДО = Неопределено;
	
	// синхронизация по наименованию
	Если Не ЗначениеЗаполнено(ВнешнийID) Тогда 
		
		Наименование = Неопределено;
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Наименование, ОбъектXDTO, "name");
		СсылкаДО = Справочники.СпособыДоставки.НайтиПоНаименованию(Наименование, Истина); 
		Если Не ЗначениеЗаполнено(СсылкаДО) Тогда 
			ОбъектДО = Справочники.СпособыДоставки.СоздатьЭлемент();
			ОбъектДО.Наименование = Наименование;
			ОбъектДО.Записать();
			СсылкаДО = ОбъектДО.Ссылка;
		КонецЕсли;	
		
		Возврат СсылкаДО;
	КонецЕсли;
	
	СсылкаДО = СправочникСсылкаПоИдентификаторуВнешнегоОбъекта(Узел, ОбъектXDTO, "СпособыДоставки");
	Если СсылкаДО <> Неопределено Тогда
		ОбъектДО = СсылкаДО.ПолучитьОбъект();
		ОбъектДО.Заблокировать();
		ЗаполнитьДанныеСпособаДоставки(Узел, ОбъектДО, ОбъектXDTO);
		Если ОбъектДО.Модифицированность() Тогда
			ОбъектДО.Записать();
		КонецЕсли;
		Возврат СсылкаДО;
	КонецЕсли;
		
	// переопределяемый поиск
	СсылкаДО = ОбработкаЗапросовXDTOПереопределяемый.НайтиСоответствиеДляВнешнегоОбъекта(ОбъектXDTO);
	
	// стандартный поиск
	Если Не ЗначениеЗаполнено(СсылкаДО) Тогда 
		
		Наименование = "";
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Наименование, ОбъектXDTO, "name");
		СсылкаДО = Справочники.СпособыДоставки.НайтиПоНаименованию(Наименование, Истина);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СсылкаДО) Тогда 
		ОбъектДО = СсылкаДО.ПолучитьОбъект();
	Иначе	
		ОбъектДО = Справочники.СпособыДоставки.СоздатьЭлемент();
		УстановитьСсылкуНовогоДляСправочника(ОбъектДО, ОбъектXDTO);
	КонецЕсли;	
	ОбъектДО.Заблокировать();
	ЗаполнитьДанныеСпособаДоставки(Узел, ОбъектДО, ОбъектXDTO);
	Если ОбъектДО.Модифицированность() Тогда
		ОбъектДО.Записать();
	КонецЕсли;
	
	Возврат ОбъектДО.Ссылка;
	
КонецФункции

// Находит подходящую или создает новую папку внутренних документов по объекту XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   ОбъектXDTO - ОбъектXDTO типа DMInternalDocumentFolder
//
// Возвращаемое значение:
//   СправочникСсылка.ПапкиВнутреннихДокументов - найденный или созданный элемент справочника
//
Функция НайтиСоздатьПапкуВнутреннихДокументов(Узел, ОбъектXDTO) Экспорт
	
	ВнешнийID = ОбъектXDTO.externalObject.id;
	ВнешнийТип = ОбъектXDTO.externalObject.type;
	СсылкаДО = Неопределено;
	
	// синхронизация по наименованию
	Если Не ЗначениеЗаполнено(ВнешнийID) Тогда 
		
		Наименование = Неопределено;
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Наименование, ОбъектXDTO, "name");
		СсылкаДО = Справочники.ПапкиВнутреннихДокументов.НайтиПоНаименованию(Наименование, Истина); 
		Если Не ЗначениеЗаполнено(СсылкаДО) Тогда 
			ОбъектДО = Справочники.ПапкиВнутреннихДокументов.СоздатьЭлемент();
			ОбъектДО.Наименование = Наименование;
			ОбъектДО.Записать();
			СсылкаДО = ОбъектДО.Ссылка;
		КонецЕсли;
		
		Возврат СсылкаДО;
	КонецЕсли;
	
	СсылкаДО = СправочникСсылкаПоИдентификаторуВнешнегоОбъекта(Узел, ОбъектXDTO, "ПапкиВнутреннихДокументов");
	Если СсылкаДО <> Неопределено Тогда
		ОбъектДО = СсылкаДО.ПолучитьОбъект();
		ОбъектДО.Заблокировать();
		ЗаполнитьДанныеПапкиВнутреннихДокументов(Узел, ОбъектДО, ОбъектXDTO);
		Если ОбъектДО.Модифицированность() Тогда
			ОбъектДО.Записать();
		КонецЕсли;
		Возврат СсылкаДО;
	КонецЕсли;
	
	// переопределяемый поиск
	СсылкаДО = ОбработкаЗапросовXDTOПереопределяемый.НайтиСоответствиеДляВнешнегоОбъекта(ОбъектXDTO);
	
	// стандартный поиск
	Если Не ЗначениеЗаполнено(СсылкаДО) Тогда 
		
		Наименование = "";
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Наименование, ОбъектXDTO, "name");
		СсылкаДО = Справочники.ПапкиВнутреннихДокументов.НайтиПоНаименованию(Наименование, Истина);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СсылкаДО) Тогда 
		ОбъектДО = СсылкаДО.ПолучитьОбъект();
	Иначе	
		ОбъектДО = Справочники.ПапкиВнутреннихДокументов.СоздатьЭлемент();
		УстановитьСсылкуНовогоДляСправочника(ОбъектДО, ОбъектXDTO);
	КонецЕсли;	
	ОбъектДО.Заблокировать();
	ЗаполнитьДанныеПапкиВнутреннихДокументов(Узел, ОбъектДО, ОбъектXDTO);
	Если ОбъектДО.Модифицированность() Тогда
		ОбъектДО.Записать();
	КонецЕсли;
	
	Возврат ОбъектДО.Ссылка;
	
КонецФункции

// Находит подходящий или создает новый проект по объекту XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   ОбъектXDTO - ОбъектXDTO типа DMProject
//
// Возвращаемое значение:
//   СправочникСсылка.Проекты - найденный или созданный элемент справочника
//
Функция НайтиСоздатьПроект(Узел, ОбъектXDTO) Экспорт
	
	ВнешнийID = ОбъектXDTO.externalObject.id;
	ВнешнийТип = ОбъектXDTO.externalObject.type;
	СсылкаДО = Неопределено;
	
	// синхронизация по наименованию
	Если Не ЗначениеЗаполнено(ВнешнийID) Тогда 
		
		Наименование = Неопределено;
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Наименование, ОбъектXDTO, "name");
		СсылкаДО = Справочники.Проекты.НайтиПоНаименованию(Наименование, Истина); 
		Если Не ЗначениеЗаполнено(СсылкаДО) Тогда 
			ОбъектДО = Справочники.Проекты.СоздатьЭлемент();
			ОбъектДО.Наименование = Наименование;
			ОбъектДО.Записать();
			СсылкаДО = ОбъектДО.Ссылка;
		КонецЕсли;
		
		Возврат СсылкаДО;
	КонецЕсли;
	
	СсылкаДО = СправочникСсылкаПоИдентификаторуВнешнегоОбъекта(Узел, ОбъектXDTO, "Проекты");
	Если СсылкаДО <> Неопределено Тогда
		ОбъектДО = СсылкаДО.ПолучитьОбъект();
		ОбъектДО.Заблокировать();
		ЗаполнитьДанныеПроекта(Узел, ОбъектДО, ОбъектXDTO);
		Если ОбъектДО.Модифицированность() Тогда
			ОбъектДО.Записать();
		КонецЕсли;
		Возврат СсылкаДО;
	КонецЕсли;
		
	// переопределяемый поиск
	СсылкаДО = ОбработкаЗапросовXDTOПереопределяемый.НайтиСоответствиеДляВнешнегоОбъекта(ОбъектXDTO);
	
	// стандартный поиск
	Если Не ЗначениеЗаполнено(СсылкаДО) Тогда 
		
		Наименование = "";
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, Наименование, ОбъектXDTO, "name");
		СсылкаДО = Справочники.Проекты.НайтиПоНаименованию(Наименование, Истина);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СсылкаДО) Тогда 
		ОбъектДО = СсылкаДО.ПолучитьОбъект();
	Иначе	
		ОбъектДО = Справочники.Проекты.СоздатьЭлемент();
		УстановитьСсылкуНовогоДляСправочника(ОбъектДО, ОбъектXDTO);
	КонецЕсли;	
	ОбъектДО.Заблокировать();
	ЗаполнитьДанныеПроекта(Узел, ОбъектДО, ОбъектXDTO);
	Если ОбъектДО.Модифицированность() Тогда
		ОбъектДО.Записать();
	КонецЕсли;
	
	Возврат ОбъектДО.Ссылка;
	
КонецФункции

#КонецОбласти

#Область СвязиДокументов

// Создает связь документов по переданному сообщению
//
// Параметры:
//   Сообщение - ОбъектXDTO типа DMAddDocumentRelationRequest
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMAddDocumentRelationResponse или DMError
//
Функция СоздатьСвязьДокументов(Сообщение) Экспорт 
	
	Попытка 
		
		Документ = ОбработкаЗапросовXDTO.ПолучитьСсылкуПоObjectID(Сообщение.relation.document.objectId);
		ТипСвязи = ОбработкаЗапросовXDTO.ПолучитьСсылкуПоObjectID(Сообщение.relation.relationType.objectId);
		СвязанныйДокумент = ОбработкаЗапросовXDTO.ПолучитьСсылкуПоObjectID(Сообщение.relation.relatedDocument.objectId);
		
		СвязиДокументов.СоздатьСвязь(Документ, СвязанныйДокумент, ТипСвязи);
		
		Возврат ОбработкаЗапросовXDTO.СоздатьОбъект("DMAddDocumentRelationResponse");
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при создании связи документов'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;	
	
КонецФункции

// Удаляет связь документов по переданному сообщению
//
// Параметры:
//   Сообщение - ОбъектXDTO типа DMRemoveDocumentRelationRequest
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMRemoveDocumentRelationResponse или DMError
//
Функция УдалитьСвязьДокументов(Сообщение) Экспорт 
	
	Попытка 
		
		Документ = ОбработкаЗапросовXDTO.ПолучитьСсылкуПоObjectID(Сообщение.relation.document.objectId);
		ТипСвязи = ОбработкаЗапросовXDTO.ПолучитьСсылкуПоObjectID(Сообщение.relation.relationType.objectId);
		СвязанныйДокумент = ОбработкаЗапросовXDTO.ПолучитьСсылкуПоObjectID(Сообщение.relation.relatedDocument.objectId);
		
		СвязиДокументов.УдалитьСвязь(Документ, СвязанныйДокумент, ТипСвязи);
		
		Возврат ОбработкаЗапросовXDTO.СоздатьОбъект("DMRemoveDocumentRelationResponse");
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при удалении связи документов'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;	
	
КонецФункции

#КонецОбласти

#Область ОбщиеПроцедуры

// Возвращает значения реквизитов, назначаемых по умолчанию видом документа
//
// Параметры:
//   Сообщение - ОбъектXDTO типа DMGetDefaultValuesByDocumentTypeRequest
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMGetDefaultValuesByDocumentTypeResponse или DMError
//
Функция ЗначенияРеквизитовПоУмолчанию(Сообщение) Экспорт
	
	Попытка 
		
		ВидДокумента = ОбработкаЗапросовXDTO.ПолучитьСсылкуПоObjectID(Сообщение.documentTypeId);
		
		Если ТипЗнч(ВидДокумента) = Тип("СправочникСсылка.ВидыВнутреннихДокументов") Тогда
			ЗначенияПоУмолчанию = ОбработкаЗапросовXDTO.СоздатьОбъект("DMInternalDocument");
			ИмяОбъекта = "ВнутренниеДокументы";
			ХранитсяВПапках = Истина;
		ИначеЕсли ТипЗнч(ВидДокумента) = Тип("СправочникСсылка.ВидыВходящихДокументов") Тогда
			ЗначенияПоУмолчанию = ОбработкаЗапросовXDTO.СоздатьОбъект("DMIncomingDocument");
			ИмяОбъекта = "ВходящиеДокументы";
			ХранитсяВПапках = Ложь;
		ИначеЕсли ТипЗнч(ВидДокумента) = Тип("СправочникСсылка.ВидыИсходящихДокументов") Тогда
			ЗначенияПоУмолчанию = ОбработкаЗапросовXDTO.СоздатьОбъект("DMInternalDocument");
			ИмяОбъекта = "ИсходящиеДокументы";
			ХранитсяВПапках = Ложь;
		КонецЕсли;
		
		Объект = Справочники[ИмяОбъекта].СоздатьЭлемент();
		Узел = ОбработкаЗапросовXDTO.УзелИнтегрированнойСистемы(Сообщение);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|" + ?(ХранитсяВПапках, "	Папка,", "") + "
		|	ГрифДоступа,
		|	ВопросДеятельности,
		|	Проект,
		|	1 КАК Количество
		|ИЗ
		|	Справочник.%1 КАК Документы
		|ГДЕ
		|	ВидДокумента = &ВидДокумента
		|	И ПометкаУдаления = Ложь";
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%1", ИмяОбъекта);
		
		Запрос.УстановитьПараметр("ВидДокумента", ВидДокумента);
		
		Результат = Запрос.Выполнить().Выгрузить();
		
		Если Результат.Количество() > 0 Тогда
			Для Каждого Колонка Из Результат.Колонки Цикл
				Если Колонка.Имя <> "Количество" Тогда
					ЗначенияРеквизита = Результат.Скопировать(,Колонка.Имя + ", Количество");
					ЗначенияРеквизита.Свернуть(Колонка.Имя, "Количество");
					ЗначенияРеквизита.Сортировать("Количество УБЫВ");
					Объект[Колонка.Имя] = ЗначенияРеквизита[0][Колонка.Имя];
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если ТипЗнч(ВидДокумента) = Тип("СправочникСсылка.ВидыВнутреннихДокументов") Тогда
			ПолучитьДанныеВнутреннегоДокумента(Узел, Объект, ЗначенияПоУмолчанию);
		ИначеЕсли ТипЗнч(ВидДокумента) = Тип("СправочникСсылка.ВидыВходящихДокументов") Тогда
			ПолучитьДанныеВходящегоДокумента(Узел, Объект, ЗначенияПоУмолчанию);
		ИначеЕсли ТипЗнч(ВидДокумента) = Тип("СправочникСсылка.ВидыИсходящихДокументов") Тогда
			ПолучитьДанныеИсходящегоДокумента(Узел, Объект, ЗначенияПоУмолчанию);
		КонецЕсли;
		
		Ответ = ОбработкаЗапросовXDTO.СоздатьОбъект("DMGetDefaultValuesByDocumentTypeResponse");
		Ответ.object = ЗначенияПоУмолчанию;
		
		Возврат Ответ;
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при получении данных'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;
	
КонецФункции

// Регистрирует документ согласно сообщению
//
// Параметры:
//   Сообщение - ОбъектXDTO типа DMDocumentRegistrationRequest
//
// Возвращаемое значение:
//   ОбъектXDTO типа DMDocumentRegistrationResponse или DMError
//
Функция ЗарегистрироватьДокумент(Сообщение) Экспорт 
	
	Попытка 
		Ссылка = ОбработкаЗапросовXDTO.ПолучитьСсылкуПоObjectID(Сообщение.document.objectId);
		Документ = Ссылка.ПолучитьОбъект();
		Узел = ОбработкаЗапросовXDTO.УзелИнтегрированнойСистемы(Сообщение);
		
		Если РольДоступна("ПолныеПрава") Тогда 
			РольДелопроизводитель = Истина;
	    ИначеЕсли ТипЗнч(Документ.Ссылка) = Тип("СправочникСсылка.ВходящиеДокументы") Тогда 
			РольДелопроизводитель = РольДоступна("ДобавлениеИзменениеВходящихДокументов");
		ИначеЕсли ТипЗнч(Документ.Ссылка) = Тип("СправочникСсылка.ИсходящиеДокументы") Тогда 
			РольДелопроизводитель = РольДоступна("РегистрацияИсходящихДокументов");
		ИначеЕсли ТипЗнч(Документ.Ссылка) = Тип("СправочникСсылка.ВнутренниеДокументы") Тогда 
			РольДелопроизводитель = РольДоступна("РегистрацияВнутреннихДокументов");
		КонецЕсли;
		Если Не РольДелопроизводитель Тогда 
			Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
			Ошибка.subject = НСтр("ru = 'Ошибка при регистрации документа'");
			Инфо = ИнформацияОбОшибке();
			Ошибка.description = НСтр("ru = 'У вас нет прав на регистрацию документа'");
			Возврат Ошибка;
		КонецЕсли;	
		
		ВидДокумента = Документ.ВидДокумента;
		Если Не ЗначениеЗаполнено(ВидДокумента) Тогда 
			Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
			Ошибка.subject = НСтр("ru = 'Ошибка при регистрации документа'");
			Инфо = ИнформацияОбОшибке();
			Ошибка.description = НСтр("ru = 'Поле ""Вид документа"" не заполнено'");
			Возврат Ошибка;
		КонецЕсли;
		
		Попытка // в отсутствие подходящего нумератора будет выброшено исключение
			Нумератор = Нумерация.ПолучитьНумераторДокумента(Документ);
		Исключение
			Нумератор = Неопределено;
		КонецПопытки;
		Если Не ЗначениеЗаполнено(Нумератор) Тогда 
			Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
			Ошибка.subject = НСтр("ru = 'Ошибка при регистрации документа'");
			Инфо = ИнформацияОбОшибке();
			Ошибка.description = НСтр("ru = 'Документ регистрируется вручную. Укажите номер и запишите документ.'");
			Возврат Ошибка;
		КонецЕсли;
		
		Документ.Заблокировать();
		Документ.ДатаРегистрации = ТекущаяДатаСеанса();
		Документ.Зарегистрировал = ПользователиКлиентСервер.ТекущийПользователь();
		
		// числовой номер
		СтруктураПараметров = НумерацияКлиентСервер.ПолучитьПараметрыНумерации(Документ);
		Нумерация.СформироватьЧисловойНомерДокумента(СтруктураПараметров, Документ.ЧисловойНомер);
		
		// строковый номер
		ОписанияОшибок = Новый СписокЗначений;
		СтруктураПараметров = НумерацияКлиентСервер.ПолучитьПараметрыНумерации(Документ);
		Нумерация.СформироватьСтроковыйНомерДокумента(СтруктураПараметров, Документ.РегистрационныйНомер, ОписанияОшибок);
		
		// проверим заполнение
		ТекстСообщения = "";
		Если Не ОбработкаЗапросовXDTO.ПроверитьЗаполнение(Документ, ТекстСообщения) Тогда 
			Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
			Ошибка.subject = НСтр("ru = 'Ошибка при регистрации документа'");
			Ошибка.description = ТекстСообщения;
			Возврат Ошибка;
		КонецЕсли;	
		
		Документ.Записать();
		
		// состояние 
		СостояниеДокумента = Перечисления.СостоянияДокументов.Зарегистрирован;
		Делопроизводство.ЗаписатьСостояниеДокумента(
			Документ.Ссылка, 
			Документ.ДатаРегистрации, 
			СостояниеДокумента, 
			Документ.Зарегистрировал);
			
			
		НаборКолонок = Новый Массив;
		НаборКолонок.Добавить("regDate");
		НаборКолонок.Добавить("regNumber");
		НаборКолонок.Добавить("status");
		НаборКолонок.Добавить("enabledProperties");
		
		Если ТипЗнч(Документ.Ссылка) = Тип("СправочникСсылка.ВходящиеДокументы") Тогда
			Результат = ОбработкаЗапросовXDTO.СоздатьОбъект("DMIncomingDocument");
			ПолучитьДанныеВходящегоДокумента(Узел, Документ, Результат, НаборКолонок);
		ИначеЕсли ТипЗнч(Документ.Ссылка) = Тип("СправочникСсылка.ИсходящиеДокументы") Тогда
			Результат = ОбработкаЗапросовXDTO.СоздатьОбъект("DMOutgoingDocument");
			ПолучитьДанныеИсходящегоДокумента(Узел, Документ, Результат, НаборКолонок);
		ИначеЕсли ТипЗнч(Документ.Ссылка) = Тип("СправочникСсылка.ВнутренниеДокументы") Тогда
			Результат = ОбработкаЗапросовXDTO.СоздатьОбъект("DMInternalDocument");
			ПолучитьДанныеВнутреннегоДокумента(Узел, Документ, Результат, НаборКолонок);
		КонецЕсли;	
		
		Ответ = ОбработкаЗапросовXDTO.СоздатьОбъект("DMDocumentRegistrationResponse");
		Ответ.document = Результат;
		Возврат Ответ;	
			
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при регистрации документа'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;	
	
КонецФункции	

// Получает заполненные объекты XDTO по списку
//
// Параметры:
//   Сообщение - ОбъектXDTO типа DMGetDocumentListRequest 
//
// Возвращаемое значение:
//    ОбъектXDTO типа DMGetDocumentListResponse или DMError
//
Функция ПолучитьДокументы(Сообщение) Экспорт 
	
	Попытка
		
		Ответ = ОбработкаЗапросовXDTO.СоздатьОбъект("DMGetDocumentListResponse");
		
		Если Сообщение.externalObjects.Количество() = 1 Тогда 
			ВнешнийОбъект = Сообщение.externalObjects.Получить(0);
			
			Узел = ОбработкаЗапросовXDTO.УзелИнтегрированнойСистемы(Сообщение);
			
			УстановитьПривилегированныйРежим(Истина);
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	СсылкаНаОбъектДО,
			|	УзелИнтегрированнойСистемы,
			|	ТипВнешнегоОбъекта,
			|	ИСТИНА КАК СвязиОбъектовИнтегрированныхСистем
			|ИЗ
			|	РегистрСведений.СвязиОбъектовИнтегрированныхСистем КАК СвязиОбъектовИнтегрированныхСистем
			|ГДЕ
			|	СвязиОбъектовИнтегрированныхСистем.УзелИнтегрированнойСистемы В(&УзлыИнтегрируемойСистемы)
			|	И ИДВнешнегоОбъекта = &ИДВнешнегоОбъекта
			|	И (ТипВнешнегоОбъекта = &ТипВнешнегоОбъекта
			|			ИЛИ СвязиОбъектовИнтегрированныхСистем.ТипВнешнегоОбъекта = """")
			|	И (ТИПЗНАЧЕНИЯ(СсылкаНаОбъектДО) = ТИП(Справочник.ВходящиеДокументы)
			|			ИЛИ ТИПЗНАЧЕНИЯ(СсылкаНаОбъектДО) = ТИП(Справочник.ИсходящиеДокументы)
			|			ИЛИ ТИПЗНАЧЕНИЯ(СсылкаНаОбъектДО) = ТИП(Справочник.ВнутренниеДокументы)
			|			ИЛИ ТИПЗНАЧЕНИЯ(СсылкаНаОбъектДО) = ТИП(Справочник.Корреспонденты)
			|			ИЛИ ТИПЗНАЧЕНИЯ(СсылкаНаОбъектДО) = ТИП(Справочник.Организации)
			|			ИЛИ ТИПЗНАЧЕНИЯ(СсылкаНаОбъектДО) = ТИП(Справочник.Валюты)
			|			ИЛИ ТИПЗНАЧЕНИЯ(СсылкаНаОбъектДО) = ТИП(Справочник.СтруктураПредприятия)
			|	)
			|	И НЕ СсылкаНаОбъектДО.ПометкаУдаления
			|	И СсылкаНаОбъектДО <> ЗНАЧЕНИЕ(Справочник.Корреспонденты.ПустаяСсылка)
			|	И СсылкаНаОбъектДО <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
			|	И СсылкаНаОбъектДО <> ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
			|	И СсылкаНаОбъектДО <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
			|	И СсылкаНаОбъектДО <> ЗНАЧЕНИЕ(Справочник.ВходящиеДокументы.ПустаяСсылка)
			|	И СсылкаНаОбъектДО <> ЗНАЧЕНИЕ(Справочник.ИсходящиеДокументы.ПустаяСсылка)
			|	И СсылкаНаОбъектДО <> ЗНАЧЕНИЕ(Справочник.ВнутренниеДокументы.ПустаяСсылка)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	УникальныйИдентификаторИсточника,
			|	Неопределено,
			|	ТипПриемника,
			|	ЛОЖЬ
			|ИЗ
			|	РегистрСведений.СоответствияОбъектовИнформационныхБаз
			|ГДЕ
			|	УникальныйИдентификаторПриемника = &ИДВнешнегоОбъекта
			|	И (ТипПриемника = &ТипПриемника)
			|	И (ТИПЗНАЧЕНИЯ(УникальныйИдентификаторИсточника) = ТИП(Справочник.ВходящиеДокументы)
			|			ИЛИ ТИПЗНАЧЕНИЯ(УникальныйИдентификаторИсточника) = ТИП(Справочник.ИсходящиеДокументы)
			|			ИЛИ ТИПЗНАЧЕНИЯ(УникальныйИдентификаторИсточника) = ТИП(Справочник.ВнутренниеДокументы)
			|			ИЛИ ТИПЗНАЧЕНИЯ(УникальныйИдентификаторИсточника) = ТИП(Справочник.Корреспонденты)
			|			ИЛИ ТИПЗНАЧЕНИЯ(УникальныйИдентификаторИсточника) = ТИП(Справочник.Организации)
			|			ИЛИ ТИПЗНАЧЕНИЯ(УникальныйИдентификаторИсточника) = ТИП(Справочник.Валюты)
			|			ИЛИ ТИПЗНАЧЕНИЯ(УникальныйИдентификаторИсточника) = ТИП(Справочник.СтруктураПредприятия)
			|	)
			|";
			
			Узлы = Новый Массив;
			Узлы.Добавить(Узел);
			Узлы.Добавить(ПланыОбмена.ИнтегрированныеСистемы.ПустаяСсылка());
			Запрос.УстановитьПараметр("УзлыИнтегрируемойСистемы", Узлы);
			
			Запрос.УстановитьПараметр("ИДВнешнегоОбъекта", ВнешнийОбъект.ID);
			Запрос.УстановитьПараметр("ТипВнешнегоОбъекта", ВнешнийОбъект.type);
			// Пока в интеграции участвуют только документы и справочники.
			ТипПриемника = ВнешнийОбъект.type;
			ТипПриемника = СтрЗаменить(ТипПриемника, "Документ.", "ДокументСсылка.");
			ТипПриемника = СтрЗаменить(ТипПриемника, "Справочник.", "СправочникСсылка.");
			Запрос.УстановитьПараметр("ТипПриемника", ТипПриемника);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			УстановитьПривилегированныйРежим(Ложь);
			
			Если Выборка.Следующий() Тогда 
				СсылкаНаОбъектДО = Выборка.СсылкаНаОбъектДО;
				
				Если (Не ЗначениеЗаполнено(Выборка.УзелИнтегрированнойСистемы) 
					Или Не ЗначениеЗаполнено(Выборка.ТипВнешнегоОбъекта))
					и Выборка.СвязиОбъектовИнтегрированныхСистем Тогда
					ОбработкаЗапросовXDTO.ИсправитьЗаписьСвязиОбъектов(
						СсылкаНаОбъектДО,
						Выборка.УзелИнтегрированнойСистемы,
						Выборка.ТипВнешнегоОбъекта,
						Узел,
						ВнешнийОбъект.type,
						ВнешнийОбъект.ID);
				КонецЕсли;
				
				Если ТипЗнч(СсылкаНаОбъектДО) = Тип("СправочникСсылка.ВходящиеДокументы") Тогда 
					Объект = ОбработкаЗапросовXDTO.СоздатьОбъект("DMIncomingDocument");
					
				ИначеЕсли ТипЗнч(СсылкаНаОбъектДО) = Тип("СправочникСсылка.ИсходящиеДокументы") Тогда 
					Объект = ОбработкаЗапросовXDTO.СоздатьОбъект("DMOutgoingDocument");
					
				ИначеЕсли ТипЗнч(СсылкаНаОбъектДО) = Тип("СправочникСсылка.ВнутренниеДокументы") Тогда 	
					Объект = ОбработкаЗапросовXDTO.СоздатьОбъект("DMInternalDocument");
					
				ИначеЕсли ТипЗнч(СсылкаНаОбъектДО) = Тип("СправочникСсылка.Корреспонденты") Тогда 	
					Объект = ОбработкаЗапросовXDTO.СоздатьОбъект("DMCorrespondent");
					
				ИначеЕсли ТипЗнч(СсылкаНаОбъектДО) = Тип("СправочникСсылка.Организации") Тогда 	
					Объект = ОбработкаЗапросовXDTO.СоздатьОбъект("DMOrganization");
					
				ИначеЕсли ТипЗнч(СсылкаНаОбъектДО) = Тип("СправочникСсылка.Валюты") Тогда 	
					Объект = ОбработкаЗапросовXDTO.СоздатьОбъект("DMCurrency");
					
				ИначеЕсли ТипЗнч(СсылкаНаОбъектДО) = Тип("СправочникСсылка.СтруктураПредприятия") Тогда 	
					Объект = ОбработкаЗапросовXDTO.СоздатьОбъект("DMSubdivision");
					
				ИначеЕсли ТипЗнч(СсылкаНаОбъектДО) = Тип("СправочникСсылка.СтатьиДвиженияДенежныхСредств") Тогда 	
					Объект = ОбработкаЗапросовXDTO.СоздатьОбъект("DMCashFlowItem");
					
				КонецЕсли;	
				
				МетаданныеОбъектаДО = СсылкаНаОбъектДО.Метаданные();
				Если Не ПравоДоступа("Чтение", МетаданныеОбъектаДО) Тогда 
					Объект.name = НСтр("ru = '<нет прав доступа для просмотра объекта>'");
					Объект.objectId = ОбработкаЗапросовXDTO.ПолучитьObjectIDПоСсылке(СсылкаНаОбъектДО);
					
				Иначе
					
					ЗапросДоступности = Новый Запрос;
					ЗапросДоступности.Текст = 
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ 
					|	Ссылка 
					|ИЗ
					|	" + МетаданныеОбъектаДО.ПолноеИмя() + " 
					|ГДЕ 
					|	Ссылка = &Ссылка";
					ЗапросДоступности.УстановитьПараметр("Ссылка", СсылкаНаОбъектДО);
					
					Если ЗапросДоступности.Выполнить().Пустой() Тогда 
						Объект.name = НСтр("ru = '<нет прав доступа для просмотра документа>'");
						Объект.objectId = ОбработкаЗапросовXDTO.ПолучитьObjectIDПоСсылке(СсылкаНаОбъектДО);
					Иначе	
						
						ОбъектДО = СсылкаНаОбъектДО.ПолучитьОбъект();
						Если ТипЗнч(СсылкаНаОбъектДО) = Тип("СправочникСсылка.ВходящиеДокументы") Тогда 
							
							ПолучитьДанныеВходящегоДокумента(Узел, ОбъектДО, Объект, Сообщение.columnSet);
							
						ИначеЕсли ТипЗнч(СсылкаНаОбъектДО) = Тип("СправочникСсылка.ИсходящиеДокументы") Тогда 
							
							ПолучитьДанныеИсходящегоДокумента(Узел, ОбъектДО, Объект, Сообщение.columnSet);
							
						ИначеЕсли ТипЗнч(СсылкаНаОбъектДО) = Тип("СправочникСсылка.ВнутренниеДокументы") Тогда 
							
							ПолучитьДанныеВнутреннегоДокумента(Узел, ОбъектДО, Объект, Сообщение.columnSet);
							
						ИначеЕсли ТипЗнч(СсылкаНаОбъектДО) = Тип("СправочникСсылка.Корреспонденты") Тогда 
							
							ПолучитьДанныеКорреспондента(Узел, ОбъектДО, Объект, Сообщение.columnSet);
							
						ИначеЕсли ТипЗнч(СсылкаНаОбъектДО) = Тип("СправочникСсылка.Организации") Тогда 
							
							ПолучитьДанныеОрганизации(ОбъектДО, Объект, Сообщение.columnSet);
							
						ИначеЕсли ТипЗнч(СсылкаНаОбъектДО) = Тип("СправочникСсылка.Валюты") Тогда 
							
							ПолучитьДанныеВалюты(ОбъектДО, Объект, Сообщение.columnSet);
							
						ИначеЕсли ТипЗнч(СсылкаНаОбъектДО) = Тип("СправочникСсылка.СтруктураПредприятия") Тогда 
							
							ПолучитьДанныеПодразделения(ОбъектДО, Объект, Сообщение.columnSet);
							
						ИначеЕсли ТипЗнч(СсылкаНаОбъектДО) = Тип("СправочникСсылка.СтатьиДвиженияДенежныхСредств") Тогда 
							
							ПолучитьДанныеСтатьиДвиженияДенежныхСредств(ОбъектДО, Объект, Сообщение.columnSet);
							
						КонецЕсли;	
						
					КонецЕсли;
				КонецЕсли;
				
				Ответ.documents.Добавить(Объект);
				
			КонецЕсли;
			
		Иначе
			Для Каждого ВнешнийОбъект Из Сообщение.ExternalObjects Цикл
				
				ОбъектыДО = ОбработкаЗапросовXDTO.ПолучитьОбъектыДОПоВнешнемуОбъекту(
					Узел, ВнешнийОбъект.ID,ВнешнийОбъект.type);
					
				Для Каждого ОбъектДО Из ОбъектыДО Цикл
					
					Если Не ЗначениеЗаполнено(ОбъектДО) Тогда 
						Продолжить;
						
					ИначеЕсли ТипЗнч(ОбъектДО) = Тип("СправочникСсылка.ВходящиеДокументы") Тогда 
						
						Объект = ОбработкаЗапросовXDTO.СоздатьОбъект("DMIncomingDocument");
						ПолучитьДанныеВходящегоДокумента(Узел, ОбъектДО, Объект, Сообщение.columnSet);
						
					ИначеЕсли ТипЗнч(ОбъектДО) = Тип("СправочникСсылка.ИсходящиеДокументы") Тогда 
						
						Объект = ОбработкаЗапросовXDTO.СоздатьОбъект("DMOutgoingDocument");
						ПолучитьДанныеИсходящегоДокумента(Узел, ОбъектДО, Объект, Сообщение.columnSet);
						
					ИначеЕсли ТипЗнч(ОбъектДО) = Тип("СправочникСсылка.ВнутренниеДокументы") Тогда 
						
						Объект = ОбработкаЗапросовXDTO.СоздатьОбъект("DMInternalDocument");
						ПолучитьДанныеВнутреннегоДокумента(Узел, ОбъектДО, Объект, Сообщение.columnSet);
						
					ИначеЕсли ТипЗнч(ОбъектДО) = Тип("СправочникСсылка.Корреспонденты") Тогда 
						
						Объект = ОбработкаЗапросовXDTO.СоздатьОбъект("DMInternalDocument");
						ПолучитьДанныеКорреспондента(Узел, ОбъектДО, Объект, Сообщение.columnSet);
					Иначе	
						Продолжить;
					КонецЕсли;
					
					Ответ.documents.Добавить(Объект);
					
				КонецЦикла;
				
			КонецЦикла;	
			
		КонецЕсли;
		
		Возврат Ответ;
		
	Исключение
		
		Ошибка = ОбработкаЗапросовXDTO.СоздатьОбъект("DMError");
		Ошибка.subject = НСтр("ru = 'Ошибка при получении списка объектов'");
		Инфо = ИнформацияОбОшибке();
		Ошибка.description = ОбработкаЗапросовXDTO.ПолучитьОписаниеОшибки(Инфо);
		Возврат Ошибка;
		
	КонецПопытки;	
	
КонецФункции	

// Получает массив связей документа
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   Ссылка - ЛюбаяСсылка - документ, чьи связи нужно определить
//
// Возвращаемое значение:
//    Массив - массив объектов DMDocumentRelation, описывающих связь
//
Функция ПолучитьСвязанныеДокументы(Узел, Ссылка) Экспорт 
	
	Связи = Новый Массив;
	НаборКолонок = Новый Массив;
	НаборКолонок.Добавить("title");
	НаборКолонок.Добавить("regNumber");
	НаборКолонок.Добавить("regDate");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СвязиДокументов.Документ,
	|	СвязиДокументов.ТипСвязи,
	|	СвязиДокументов.СвязанныйДокумент,
	|	СвязиДокументов.Комментарий,
	|	СвязиДокументов.Установил,
	|	СвязиДокументов.ДатаУстановки
	|ИЗ
	|	РегистрСведений.СвязиДокументов КАК СвязиДокументов
	|ГДЕ
	|	СвязиДокументов.Документ = &Документ";
	
	Запрос.УстановитьПараметр("Документ", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Связь = ОбработкаЗапросовXDTO.СоздатьОбъект("DMDocumentRelation");
		
		Если ТипЗнч(Выборка.Документ) = Тип("СправочникСсылка.ВходящиеДокументы") Тогда 
			
			Документ = ОбработкаЗапросовXDTO.СоздатьОбъект("DMIncomingDocument");
			ПолучитьДанныеВходящегоДокумента(Узел, Выборка.Документ, Документ, НаборКолонок);
			
		ИначеЕсли ТипЗнч(Выборка.Документ) = Тип("СправочникСсылка.ИсходящиеДокументы") Тогда 
			
			Документ = ОбработкаЗапросовXDTO.СоздатьОбъект("DMOutgoingDocument");
			ПолучитьДанныеИсходящегоДокумента(Узел, Выборка.Документ, Документ, НаборКолонок);
			
		ИначеЕсли ТипЗнч(Выборка.Документ) = Тип("СправочникСсылка.ВнутренниеДокументы") Тогда 
			
			Документ = ОбработкаЗапросовXDTO.СоздатьОбъект("DMInternalDocument");
			ПолучитьДанныеВнутреннегоДокумента(Узел, Выборка.Документ, Документ, НаборКолонок);
			
		КонецЕсли;
		Связь.document = Документ;
		
		ТипСвязи = ОбработкаЗапросовXDTO.СоздатьОбъект("DMRelationType");
		ТипСвязи.name = Строка(Выборка.ТипСвязи);
		ТипСвязи.objectId = ОбработкаЗапросовXDTO.ПолучитьObjectIDПоСсылке(Выборка.ТипСвязи);
		Связь.relationType = ТипСвязи;
		
		Если ТипЗнч(Выборка.СвязанныйДокумент) = Тип("СправочникСсылка.ВходящиеДокументы") И Не Выборка.СвязанныйДокумент.ПометкаУдаления Тогда 
			
			СвязанныйДокумент = ОбработкаЗапросовXDTO.СоздатьОбъект("DMIncomingDocument");
			ПолучитьДанныеВходящегоДокумента(Узел, Выборка.СвязанныйДокумент, СвязанныйДокумент, НаборКолонок);
			
		ИначеЕсли ТипЗнч(Выборка.СвязанныйДокумент) = Тип("СправочникСсылка.ИсходящиеДокументы") И Не Выборка.СвязанныйДокумент.ПометкаУдаления Тогда 
			
			СвязанныйДокумент = ОбработкаЗапросовXDTO.СоздатьОбъект("DMOutgoingDocument");
			ПолучитьДанныеИсходящегоДокумента(Узел, Выборка.СвязанныйДокумент, СвязанныйДокумент, НаборКолонок);
			
		ИначеЕсли ТипЗнч(Выборка.СвязанныйДокумент) = Тип("СправочникСсылка.ВнутренниеДокументы") И Не Выборка.СвязанныйДокумент.ПометкаУдаления Тогда 
			
			СвязанныйДокумент = ОбработкаЗапросовXDTO.СоздатьОбъект("DMInternalDocument");
			ПолучитьДанныеВнутреннегоДокумента(Узел, Выборка.СвязанныйДокумент, СвязанныйДокумент, НаборКолонок);
			
		Иначе	
			Продолжить;
		КонецЕсли;
		
		Связь.relatedDocument = СвязанныйДокумент;
		Связи.Добавить(Связь);
		
	КонецЦикла;
	
	Возврат Связи;
	
КонецФункции

// Получает структуру полей, доступных к изменению в указанном состоянии
//
// Параметры:
//   Документ - СправочникОбъект.<...>Документы
//   Состояние - ПеречислениеСсылка.СостоянияДокументов
//
// Возвращаемое значение:
//   Структура, ключами которой являются имена изменяемых реквизитов
//
Функция ПолучитьДоступностьПолейПоСостоянию(Документ, Состояние)
	
	ДоступныеПоля = "";
	
	Если Не Константы.ИспользоватьСостоянияДокументов.Получить() Тогда 
		Возврат ДоступныеПоля;
	КонецЕсли;
	
	Если Не Константы.ОграничиватьДоступностьПолейПоСостоянию.Получить() Тогда 
		Возврат ДоступныеПоля;
	КонецЕсли;
		
	Если РольДоступна("ПолныеПрава") Тогда 
		Возврат ДоступныеПоля;
	КонецЕсли;
	
	ДоступныеПоля = Новый Структура;
	
	ДоступныеПоля.Вставить("openFile");
	ДоступныеПоля.Вставить("externalObject");
	
	Если Константы.РазрешитьРучноеИзменениеСостоянияДокументов.Получить()
		Или Не Константы.ИспользоватьБизнесПроцессыИЗадачи.Получить() Тогда
		ДоступныеПоля.Вставить("status");
	КонецЕсли;
	
	ДоступныеПоля.Вставить("statusApproval");
	ДоступныеПоля.Вставить("statusConfirmation");
	ДоступныеПоля.Вставить("statusRegistration");
	ДоступныеПоля.Вставить("statusConsideration");
	ДоступныеПоля.Вставить("statusPerformance");
	
	ИменаДоступныхПолей = Новый Массив;
	ИменаНедоступныхПолей = Новый Массив;
	Делопроизводство.ПолучитьДоступныеИНедоступныеПоСостояниюПоля(
		Документ, ИменаДоступныхПолей, ИменаНедоступныхПолей);
	
	Если ТипЗнч(Документ) = Тип("СправочникОбъект.ВходящиеДокументы") Тогда 
		ТипДокумента = Перечисления.ТипыОбъектов.ВходящиеДокументы;
	ИначеЕсли ТипЗнч(Документ) = Тип("СправочникОбъект.ИсходящиеДокументы") Тогда 
		ТипДокумента = Перечисления.ТипыОбъектов.ИсходящиеДокументы;
	ИначеЕсли ТипЗнч(Документ) = Тип("СправочникОбъект.ВнутренниеДокументы") Тогда 
		ТипДокумента = Перечисления.ТипыОбъектов.ВнутренниеДокументы;
	КонецЕсли;
	
	ИменаПолейИКоманд = 
		Делопроизводство.ПолучитьИменаПолейИКомандДляНастройкиДоступности(ТипДокумента);
	
	Для Каждого ИмяПоля Из ИменаДоступныхПолей Цикл
		НайденнаяСтрока = ИменаПолейИКоманд.Найти(ИмяПоля, "ИмяПоляКоманды");
		Если НайденнаяСтрока <> Неопределено Тогда
			СтруктураИмен = Новый Структура(НайденнаяСтрока.ИменаDMService);
			Для Каждого Элемент Из СтруктураИмен Цикл
				ДоступныеПоля.Вставить(Элемент.Ключ);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
		
	Возврат ДоступныеПоля;
	
КонецФункции

// Устарела, подлежит удалению.
//
Функция СоответствиеСвойствXDTOиПолейБазыДанных() Экспорт 
	
	СоответствиеРеквизитов = Новый Структура;

	СоответствиеРеквизитов.Вставить("Заголовок", "title");
	СоответствиеРеквизитов.Вставить("Содержание", "summary");
	
	Возврат СоответствиеРеквизитов;
	
КонецФункции	

// Возвращает массив имен колонок, описывающих файлы документа
//
Процедура ЗаполнитьКолонкиСпискаФайлов(НаборКолонокФайлов)
	
	НаборКолонокФайлов.Добавить("objectId");
	НаборКолонокФайлов.Добавить("signed");
	НаборКолонокФайлов.Добавить("name");
	НаборКолонокФайлов.Добавить("size");
	НаборКолонокФайлов.Добавить("creationDate");
	НаборКолонокФайлов.Добавить("modificationDateUniversal");
	НаборКолонокФайлов.Добавить("author");
	НаборКолонокФайлов.Добавить("extension");
	НаборКолонокФайлов.Добавить("description");
	НаборКолонокФайлов.Добавить("editing");
	НаборКолонокФайлов.Добавить("encrypted");
	НаборКолонокФайлов.Добавить("scannedOriginal");
	
	НаборКолонокФайлов.Добавить("signatures.author");
	НаборКолонокФайлов.Добавить("signatures.date");
	НаборКолонокФайлов.Добавить("signatures.comment");
	НаборКолонокФайлов.Добавить("signatures.signature");
	НаборКолонокФайлов.Добавить("signatures.thumbprint");
	НаборКолонокФайлов.Добавить("signatures.signer");
	НаборКолонокФайлов.Добавить("signatures.certificate");
	НаборКолонокФайлов.Добавить("signatures.signatureFileName");
	
КонецПроцедуры	

// Записывает файлы документа, обновляя их согласно переданному списку
//
// Параметры:
//   ДокументОбъект - СправочникОбъект.<...>Документ
//   ФайлыXDTO - СписокXDTO объектов типа DMFile
//
Процедура ЗаписатьДанныеФайлов(ДокументОбъект, ФайлыXDTO)
	
	Если ФайлыXDTO.Количество() <> 0 Тогда
	
		МассивПодчиненныхФайлов = РаботаСФайламиВызовСервера.ПолучитьВсеПодчиненныеФайлы(ДокументОбъект.Ссылка);
		
		Для Каждого ФайлXDTO Из ФайлыXDTO Цикл
			
			Ссылка = ОбработкаЗапросовXDTO.ПолучитьСсылкуПоObjectID(ФайлXDTO.objectId);
			Если ЗначениеЗаполнено(Ссылка) Тогда
				Если МассивПодчиненныхФайлов.Найти(Ссылка) = Неопределено Тогда // файл не найден
					
					ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку( 
						НСтр("ru = 'Файл ""%1"" не входит в число файлов документа'") +  """%2""", 
						ФайлXDTO.name, ДокументОбъект.Заголовок);
					
					ВызватьИсключение ТекстОшибки;
				КонецЕсли;
				ОбработкаЗапросовXDTOФайлы.ИзменитьФайл(ФайлXDTO);
			Иначе
				ФайлОбновлен = Ложь;
				Для каждого Файл Из МассивПодчиненныхФайлов Цикл
					Если Строка(Файл) = ФайлXDTO.name Тогда
						АдресВременногоХранилищаФайла = ПоместитьВоВременноеХранилище(ФайлXDTO.binaryData);
						АдресВременногоХранилищаТекста = "";
						
						Если ФайлXDTO.Установлено("text") Тогда
							АдресВременногоХранилищаТекста = Новый ХранилищеЗначения(ФайлXDTO.Text);
						КонецЕсли;
				
						РаботаСФайламиВызовСервера.СоздатьВерсиюИОбновитьВерсиюВФайле(
							ФайлXDTO.modificationDate,
							ФайлXDTO.modificationDateUniversal,
							Файл,
							ФайлXDTO.name,
							ФайлXDTO.size,
							ФайлXDTO.extension,
							АдресВременногоХранилищаФайла,
							АдресВременногоХранилищаТекста,
							Истина);
						ФайлОбновлен = Истина;
						Прервать;
					КонецЕсли; 
				КонецЦикла;
				Если Не ФайлОбновлен Тогда
					АдресВременногоХранилищаФайла = ПоместитьВоВременноеХранилище(ФайлXDTO.binaryData);
					АдресВременногоХранилищаТекста = "";
					
					Если ФайлXDTO.Установлено("text") Тогда
						АдресВременногоХранилищаТекста = Новый ХранилищеЗначения(ФайлXDTO.Text);
					КонецЕсли;
					
					ВебКлиент = Истина; // чтобы в регистр файлов в локальном кеше не вносить изменения
					
					ФайлСсылка = РаботаСФайламиВызовСервера.СоздатьФайлСВерсией(
						ДокументОбъект.Ссылка,
						ФайлXDTO.name,
						ФайлXDTO.extension,
						ФайлXDTO.modificationDate,
						ФайлXDTO.modificationDateUniversal,
						ФайлXDTO.size,
						АдресВременногоХранилищаФайла,
						АдресВременногоХранилищаТекста,
						ВебКлиент
						);
						
					Если ФайлXDTO.signatures.Количество() > 0 Тогда
						ОбработкаЗапросовXDTOФайлы.ЗанестиИнформациюОПодписяхОбъекта(ФайлXDTO.signatures, ФайлСсылка);
					КонецЕсли;
				КонецЕсли; 
			
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры	

#КонецОбласти

#Область ЭлектронныеПодписи

// Возвращает массив подписей документа
//
// Параметры:
//   ДокументСсылка - СправочникСсылка.<...>Документ
//
// Возвращаемое значение:
//   Массив - массив структур, описывающих подписи документа:
//     * КомуВыданСертификат - Строка - владелец сертификата
//     * ДатаПодписи - Дата - дата ЭП
//     * Комментарий - Строка - комментарий к подписи
//     * Объект - СправочникСсылка.<...>Документ - ДокументСсылка
//     * Отпечаток - Строка - отпечаток ЭП
//     * УстановившийПодпись - СправочникСсылка.Пользователи - подписавший
//     * Подпись - ДвоичныеДанные - данные подписи
//     * Сертификат - ДвоичныеДанные - данные сертификата
//     * ИмяФайлаПодписи - Строка - имя исходного файла ЭП
//
Функция ЗаполнитьСписокПодписей(ДокументСсылка)
	
	МассивПодписей = Новый Массив;
	
	ЗаполнитьСписокПодписейДокумента(ДокументСсылка, МассивПодписей);
	
	Возврат МассивПодписей;
	
КонецФункции	

// Заполняет список подписей файла по объекту Документооборота
//
// Параметры:
//   ТекущийОбъект - СправочникСсылка.Файлы
//   МассивПодписей - Массив - неявно возвращаемый массив структур, описывающих подписи файла:
//     * КомуВыданСертификат - Строка - владелец сертификата
//     * ДатаПодписи - Дата - дата ЭП
//     * Комментарий - Строка - комментарий к подписи
//     * Объект - СправочникСсылка.Файлы - ТекущийОбъект
//     * Отпечаток - Строка - отпечаток ЭП
//     * УстановившийПодпись - СправочникСсылка.Пользователи - подписавший
//     * Подпись - ДвоичныеДанные - данные подписи
//     * Сертификат - ДвоичныеДанные - данные сертификата
//     * ИмяФайлаПодписи - Строка - имя исходного файла ЭП
//
Процедура ЗаполнитьСписокПодписейФайла(ТекущийОбъект, МассивПодписей) Экспорт
	
	Если ТекущийОбъект.ПодписанЭП Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЭлектронныеПодписи.КомуВыданСертификат КАК КомуВыданСертификат,
			|	ЭлектронныеПодписи.ДатаПодписи КАК ДатаПодписи,
			|	ЭлектронныеПодписи.Комментарий КАК Комментарий,
			|	ЭлектронныеПодписи.Подпись КАК Подпись,
			|	ЭлектронныеПодписи.Отпечаток КАК Отпечаток,
			|	ЭлектронныеПодписи.УстановившийПодпись КАК УстановившийПодпись,
			|	ЭлектронныеПодписи.ИмяФайлаПодписи КАК ИмяФайлаПодписи,
			|	ЭлектронныеПодписи.Сертификат КАК Сертификат
			|ИЗ
			|	РегистрСведений.ЭлектронныеПодписи КАК ЭлектронныеПодписи
			|ГДЕ
			|	ЭлектронныеПодписи.Объект = &ОбъектСсылка";
				   
		Запрос.Параметры.Вставить("ОбъектСсылка", ТекущийОбъект);
		ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
		
		Пока ВыборкаЗапроса.Следующий() Цикл
			
			НоваяСтрока = Новый Структура("КомуВыданСертификат, ДатаПодписи, Комментарий, Объект, Отпечаток, УстановившийПодпись, Подпись, Сертификат, ИмяФайлаПодписи");
			
			НоваяСтрока.КомуВыданСертификат = ВыборкаЗапроса.КомуВыданСертификат;
			НоваяСтрока.ДатаПодписи = ВыборкаЗапроса.ДатаПодписи;
			НоваяСтрока.Комментарий = ВыборкаЗапроса.Комментарий;
			НоваяСтрока.Объект = ТекущийОбъект;
			НоваяСтрока.Отпечаток = ВыборкаЗапроса.Отпечаток;
			НоваяСтрока.УстановившийПодпись = ВыборкаЗапроса.УстановившийПодпись;
			НоваяСтрока.ИмяФайлаПодписи = ВыборкаЗапроса.ИмяФайлаПодписи;
			
			НоваяСтрока.Подпись = ВыборкаЗапроса.Подпись.Получить();
			НоваяСтрока.Сертификат = ВыборкаЗапроса.Сертификат.Получить();
			
			МассивПодписей.Добавить(НоваяСтрока);
			
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры
     
// Заполняет список подписей файла в объекте XDTO по переданному списку
//
// Параметры:
//   ОбъектXDTO - ОбъектXDTO типа, наследующего DMDocument, чьи подписи нужно заполнить
//   МассивПодписей - Массив - структуры, описывающие подписи документа к переносу в XDTO:
//     * КомуВыданСертификат - Строка - владелец сертификата
//     * ДатаПодписи - Дата - дата ЭП
//     * Комментарий - Строка - комментарий к подписи
//     * Объект - СправочникСсылка.<...>Документ, СправочникСсылка.Файлы - владелец подписи
//     * Отпечаток - Строка - отпечаток ЭП
//     * УстановившийПодпись - СправочникСсылка.Пользователи - подписавший
//     * Подпись - ДвоичныеДанные - данные подписи
//     * Сертификат - ДвоичныеДанные - данные сертификата
//     * ИмяФайлаПодписи - Строка - имя исходного файла ЭП
//
Процедура ЗаполнитьXDTOСписокПодписей(ОбъектXDTO, МассивПодписей)
	
	Для Каждого Подпись Из МассивПодписей Цикл
		
		ПодписьXDTO = ОбработкаЗапросовXDTO.СоздатьОбъект("DMSignature");
		
		Объект = Подпись.Объект;
		Если ТипЗнч(Объект) = Тип("СправочникСсылка.ВерсииФайлов") Тогда	
			Объект = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Подпись.Объект, "Владелец");
		КонецЕсли;	
		
		Для Каждого КлючИЗначениеПодписи Из Подпись Цикл
			
			Если КлючИЗначениеПодписи.Ключ = "КомуВыданСертификат" Тогда
				ПодписьXDTO.author = Подпись.КомуВыданСертификат;
			КонецЕсли;	
			
			Если КлючИЗначениеПодписи.Ключ = "ДатаПодписи" Тогда
				ПодписьXDTO.date = Подпись.ДатаПодписи;
			КонецЕсли;	
			
			Если КлючИЗначениеПодписи.Ключ = "Комментарий" Тогда
				ПодписьXDTO.comment = Подпись.Комментарий;
			КонецЕсли;	
			
			Если КлючИЗначениеПодписи.Ключ = "Подпись" Тогда
				ПодписьXDTO.signature = Подпись.Подпись;
			КонецЕсли;	
			
			Если КлючИЗначениеПодписи.Ключ = "Отпечаток" Тогда
				ПодписьXDTO.thumbprint = Подпись.Отпечаток;
			КонецЕсли;	
			
			Если КлючИЗначениеПодписи.Ключ = "Сертификат" Тогда
				ПодписьXDTO.certificate = Подпись.Сертификат;
			КонецЕсли;	
			
			Если КлючИЗначениеПодписи.Ключ = "ИмяФайлаПодписи" Тогда
				ПодписьXDTO.signatureFileName = Подпись.ИмяФайлаПодписи;
			КонецЕсли;	
			
			Если КлючИЗначениеПодписи.Ключ = "УстановившийПодпись" Тогда
				ПодписьXDTO.signer = ОбработкаЗапросовXDTO.СоздатьОбъект("DMUser");
				ПодписьXDTO.signer.name = Строка(Подпись.УстановившийПодпись); 
				ПодписьXDTO.signer.objectId = ОбработкаЗапросовXDTO.СоздатьОбъект("DMObjectID");
				ПодписьXDTO.signer.objectId.id = Строка(Подпись.УстановившийПодпись.УникальныйИдентификатор()); 
				ПодписьXDTO.signer.objectId.type = "DMUser";
			КонецЕсли;	
			
		КонецЦикла;	
		
		ОбъектXDTO.signatures.Добавить(ПодписьXDTO);
		
	КонецЦикла;	
	
КонецПроцедуры	

// Заполняет список подписей документа по данным Документооборота
//
// Параметры:
//   ТекущийОбъект - СправочникСсылка.<...>Документ
//   МассивПодписей - Массив - неявно возвращаемый массив структур, описывающих подписи документа:
//     * КомуВыданСертификат - Строка - владелец сертификата
//     * ДатаПодписи - Дата - дата ЭП
//     * Комментарий - Строка - комментарий к подписи
//     * Объект - СправочникСсылка.<...>Документ - ТекущийОбъект
//     * Отпечаток - Строка - отпечаток ЭП
//     * УстановившийПодпись - СправочникСсылка.Пользователи - подписавший
//     * Подпись - ДвоичныеДанные - данные подписи
//     * Сертификат - ДвоичныеДанные - данные сертификата
//     * ИмяФайлаПодписи - Строка - имя исходного файла ЭП
//
Процедура ЗаполнитьСписокПодписейДокумента(ТекущийОбъект, МассивПодписей) Экспорт
	
	Если ТекущийОбъект.ПодписанЭП Тогда
		
		ВыборкаЗапроса = РаботаСЭП.ПолучитьЭлектронныеПодписи(ТекущийОбъект);
		
		Пока ВыборкаЗапроса.Следующий() Цикл
			
			НоваяСтрока = Новый Структура("КомуВыданСертификат, ДатаПодписи, Комментарий, Объект, Отпечаток, УстановившийПодпись, Подпись, Сертификат, ИмяФайлаПодписи");
			
			НоваяСтрока.КомуВыданСертификат = ВыборкаЗапроса.КомуВыданСертификат;
			НоваяСтрока.ДатаПодписи = ВыборкаЗапроса.ДатаПодписи;
			НоваяСтрока.Комментарий = ВыборкаЗапроса.Комментарий;
			НоваяСтрока.Объект = ТекущийОбъект;
			НоваяСтрока.Отпечаток = ВыборкаЗапроса.Отпечаток;
			НоваяСтрока.УстановившийПодпись = ВыборкаЗапроса.УстановившийПодпись;
			НоваяСтрока.ИмяФайлаПодписи = ВыборкаЗапроса.ИмяФайлаПодписи;
			
			НоваяСтрока.Подпись = ВыборкаЗапроса.Подпись.Получить();
			НоваяСтрока.Сертификат = ВыборкаЗапроса.Сертификат.Получить();
			
			МассивПодписей.Добавить(НоваяСтрока);
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполняет и записывает состояние документа по данным объекта XDTO
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   Документ - СправочникОбъект.<...>Документ
//   ОбъектXDTO - ОбъектXDTO типа, наследующего DMDocument
//
Процедура ЗаполнитьСостоянияДокумента(Узел, Документ, ОбъектXDTO)
	
	Если ОбъектXDTO.Установлено("status") Тогда
		СостояниеДокумента = Неопределено;
		ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, СостояниеДокумента, ОбъектXDTO, "status");
		Если Не ЗначениеЗаполнено(СостояниеДокумента) Тогда 
			СостояниеДокумента = Перечисления.СостоянияДокументов.НаРегистрации;
		КонецЕсли;	
		
		Делопроизводство.ЗаписатьСостояниеДокумента(
			Документ.Ссылка, 
			ТекущаяДата(), 
			СостояниеДокумента, 
			ПользователиКлиентСервер.ТекущийПользователь());
	КонецЕсли;
	
	СоответствиеСостояний = Новый Соответствие;
	СоответствиеСостояний.Вставить("Согласование", "statusApproval");
	СоответствиеСостояний.Вставить("Утверждение",  "statusConfirmation");
	СоответствиеСостояний.Вставить("Регистрация",  "statusRegistration");
	СоответствиеСостояний.Вставить("Рассмотрение", "statusConsideration");
	СоответствиеСостояний.Вставить("Исполнение",   "statusPerformance");
	
	Для Каждого Строка Из СоответствиеСостояний Цикл
		ИмяСостояния = Строка.Ключ;
		ИмяСвойства = Строка.Значение;
		ТекущееСостояние = Делопроизводство.ПолучитьСтруктуруСостоянияДокумента(Документ.Ссылка, "Состояние" + ИмяСостояния);
		Если ОбъектXDTO.Установлено(ИмяСвойства) Тогда
			НовоеСостояние = ОбработкаЗапросовXDTO.ПолучитьСсылкуПоObjectID(ОбъектXDTO[ИмяСвойства].objectId);
			Если НовоеСостояние = Неопределено Тогда
				НовоеСостояние = Перечисления.СостоянияДокументов.ПустаяСсылка();
			КонецЕсли;
			Если ТекущееСостояние.Состояние <> НовоеСостояние Тогда
				Если Не ЗначениеЗаполнено(НовоеСостояние) Тогда
					Делопроизводство.ОчиститьСостояниеДокумента(Документ.Ссылка, ТекущееСостояние.Состояние)
				Иначе 
					Делопроизводство.ЗаписатьСостояниеДокумента(Документ.Ссылка, ТекущаяДатаСеанса(), 
						НовоеСостояние, ПользователиКлиентСервер.ТекущийПользователь());
				КонецЕсли; 
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
 
// Заполняет данными документа структуру реквизитов, общих для всех типов документов
//
// Параметры:
//   ДанныеДокумента - Структура, неявно возвращаемое значение
//   Документ - СправочникОбъект.<...>Документ - источник данных заполнения
//
Процедура ПолучитьОбщиеДанныеДокумента(ДанныеДокумента, Документ)
	
	ДанныеДокумента.Вставить("documentType", 	Документ.ВидДокумента);
	ДанныеДокумента.Вставить("title", 			Документ.Заголовок);
	ДанныеДокумента.Вставить("summary", 		Документ.Содержание);
	ДанныеДокумента.Вставить("comment", 		Документ.Комментарий);
	ДанныеДокумента.Вставить("regNumber", 		Документ.РегистрационныйНомер);
	ДанныеДокумента.Вставить("regDate", 		Документ.ДатаРегистрации);
	ДанныеДокумента.Вставить("sum", 			Документ.Сумма);
	ДанныеДокумента.Вставить("currency", 		Документ.Валюта);
	ДанныеДокумента.Вставить("organization", 	Документ.Организация);
	ДанныеДокумента.Вставить("subdivision", 	Документ.Подразделение);
	ДанныеДокумента.Вставить("accessLevel", 	Документ.ГрифДоступа);
	ДанныеДокумента.Вставить("performanceDate", Документ.СрокИсполнения);
	ДанныеДокумента.Вставить("activityMatter",  Документ.ВопросДеятельности);
	ДанныеДокумента.Вставить("responsible", 	Документ.Ответственный);
	ДанныеДокумента.Вставить("project", 		Документ.Проект);
	
КонецПроцедуры

// Заполняет структуру общих настроек, относящихся к документам
//
Процедура ПолучитьОбщиеНастройкиДокумента(ДанныеДокумента, Документ)
	
	ДанныеДокумента.Вставить("organizationEnabled", 		Константы.ИспользоватьУчетПоОрганизациям.Получить());
	ДанныеДокумента.Вставить("activityMatterEnabled", 		Константы.ИспользоватьВопросыДеятельности.Получить());
	ДанныеДокумента.Вставить("accessLevelEnabled", 			Константы.ИспользоватьГрифыДоступа.Получить());
	ДанныеДокумента.Вставить("filesEnabled", 				Константы.ИспользоватьФайлыУВходящихДокументов.Получить());
	ДанныеДокумента.Вставить("statusEnabled", 				Константы.ИспользоватьСостоянияДокументов.Получить());
	ДанныеДокумента.Вставить("statusChangeEnabled", 		Константы.РазрешитьРучноеИзменениеСостоянияДокументов.Получить());
	ДанныеДокумента.Вставить("limitPropertiesAvailability", Константы.ОграничиватьДоступностьПолейПоСостоянию.Получить());
	ДанныеДокумента.Вставить("projectsEnabled", 			Константы.ВестиУчетПоПроектам.Получить());
	
КонецПроцедуры

// Заполняет документ значениями свойство объекта XDTO, общими для всех типов документов
//
// Параметры:
//   Узел - ПланОбменаСсылка.ИнтегрированныеСистемы - узел интегрированной системы
//   ДокументОбъект - СправочникОбъект.<...>Документ - заполняемый документ
//   ОбъектXDTO - ОбъектXDTO - источник данных для заполнения
//
Процедура ЗаполнитьОбщиеДанныеДокумента(Узел, ДокументОбъект, ОбъектXDTO)
	
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ДокументОбъект.Заголовок, 		   ОбъектXDTO, "title");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ДокументОбъект.Содержание, 		   ОбъектXDTO, "summary");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ДокументОбъект.Комментарий, 		   ОбъектXDTO, "comment");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ДокументОбъект.СрокИсполнения, 	   ОбъектXDTO, "performanceDate");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ДокументОбъект.РегистрационныйНомер, ОбъектXDTO, "regNumber");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ДокументОбъект.ДатаРегистрации, 	   ОбъектXDTO, "regDate");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ДокументОбъект.Сумма, 			   ОбъектXDTO, "sum");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ДокументОбъект.Валюта, 			   ОбъектXDTO, "currency");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ДокументОбъект.Организация, 		   ОбъектXDTO, "organization");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ДокументОбъект.Подразделение, 	   ОбъектXDTO, "subdivision");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ДокументОбъект.ГрифДоступа, 		   ОбъектXDTO, "accessLevel");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ДокументОбъект.ВидДокумента, 		   ОбъектXDTO, "documentType");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ДокументОбъект.Ответственный, 	   ОбъектXDTO, "responsible");
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ДокументОбъект.ВопросДеятельности,   ОбъектXDTO, "activityMatter"); 
	ОбработкаЗапросовXDTO.ЗаполнитьРеквизитИзСвойстваXDTO(Узел, ДокументОбъект.Проект,			   ОбъектXDTO, "project"); 
	
КонецПроцедуры

// Устанавливает новому объекту ссылку, заданную свойством externalObject, если возможно
//
// Параметры:
//   НовыйОбъект - СправочникОбъект
//   ОбъектXDTO - ОбъектXDTO произвольного типа
//
Процедура УстановитьСсылкуНовогоДляСправочника(НовыйОбъект, ОбъектXDTO) 
	
	Если НЕ ОбъектXDTO.Установлено("externalObject") Тогда
		Возврат;
	КонецЕсли;
	
	ВидСправочника = НовыйОбъект.Метаданные().Имя;
	ИдентификаторВнешнегоОбъекта = Новый УникальныйИдентификатор(ОбъектXDTO.externalObject.id);
	СсылкаДО = Справочники[ВидСправочника].ПолучитьСсылку(ИдентификаторВнешнегоОбъекта);
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1 
		|	Ссылка
		|ИЗ
		|	Справочник." + ВидСправочника + "
		|ГДЕ 
		|	Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", СсылкаДО);
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		НовыйОбъект.УстановитьСсылкуНового(СсылкаДО);
	КонецЕсли;
	
КонецПроцедуры

// Получает ссылку по идентификатору внешнего объекта, если объект существует в БД
//
// Параметры:
//	 Узел - ПланОбменаСсылка.ИнтегрированныеСистемы
//   ОбъектXDTO - ОбъектXDTO произвольного типа
//   ВидСправочника - Строка - вид справочника
//
// Возвращаемое значение:
//   СправочникСсылка - ссылка, если объект найден по идентификатору
//   Неопределено - если объект не найден
//
Функция СправочникСсылкаПоИдентификаторуВнешнегоОбъекта(Узел, ОбъектXDTO, ВидСправочника) 
	
	Если НЕ ОбъектXDTO.Установлено("externalObject") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИдентификаторВнешнегоОбъекта = Новый УникальныйИдентификатор(ОбъектXDTO.externalObject.id);
	СсылкаПоИдентификатору = Справочники[ВидСправочника].ПолучитьСсылку(ИдентификаторВнешнегоОбъекта);
	// у связей, сохраненных в регистре - приоритет
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1 
		|	СсылкаНаОбъектДО КАК Ссылка,
		|	УзелИнтегрированнойСистемы КАК УзелИнтегрированнойСистемы,
		|	ТипВнешнегоОбъекта КАК ТипВнешнегоОбъекта,
		|	ИСТИНА КАК ЗаписьРегистра
		|ИЗ
		|	РегистрСведений.СвязиОбъектовИнтегрированныхСистем
		|ГДЕ
		|	УзелИнтегрированнойСистемы В(&Узлы)
		|	И ТИПЗНАЧЕНИЯ(СсылкаНаОбъектДО) = ТИП(Справочник." + ВидСправочника + ")
		|	И ИДВнешнегоОбъекта = &ИДВнешнегоОбъекта 
		|	И (ТипВнешнегоОбъекта = &ТипВнешнегоОбъекта ИЛИ ТипВнешнегоОбъекта = """")
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1 
		|	Ссылка,
		|	Неопределено,
		|	Неопределено,
		|	ЛОЖЬ КАК ЗаписьРегистра
		|ИЗ 
		|	Справочник." + ВидСправочника + "
		|ГДЕ 
		|	Ссылка = &СсылкаПоИдентификатору");
	Узлы = Новый Массив;
	Узлы.Добавить(Узел);
	Запрос.УстановитьПараметр("Узлы", Узел);
	Запрос.УстановитьПараметр("СсылкаПоИдентификатору", СсылкаПоИдентификатору);
	Запрос.УстановитьПараметр("ИДВнешнегоОбъекта", ОбъектXDTO.externalObject.id);
	Запрос.УстановитьПараметр("ТипВнешнегоОбъекта", ОбъектXDTO.externalObject.type);
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.ЗаписьРегистра
			И (Не ЗначениеЗаполнено(Выборка.УзелИнтегрированнойСистемы) 
			Или Не ЗначениеЗаполнено(Выборка.ТипВнешнегоОбъекта)) Тогда
			ОбработкаЗапросовXDTO.ИсправитьЗаписьСвязиОбъектов(
				Выборка.Ссылка,
				Выборка.УзелИнтегрированнойСистемы, 
				Выборка.ТипВнешнегоОбъекта, 
				Узел,
				ОбъектXDTO.externalObject.type,
				ОбъектXDTO.externalObject.id);
		КонецЕсли;
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Заполняет признак "Содержит оригиналы" для указанного документа
// 
// Параметры:
//   ОбъектXDTO - ОбъектXDTO, заполняемый документ
//   Документ - СправочникСсылка.<...>Документ, ссылка на источник данных
//
Процедура ЗаполнитьПризнакСодержитОригиналы(ОбъектXDTO, Документ)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СодержитОригинал
		|ИЗ
		|	РегистрСведений.ОбщиеРеквизитыДокументов
		|ГДЕ
		|	Документ = &Документ
		|");
	Запрос.УстановитьПараметр("Документ", Документ);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОбъектXDTO.containsScannedOriginals = Выборка.СодержитОригинал;
	Иначе
		ОбъектXDTO.containsScannedOriginals = Ложь;
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти