// Инициализирует таблицы значений, содержащие данные документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст ="ВЫБРАТЬ
	              |	ДанныеДокумента.Ссылка.Дата КАК Период,
	              |	ДанныеДокумента.Ссылка КАК Ссылка,
	              |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	              |	ДанныеДокумента.Договор КАК Договор,
	              |	ДанныеДокумента.ЭтапДоговора КАК ЭтапДоговора,
	              |	ДанныеДокумента.СуммаПосле - ДанныеДокумента.СуммаДо КАК Сумма,
	              |	ДанныеДокумента.НДСПосле - ДанныеДокумента.НДСДо КАК НДС,
	              |	ДанныеДокумента.СтавкаНДС,
	              |	ДанныеДокумента.ОсвобождениеОтНДС,
	              |	"""" КАК НомерДокумента
	              |ИЗ
	              |	Документ.мДеноминацияУчетДоговоров.УчетДоговоров КАК ДанныеДокумента
	              |ГДЕ
	              |	ДанныеДокумента.Ссылка = &Ссылка";
	
    Результат = Запрос.Выполнить().Выгрузить();
  
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаУчетДоговоров", Результат);
		
КонецПроцедуры // ИнициализироватьДанныеДокумента()
