#Область ПрограммныйИнтерфейс

// Добавляет способ уведомления пользователя в РС
Процедура ДобавитьСпособУведомления(Пользователь, СпособУведомления, ДанныеСпособа) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
		
	Запись = РегистрыСведений.СпособыУведомленияПользователей.СоздатьМенеджерЗаписи();
	Запись.Пользователь = Пользователь;
	Запись.СпособУведомления = СпособУведомления;
	Запись.ДанныеСпособа = ДанныеСпособа;
	Запись.Прочитать();
	
	Запись.Пользователь = Пользователь;
	Запись.СпособУведомления = СпособУведомления;
	Запись.ДанныеСпособа = ДанныеСпособа;
	Запись.Записать(Истина);
	
КонецПроцедуры

// Удаляет способ уведомления пользователя в РС
Процедура УдалитьСпособУведомления(Пользователь, СпособУведомления) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
		
	Набор = РегистрыСведений.СпособыУведомленияПользователей.СоздатьНаборЗаписей();
	Набор.Отбор.Пользователь.Установить(Пользователь);
	Набор.Отбор.СпособУведомления.Установить(СпособУведомления);
	Набор.Записать();
	
КонецПроцедуры

// Возвращает данные массив данных способов уведомления для пользователя
Функция ПолучитьДанныеСпособаУведомления(Пользователь, СпособУведомления) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивДанныхУведомления = Новый Массив;
	
	Набор = РегистрыСведений.СпособыУведомленияПользователей.СоздатьНаборЗаписей();
	Набор.Отбор.Пользователь.Установить(Пользователь);
	Набор.Отбор.СпособУведомления.Установить(СпособУведомления);
	Набор.Прочитать();
	
	Для каждого Запись Из Набор Цикл
		МассивДанныхУведомления.Добавить(Запись.ДанныеСпособа);		
	КонецЦикла;
	
	Возврат МассивДанныхУведомления;
	
КонецФункции

#КонецОбласти