////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТекстПисьма") Тогда
		ТекстПисьма = Параметры.ТекстПисьма;
	КонецЕсли;
	
	ТекстПослеРедактирования = ТекстПисьма;
	СтарыйСимволЦитирования = ВстроеннаяПочтаСерверПовтИсп.ПолучитьСимволЦитированияВПереписке();
	НовыйСимволЦитирования = ВстроеннаяПочтаСерверПовтИсп.ПолучитьСимволЦитированияВПереписке();
	ИзменятьЦитированиеДоУровня = 1;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура Готово(Команда)
	
	Закрыть(ТекстПослеРедактирования);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьИсходныйТекст(Команда)
	
	ТекстПослеРедактирования = ТекстПисьма;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСимволЦитирования(Команда)
	
	НачалоСтроки = 0;
	НачалоКолонки = 0;
	КонецСтроки = 0;
	КонецКолонки = 0;
	ВосстановитьГраницыВыделения = Ложь;
	
	Если Не ЗначениеЗаполнено(Элементы.ТекстПослеРедактирования.ВыделенныйТекст)
		ИЛИ Элементы.ТекстПослеРедактирования <> ТекущийЭлемент Тогда
		
		ВосстановитьГраницыВыделения = Истина;
		
		Элементы.ТекстПослеРедактирования.ПолучитьГраницыВыделения(НачалоСтроки, НачалоКолонки, КонецСтроки, КонецКолонки);
		Элементы.ТекстПослеРедактирования.УстановитьГраницыВыделения(1, СтрДлина(Элементы.ТекстПослеРедактирования.ТекстРедактирования));
		
	КонецЕсли;
	
	РаботаСоСтроками.ДобавитьЦитирование(
		Элементы.ТекстПослеРедактирования.ВыделенныйТекст,
		НовыйСимволЦитирования);
	
	Если ВосстановитьГраницыВыделения Тогда
		
		Элементы.ТекстПослеРедактирования.УстановитьГраницыВыделения(НачалоСтроки, НачалоКолонки, КонецСтроки, КонецКолонки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьСимволЦитирования(Команда)
	
	НачалоСтроки = 0;
	НачалоКолонки = 0;
	КонецСтроки = 0;
	КонецКолонки = 0;
	ВосстановитьГраницыВыделения = Ложь;
	
	Если Не ЗначениеЗаполнено(Элементы.ТекстПослеРедактирования.ВыделенныйТекст)
		ИЛИ Элементы.ТекстПослеРедактирования <> ТекущийЭлемент Тогда
		
		ВосстановитьГраницыВыделения = Истина;
		
		Элементы.ТекстПослеРедактирования.ПолучитьГраницыВыделения(НачалоСтроки, НачалоКолонки, КонецСтроки, КонецКолонки);
		Элементы.ТекстПослеРедактирования.УстановитьГраницыВыделения(1, СтрДлина(Элементы.ТекстПослеРедактирования.ТекстРедактирования));
		
	КонецЕсли;
	
	РаботаСоСтроками.ЗаменитьЦитирование(
		Элементы.ТекстПослеРедактирования.ВыделенныйТекст,
		СтарыйСимволЦитирования,
		НовыйСимволЦитирования,
		ИзменятьЦитированиеДоУровня);
	
	Если ВосстановитьГраницыВыделения Тогда
		
		Элементы.ТекстПослеРедактирования.УстановитьГраницыВыделения(НачалоСтроки, НачалоКолонки, КонецСтроки, КонецКолонки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСимволЦитирования(Команда)
	
	НачалоСтроки = 0;
	НачалоКолонки = 0;
	КонецСтроки = 0;
	КонецКолонки = 0;
	ВосстановитьГраницыВыделения = Ложь;
	
	Если Не ЗначениеЗаполнено(Элементы.ТекстПослеРедактирования.ВыделенныйТекст)
		ИЛИ Элементы.ТекстПослеРедактирования <> ТекущийЭлемент Тогда
		
		ВосстановитьГраницыВыделения = Истина;
		
		Элементы.ТекстПослеРедактирования.ПолучитьГраницыВыделения(НачалоСтроки, НачалоКолонки, КонецСтроки, КонецКолонки);
		Элементы.ТекстПослеРедактирования.УстановитьГраницыВыделения(1, СтрДлина(Элементы.ТекстПослеРедактирования.ТекстРедактирования));
		
	КонецЕсли;
	
	РаботаСоСтроками.УдалитьЦитирование(
		Элементы.ТекстПослеРедактирования.ВыделенныйТекст,
		СтарыйСимволЦитирования);
	
	Если ВосстановитьГраницыВыделения Тогда
		
		Элементы.ТекстПослеРедактирования.УстановитьГраницыВыделения(НачалоСтроки, НачалоКолонки, КонецСтроки, КонецКолонки);
		
	КонецЕсли;
	
КонецПроцедуры
