
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПараметрКоманды", ПараметрКоманды);
	ПараметрыФормы.Вставить("Договор", ПараметрКоманды);
	
	Если ЭтоДоговорФизЛица(ПараметрКоманды) Тогда
		ОткрытьФормуМодально("Обработка.мИнформацияДляОплатыДоговора.Форма.ФормаФЛ", ПараметрыФормы, ПараметрКоманды);
	Иначе	
		ОткрытьФормуМодально("Обработка.мИнформацияДляОплатыДоговора.Форма.ФормаЮЛ", ПараметрыФормы, ПараметрКоманды);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ЭтоДоговорФизЛица(Договор) 
	Если Договор.Корреспондент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли; 
КонецФункции
 