
Процедура ВывестиШапкуОтчета(ДокументРезультат)
	//Макет = ПолучитьОбщийМакет("ОбщиеОбластиСтандартногоОтчета");
	//ОбластьОрганизация = Макет.ПолучитьОбласть("Организация");
	//НазваниеОрганизации = Константы.НашаОрганизация.Получить().ПолноеНаименование;
	//ОбластьОрганизация.Параметры.НазваниеОрганизации = НазваниеОрганизации;
	//
	//ДокументРезультат.Вывести(ОбластьОрганизация);
КОнецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
    ДокументРезультат.КлючПараметровПечати = "мФорма14инв";
КонецПроцедуры
