
&НаКлиенте
Перем Док;

&НаКлиенте
Перем WordApp;

&НаКлиенте
Перем Селекция, НачалоЗакладки, Поиск;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Договор = Неопределено;
	ДопСоглашение = Неопределено;		
	Элементы.ДопСоглашение.Видимость = Ложь;
	СоздатьДокумент = Истина;
	
	Если Параметры.Свойство("Договор") Тогда
		Договор = Параметры.Договор;
		
		// разделяем печать из доп соглашения и договора
		Если Договор.ВидДокумента = Справочники.ВидыВнутреннихДокументов.ДополнительноеСоглашениеДоговораЗемлеустроительныхРабот Тогда
			ДопСоглашение = Договор;
			Элементы.ДопСоглашение.Видимость = Истина;
			
			Договор = мРаботаСДоговорами.ПолучитьДоговорСвязанногоДокумента(ДопСоглашение);
            ВалютаДоговора = ДопСоглашение.Валюта;
		КонецЕсли; 
	КонецЕсли; 
	
	СКопейками = Истина;
	
	ОбновитьНастройкиНаСервере();
	ЗаполнитьСписокНастроекПечати();
	
	ГородПодразделения	= мРазное.ПолучитьГородПодразделения();
	ГородБазы	= мРазное.ПолучитьГородБазы();
	
	РублиНовые = Справочники.Валюты.НайтиПоКоду("933");
	РублиСтарые = Справочники.Валюты.НайтиПоКоду("974");
	
	СвидетельствоОГосРегистрации = Константы.мСвидетельствоОГосРегистрации.Получить();
	
КонецПроцедуры

&НаСервере
Функция Объект()
	Возврат РеквизитФормыВЗначение("Объект");
КонецФункции

&НаКлиенте
Процедура Печать(Команда)
	СохранитьНастройкуПечати();
	
	ИмяПроцедуры = ПолучитьНазваниеПроцедуры(НастройкаПечати);
	Если ИмяПроцедуры = "Печать договора ТКП" Тогда
		ПечатьДоговорТКП();
		
	ИначеЕсли ИмяПроцедуры = "Печать договора поставки" Тогда
		ПечатьДоговорПоставки();
		
	ИначеЕсли ИмяПроцедуры = "Печать договора с юрлицами (предоплата)" Тогда
		ПечатьДоговорЮрЛиц();
		
	ИначеЕсли ИмяПроцедуры = "Печать договора с юрлицами (бюджет)" Тогда
		ПечатьДоговорЮрЛицБюджет();
		
	ИначеЕсли ИмяПроцедуры = "Печать договора с юрлицами (ПИР+Убытки ориентир)" Тогда
		ПечатьДоговорЮрЛицПИРУбытки();
		
	ИначеЕсли ИмяПроцедуры = "Печать договора с юрлицами (ПИР+Убытки ориентир) (по актам)" Тогда
		ПечатьДоговорЮрЛицПИРУбыткиПоАктам();
		
	ИначеЕсли ИмяПроцедуры = "Печать договора с юрлицами (Отвод+Убытки фактич)" Тогда
		ПечатьДоговорОтводУбытки();
		
	ИначеЕсли ИмяПроцедуры = "Печать договора с юрлицами (Отвод+Убытки фактич) (по актам)" Тогда
		ПечатьДоговорОтводУбыткиПоАктам();
		
	ИначеЕсли ИмяПроцедуры = "Печать договора с юрлицами (выкопировка)" Тогда
		ПечатьДоговорЮрЛицВыкопировка();
		
	ИначеЕсли ИмяПроцедуры = "Печать договора с юрлицами (топосъемка)" Тогда
		ПечатьДоговорЮрЛицТопосъемка();
		
	ИначеЕсли ИмяПроцедуры = "Печать договора с физлицами (предоплата)" Тогда
		ПечатьДоговорФизЛиц();
		
	ИначеЕсли ИмяПроцедуры = "Печать договора с физлицами (доля в праве)" Тогда
		ПечатьДоговорФизЛицДоляВПраве();
		
	ИначеЕсли ИмяПроцедуры = "Печать договора c физлицами (топосъемка)" Тогда
		ПечатьДоговорФизЛицТопосъемка();
		
	ИначеЕсли ИмяПроцедуры = "Печать доп. соглашения юр. лица (Изм. объемов)" Тогда
		ПечатьДопСоглашениеЮрЛицаИзмОбъема();
		
	ИначеЕсли ИмяПроцедуры = "Печать доп. соглашения юр. лица (Изм. расч. счета)" Тогда
		ПечатьДопСоглашениеЮрЛицаИзмРасчСчета();
		
	ИначеЕсли ИмяПроцедуры = "Печать доп. соглашения физ. лица (НДС)" Тогда
		ПечатьДопСоглашениеФизЛицаНДС();
		
	ИначеЕсли ИмяПроцедуры = "Печать доп. соглашения физ. лица (Изм. объемов)" Тогда
		ПечатьДопСоглашениеФизЛицаИзмОбъема();
		
	Иначе
		Сообщить("Не реализована процедура печати для " + НастройкаПечати);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПечатьДоговорФизЛиц()
	
	ПолучитьОбщиеДанныеДоговора();
	
	Подписи = ПолучитьПодписиПодрядчика(Договор);
	СтруктураНашихРеквизитов = мРаботаСДоговорами.ПолучитьНашиРеквизиты(Договор);
	Город = мРазное.НашГород(СтруктураНашихРеквизитов);
	
	ИнициализироватьДокументWord();
	
	// Заполнение договора
	Если ГородБазы = "Минск" ИЛИ ГородБазы = "Прилуки" Тогда

		мРазноеКлиент.Заменить(Поиск, "%ТелефонНачОтдела%", ТелефонИсполнителя);  
		
		//Штрихкод
		ВставитьШтрихКод();
	КонецЕсли; 

	РегНомер = НомерДоговора;
	ДатаРег = Формат(ДатаДоговора,"ДЛФ=DD");
	мРазноеКлиент.Заменить(Поиск, "РегНомер", РегНомер);  
	мРазноеКлиент.Заменить(Поиск, "ДатаРег", ДатаРег); 
	мРазноеКлиент.Заменить(Поиск, "%Город", Город); 
	
	// Руководители
	Док.Bookmarks("Руководитель").Range.Text = ПолучитьСтрокуРуководителя(Подписи); 
	Док.Bookmarks("Доверенность").Range.Text = ПолучитьДоверенность(Подписи.Подписал, ДатаДоговора); 
	мРазноеКлиент.Заменить(Поиск, "%Свидетельство%", СвидетельствоОГосРегистрации); 
	СтрокаЗаказчика = "";
	Для каждого Стр Из Заказчики Цикл
		СтрокаЗаказчика = СтрокаЗаказчика + Стр.ПолноеНаименование + ", ";
	КонецЦикла;
	СтрокаЗаказчика = Лев(СтрокаЗаказчика, СтрДлина(СтрокаЗаказчика)-2);
	мРазноеКлиент.Заменить(Поиск, "%Заказчик%", СтрокаЗаказчика); 
	
	ОдинЭтап = Ложь;
	Если ЭтапыДоговора.Количество() = 1 Тогда
		ОдинЭтап = Истина;	
	КонецЕсли; 
	
	// Пункт 1.1 ПереченьРабот
	ПереченьРабот = "";
	Если ОдинЭтап Тогда
		ПодПунктЦель = "1.2";
		ПереченьРабот = " - " + ЭтапыДоговора[0].НаименованиеРаботы;
	Иначе
		ПодПунктЦель = "1.3";
	    ПереченьРабот = ":"+Символы.ПС;
		Для каждого Стр Из ЭтапыДоговора Цикл
			ПереченьРабот = ПереченьРабот + "- "+Стр.НаименованиеРаботы+";"+Символы.ПС;
		КонецЦикла; 
		ПереченьРабот = Лев(ПереченьРабот, СтрДлина(ПереченьРабот)-2);
	КонецЕсли;
	мРазноеКлиент.Заменить(Поиск, "%ПодПунктЦель%", ПодПунктЦель); 
	Док.Bookmarks("ПереченьРабот").Range.Text = ПереченьРабот; 
	Док.Bookmarks("Цель").Range.Text = ПолучитьЦель(); 
	
	// Пункт 1.2
	Если ОдинЭтап Тогда
		// Удаляем
		УдалитьЗакладку("Пункт12");
	Иначе
		// оставляем	
		УдалитьЗакладку("Подпункт12");
		
		й=ЭтапыДоговора.Количество()-1;
		Пока й >= 0 Цикл
			селекция.Start = НачалоЗакладки; // Начало вставки
			селекция.Collapse();             // Вставка, а не замещение
			селекция.Paste();
			НомерПодпункта = й+1;
			мРазноеКлиент.Заменить(Поиск, "%Подпункт12%", НомерПодпункта); 
			мРазноеКлиент.Заменить(Поиск, "%ПорядковыйЭтапа12%", мРаботаСДоговорами.ПорядковыйНомер(НомерПодпункта)); 
			мРазноеКлиент.Заменить(Поиск, "%ВидРаботЭтапа%", ДобавитьТочку(ЭтапыДоговора[й].НаименованиеРаботы)); 
			й=й-1;
		КонецЦикла; 
	КонецЕсли; 
	
	// Оставшиеся пункты 1 раздела
	Если ОдинЭтап Тогда
		мРазноеКлиент.Заменить(Поиск, "%ПодПунктАдрес%", "1.3"); 
		мРазноеКлиент.Заменить(Поиск, "%ПодПунктДанные%", "1.4"); 
	Иначе
		мРазноеКлиент.Заменить(Поиск, "%ПодПунктАдрес%", "1.4"); 
		мРазноеКлиент.Заменить(Поиск, "%ПодПунктДанные%", "1.5"); 
	КонецЕсли; 
	
	Док.Bookmarks("Месторасположение").Range.Text = ДобавитьТочку(ЭтапыДоговора[0].Месторасположение); 
	
	// Пункт 2.1
	Если ОдинЭтап Тогда
		// Удаляем
		НачалоЗакладки = Док.Bookmarks("Пункт21Несколько").Start;
		КонецЗакладки = Док.Bookmarks("Пункт21Несколько").End;
		Селекция.Start = НачалоЗакладки;
		Селекция.End = КонецЗакладки;
		Селекция.Cut(); 
		
		мРазноеКлиент.Заменить(Поиск, "%ПредУсловие%", мРаботаСДоговорами.ДлительностьВыполненияРаботСтрокой(ЭтапыДоговора[0].ДлительностьВыполненияРабот, ЭтапыДоговора[0].ВидДней)); 
		ВывестиПоле(Док, "МоментОплаты1Этап", ЭтапыДоговора[0].МоментОплаты, "предоставления необходимых документов");
        Док.Bookmarks("РезультатРаботы1Этап").Range.Text = ДобавитьТочку(ЭтапыДоговора[0].РезультатРаботы); 
		
	Иначе
		// Удаляем
		УдалитьЗакладку("Пункт21ОдинЭтап");
		УдалитьЗакладку("РезультатРаботы1Этап");
		
		// Запоминаем
		УдалитьЗакладку("Пункт21");
		
		й=ЭтапыДоговора.Количество()-1;
		Пока й >= 0 Цикл
			селекция.Start = НачалоЗакладки; // Начало вставки
			селекция.Collapse();             // Вставка, а не замещение
			селекция.Paste();
			НомерПодпункта = й+1;
			мРазноеКлиент.Заменить(Поиск, "%Подпункт21%", НомерПодпункта); 
			мРазноеКлиент.Заменить(Поиск, "%ПорядковыйЭтапа21%", мРаботаСДоговорами.ПорядковыйНомер(НомерПодпункта)); 
			мРазноеКлиент.Заменить(Поиск, "%ПорядковыйЭтапаРП%", мРаботаСДоговорами.ПорядковыйНомер(НомерПодпункта, 2)); 
			мРазноеКлиент.Заменить(Поиск, "%ПредУсловие%", мРаботаСДоговорами.ДлительностьВыполненияРаботСтрокой(ЭтапыДоговора[й].ДлительностьВыполненияРабот, ЭтапыДоговора[й].ВидДней)); 
 			ВывестиПоле(Док, "МоментОплаты", ЭтапыДоговора[й].МоментОплаты, "предоставления необходимых документов");
			Док.Bookmarks("РезультатРаботы").Range.Text = ДобавитьТочку(ЭтапыДоговора[й].РезультатРаботы); 
			й=й-1;
		КонецЦикла; 
	КонецЕсли; 
	
	// Пункт 3.1
	// Номер прейскуранта
	Док.Bookmarks("НомерПрейскуранта").Range.Text = ПолучитьНомерПрейскуранта(СтруктураНашихРеквизитов); 
	
	// Стоимость
	РеквизитыЛьготы = мРазноеКлиент.ПолучитьЛьготуНДС(ЭтапыДоговора);
	ЛьготаНДС = РеквизитыЛьготы.ЛьготаНДС;
	СтавкаНДСДляПрописи = ПолучитьПредставлениеСтавкиНДС(РеквизитыЛьготы.СтавкаНДСДляПрописи);
	
    СтоимостьИтог = 0; 
    СуммаНДСИтог = 0; 
    СтоимостьСНДСИтог = 0; 

    //Если ОдинЭтап Тогда
    //	мРазноеКлиент.Заменить(Поиск, "%ИзНих%", "."); 
    //	
    //	// Удаляем
    //	УдалитьЗакладку("ТаблицаДоговора");
    //	
    //	Стоимость = ЭтапыДоговора[0].Стоимость; 
    //	СуммаНДС = ЭтапыДоговора[0].СуммаНДС; 
    //	СтоимостьСНДС = ЭтапыДоговора[0].СтоимостьСНДС; 
    //	
    //	СтоимостьИтог = СтоимостьИтог + Стоимость; 
    //	СуммаНДСИтог = СуммаНДСИтог + СуммаНДС; 
    //	СтоимостьСНДСИтог = СтоимостьСНДСИтог + СтоимостьСНДС; 
    //	
    //Иначе
		мРазноеКлиент.Заменить(Поиск, "%ИзНих%", ", из них выполнение работ:"); 
		
		// Запоминаем
		УдалитьЗакладку("СтрокаТаблицы");
		
		ФорматНовыхЦен = "ЧДЦ=2; ЧРГ=' '; ЧН=-";
		
		СтоимостьИтог = 0; 
		СуммаНДСИтог = 0; 
		СтоимостьСНДСИтог = 0; 
		
		й=ЭтапыДоговора.Количество()-1;
		Пока й >= 0 Цикл
			селекция.Start = НачалоЗакладки; // Начало вставки
			селекция.Collapse();             // Вставка, а не замещение
			селекция.Paste();
			
			мРазноеКлиент.Заменить(Поиск, "НомерЭтапа", ЭтапыДоговора[й].НомерЭтапа); 
			Док.Bookmarks("НаименованиеРаботы").Range.Text = ДобавитьТочку(ЭтапыДоговора[й].НаименованиеРаботы); 
			Док.Bookmarks("ЕдиницаИзмерения").Range.Text = "учас- ток"; 
			Док.Bookmarks("КоличествоУчастков").Range.Text = ЭтапыДоговора[й].КоличествоУчастков; 
			Док.Bookmarks("СтавкаНДС").Range.Text = ПолучитьПредставлениеСтавкиНДС(ЭтапыДоговора[й].СтавкаНДС); 
			
			Стоимость = ЭтапыДоговора[й].Стоимость; 
			СуммаНДС = ЭтапыДоговора[й].СуммаНДС; 
			СтоимостьСНДС = ЭтапыДоговора[й].СтоимостьСНДС; 
			
			Док.Bookmarks("Стоимость").Range.Text = Формат(Стоимость, ФорматНовыхЦен); 
			Док.Bookmarks("СуммаНДС").Range.Text = Формат(СуммаНДС, ФорматНовыхЦен); 
			Док.Bookmarks("СтоимостьСНДС").Range.Text = Формат(СтоимостьСНДС, ФорматНовыхЦен); 
					
			СтоимостьИтог = СтоимостьИтог + Стоимость; 
			СуммаНДСИтог = СуммаНДСИтог + СуммаНДС; 
			СтоимостьСНДСИтог = СтоимостьСНДСИтог + СтоимостьСНДС; 
		
			й=й-1;
		КонецЦикла;
		// Всего
		мРазноеКлиент.Заменить(Поиск, "СтоимостьИтог", Формат(СтоимостьИтог, ФорматНовыхЦен)); 
		мРазноеКлиент.Заменить(Поиск, "СуммаНДСИтог", Формат(СуммаНДСИтог, ФорматНовыхЦен)); 
		мРазноеКлиент.Заменить(Поиск, "СтоимостьСНДСИтог", Формат(СтоимостьСНДСИтог, ФорматНовыхЦен)); 
    //КонецЕсли; 
	
	// Договор в рублях
	СтоимостьДоговора = мРаботаСДоговорами.СуммаЧисломИПрописью(СтоимостьСНДСИтог, РублиНовые);
	Если СуммаНДС > 0 Тогда
		СуммаНДСПрописьюПолная = мРаботаСДоговорами.СуммаЧисломИПрописью(СуммаНДСИтог, РублиНовые);
		СтоимостьДоговора = СтоимостьДоговора + ", в том числе НДС по ставке " + СтавкаНДСДляПрописи +"% в сумме " + СуммаНДСПрописьюПолная;
	КонецЕсли;

	мРазноеКлиент.Заменить(Поиск, "СтоимостьДоговора", СтоимостьДоговора); 
	
	мРазноеКлиент.Заменить(Поиск, "ЛьготаНДС", ЛьготаНДС); 
	
	//Док.Bookmarks("ИсточникФинанс").Range.Text = ИсточникФинанс; 
	
	// Пункт 3.2
	Если ОдинЭтап Тогда
		мРазноеКлиент.Заменить(Поиск, "%ПроцентПредоплаты%", ЭтапыДоговора[0].ПроцентПредоплаты); 
		ВывестиПоле(Док, "%МоментОплаты32_1Этап%", ЭтапыДоговора[0].МоментОплаты, "подписания настоящего договора");
		
		// Удаляем
		УдалитьЗакладку("Пункт32Несколько");
		УдалитьЗакладку("ПодПункт32");
		
	Иначе
		// Удаляем
		УдалитьЗакладку("Пункт32Один");
		
		// Запоминаем
		УдалитьЗакладку("ПодПункт32");
		
		мРазноеКлиент.Заменить(Поиск, "%ИзНих%", ", из них выполнение работ:"); 
		//СтрокаФорматаЦен = ?(СКопейками, "ЧДЦ=2; ЧРД=.; ЧГ=3,0","ЧДЦ=; ЧГ=3,0"); 
		
		й=ЭтапыДоговора.Количество()-1;
		Пока й >= 0 Цикл
			селекция.Start = НачалоЗакладки; // Начало вставки
			селекция.Collapse();             // Вставка, а не замещение
			селекция.Paste();
			НомерПодпункта = й+1;
			мРазноеКлиент.Заменить(Поиск, "%Подпункт32%", НомерПодпункта); 
			мРазноеКлиент.Заменить(Поиск, "%Порядковый32%", мРаботаСДоговорами.ПорядковыйНомер(НомерПодпункта, 3)); 
			мРазноеКлиент.Заменить(Поиск, "%ПроцентПредоплаты%", ЭтапыДоговора[й].ПроцентПредоплаты); 
			ВывестиПоле(Док, "%МоментОплаты32%", ЭтапыДоговора[й].МоментОплаты, "подписания настоящего договора");
			й=й-1;
		КонецЦикла; 
	КонецЕсли; 
	
	// Подписи документа
	ВывестиПодписи(Док, СтруктураНашихРеквизитов, Подписи);
	
	// Вывод на печать или в файл
	ВывестиДокумент();
	
КонецПроцедуры 

&НаКлиенте
Процедура ПечатьДоговорФизЛицДоляВПраве()
	
	ПолучитьОбщиеДанныеДоговора();
	
	Подписи = ПолучитьПодписиПодрядчика(Договор);
	СтруктураНашихРеквизитов = мРаботаСДоговорами.ПолучитьНашиРеквизиты(Договор);
	Город = мРазное.НашГород(СтруктураНашихРеквизитов);
	
	ИнициализироватьДокументWord();
	
	// Заполнение договора
	Если ГородБазы = "Минск" ИЛИ ГородБазы = "Прилуки" Тогда

		мРазноеКлиент.Заменить(Поиск, "%ТелефонНачОтдела%", ТелефонИсполнителя);  
		
		//Штрихкод
		ВставитьШтрихКод();
	КонецЕсли; 
	
	РегНомер = НомерДоговора;
	ДатаРег = Формат(ДатаДоговора,"ДЛФ=DD");
	мРазноеКлиент.Заменить(Поиск, "РегНомер", РегНомер);  
	мРазноеКлиент.Заменить(Поиск, "ДатаРег", ДатаРег); 
	мРазноеКлиент.Заменить(Поиск, "%Город", Город); 
	
	// Руководители
	Док.Bookmarks("Руководитель").Range.Text = ПолучитьСтрокуРуководителя(Подписи); 
	Док.Bookmarks("Доверенность").Range.Text = ПолучитьДоверенность(Подписи.Подписал, ДатаДоговора); 
	мРазноеКлиент.Заменить(Поиск, "%Свидетельство%", СвидетельствоОГосРегистрации); 
	
	УдалитьЗакладку("СтороныЗаказчиков");
	
	й=Заказчики.Количество()-1;
	Пока й >= 0 Цикл
		селекция.Start = НачалоЗакладки; // Начало вставки
		селекция.Collapse();             // Вставка, а не замещение
		селекция.Paste();
		НомерЗаказчика = й+1;
		мРазноеКлиент.Заменить(Поиск, "ЗаказчикН", СокрЛП(Заказчики[й].ПолноеНаименование)); 
		мРазноеКлиент.Заменить(Поиск, "_НомерЗаказчика_", НомерЗаказчика); 
		мРазноеКлиент.Заменить(Поиск, "%НомерСтороны", НРег(мРаботаСДоговорами.ПорядковыйНомер(НомерЗаказчика+1, 3, "ж"))); 
		й=й-1;
	КонецЦикла; 
	
	ОдинЭтап = Ложь;
	Если ЭтапыДоговора.Количество() = 1 Тогда
		ОдинЭтап = Истина;	
	КонецЕсли; 
	
	// Пункт 1.1 ПереченьРабот
	ПереченьРабот = "";
	Если ОдинЭтап Тогда
		ПодПунктЦель = "1.2";
		ПереченьРабот = " - " + ЭтапыДоговора[0].НаименованиеРаботы;
	Иначе
		ПодПунктЦель = "1.3";
	    ПереченьРабот = ":"+Символы.ПС;
		Для каждого Стр Из ЭтапыДоговора Цикл
			ПереченьРабот = ПереченьРабот + "- "+Стр.НаименованиеРаботы+";"+Символы.ПС;
		КонецЦикла; 
		ПереченьРабот = Лев(ПереченьРабот, СтрДлина(ПереченьРабот)-2);
	КонецЕсли;
	мРазноеКлиент.Заменить(Поиск, "%ПодПунктЦель%", ПодПунктЦель); 
	Док.Bookmarks("ПереченьРабот").Range.Text = ПереченьРабот; 
	Док.Bookmarks("Цель").Range.Text = ПолучитьЦель(); 
	
	// Пункт 1.2
	Если ОдинЭтап Тогда
		// Удаляем
		УдалитьЗакладку("Пункт12");
	Иначе
		// оставляем	
		УдалитьЗакладку("Подпункт12");
		
		й=ЭтапыДоговора.Количество()-1;
		Пока й >= 0 Цикл
			селекция.Start = НачалоЗакладки; // Начало вставки
			селекция.Collapse();             // Вставка, а не замещение
			селекция.Paste();
			НомерПодпункта = й+1;
			мРазноеКлиент.Заменить(Поиск, "%Подпункт12%", НомерПодпункта); 
			мРазноеКлиент.Заменить(Поиск, "%ПорядковыйЭтапа12%", мРаботаСДоговорами.ПорядковыйНомер(НомерПодпункта)); 
			мРазноеКлиент.Заменить(Поиск, "%ВидРаботЭтапа%", ДобавитьТочку(ЭтапыДоговора[й].НаименованиеРаботы)); 
			й=й-1;
		КонецЦикла; 
	КонецЕсли; 
	
	// Оставшиеся пункты 1 раздела
	Если ОдинЭтап Тогда
		мРазноеКлиент.Заменить(Поиск, "%ПодПунктАдрес%", "1.3"); 
		мРазноеКлиент.Заменить(Поиск, "%ПодПунктДанные%", "1.4"); 
	Иначе
		мРазноеКлиент.Заменить(Поиск, "%ПодПунктАдрес%", "1.4"); 
		мРазноеКлиент.Заменить(Поиск, "%ПодПунктДанные%", "1.5"); 
	КонецЕсли; 
	
	Док.Bookmarks("Месторасположение").Range.Text = ДобавитьТочку(ЭтапыДоговора[0].Месторасположение); 
	
	// Пункт 2.1
	Если ОдинЭтап Тогда
		// Удаляем
		НачалоЗакладки = Док.Bookmarks("Пункт21Несколько").Start;
		КонецЗакладки = Док.Bookmarks("Пункт21Несколько").End;
		Селекция.Start = НачалоЗакладки;
		Селекция.End = КонецЗакладки;
		Селекция.Cut(); 
		
		мРазноеКлиент.Заменить(Поиск, "%ПредУсловие%", мРаботаСДоговорами.ДлительностьВыполненияРаботСтрокой(ЭтапыДоговора[0].ДлительностьВыполненияРабот, ЭтапыДоговора[0].ВидДней)); 
		Док.Bookmarks("РезультатРаботы1Этап").Range.Text = ДобавитьТочку(ЭтапыДоговора[0].РезультатРаботы); 
		
	Иначе
		// Удаляем
		УдалитьЗакладку("Пункт21ОдинЭтап");
		УдалитьЗакладку("РезультатРаботы1Этап");
		
		// Запоминаем
		УдалитьЗакладку("Пункт21");
		
		й=ЭтапыДоговора.Количество()-1;
		Пока й >= 0 Цикл
			селекция.Start = НачалоЗакладки; // Начало вставки
			селекция.Collapse();             // Вставка, а не замещение
			селекция.Paste();
			НомерПодпункта = й+1;
			мРазноеКлиент.Заменить(Поиск, "%Подпункт21%", НомерПодпункта); 
			мРазноеКлиент.Заменить(Поиск, "%ПорядковыйЭтапа21%", мРаботаСДоговорами.ПорядковыйНомер(НомерПодпункта)); 
			мРазноеКлиент.Заменить(Поиск, "%ПорядковыйЭтапаРП%", мРаботаСДоговорами.ПорядковыйНомер(НомерПодпункта, 2)); 
			мРазноеКлиент.Заменить(Поиск, "%ПредУсловие%", мРаботаСДоговорами.ДлительностьВыполненияРаботСтрокой(ЭтапыДоговора[й].ДлительностьВыполненияРабот, ЭтапыДоговора[й].ВидДней)); 
			Док.Bookmarks("РезультатРаботы").Range.Text = ДобавитьТочку(ЭтапыДоговора[й].РезультатРаботы); 
			й=й-1;
		КонецЦикла; 
	КонецЕсли; 
	
	// Пункт 3.1
	// Номер прейскуранта
	Док.Bookmarks("НомерПрейскуранта").Range.Text = ПолучитьНомерПрейскуранта(СтруктураНашихРеквизитов); 
	
	// Стоимость
	РеквизитыЛьготы = мРазноеКлиент.ПолучитьЛьготуНДС(ЭтапыДоговора);
	ЛьготаНДС = РеквизитыЛьготы.ЛьготаНДС;
	СтавкаНДСДляПрописи = ПолучитьПредставлениеСтавкиНДС(РеквизитыЛьготы.СтавкаНДСДляПрописи);
	
    СтоимостьИтог = 0; 
    СуммаНДСИтог = 0; 
    СтоимостьСНДСИтог = 0; 

	мРазноеКлиент.Заменить(Поиск, "%ИзНих%", ", из них выполнение работ:"); 
	
	// Запоминаем
	УдалитьЗакладку("СтрокаТаблицы");
	
	ФорматНовыхЦен = "ЧДЦ=2; ЧРГ=' '; ЧН=-";
	
	СтоимостьИтог = 0; 
	СуммаНДСИтог = 0; 
	СтоимостьСНДСИтог = 0; 
	
	й=ЭтапыДоговора.Количество()-1;
	Пока й >= 0 Цикл
		селекция.Start = НачалоЗакладки; // Начало вставки
		селекция.Collapse();             // Вставка, а не замещение
		селекция.Paste();
		
		мРазноеКлиент.Заменить(Поиск, "НомерЭтапа", ЭтапыДоговора[й].НомерЭтапа); 
		Док.Bookmarks("НаименованиеРаботы").Range.Text = ДобавитьТочку(ЭтапыДоговора[й].НаименованиеРаботы); 
		Док.Bookmarks("ЕдиницаИзмерения").Range.Text = "учас- ток"; 
		Док.Bookmarks("КоличествоУчастков").Range.Text = ЭтапыДоговора[й].КоличествоУчастков; 
		Док.Bookmarks("СтавкаНДС").Range.Text = ПолучитьПредставлениеСтавкиНДС(ЭтапыДоговора[й].СтавкаНДС); 
		
		Стоимость = ЭтапыДоговора[й].Стоимость; 
		СуммаНДС = ЭтапыДоговора[й].СуммаНДС; 
		СтоимостьСНДС = ЭтапыДоговора[й].СтоимостьСНДС; 
		
		Док.Bookmarks("Стоимость").Range.Text = Формат(Стоимость, ФорматНовыхЦен); 
		Док.Bookmarks("СуммаНДС").Range.Text = Формат(СуммаНДС, ФорматНовыхЦен); 
		Док.Bookmarks("СтоимостьСНДС").Range.Text = Формат(СтоимостьСНДС, ФорматНовыхЦен); 
		
		СтоимостьИтог = СтоимостьИтог + Стоимость; 
		СуммаНДСИтог = СуммаНДСИтог + СуммаНДС; 
		СтоимостьСНДСИтог = СтоимостьСНДСИтог + СтоимостьСНДС; 
		
		й=й-1;
	КонецЦикла;
	
	мРазноеКлиент.Заменить(Поиск, "СтоимостьИтог", Формат(СтоимостьИтог, ФорматНовыхЦен)); 
	мРазноеКлиент.Заменить(Поиск, "СуммаНДСИтог", Формат(СуммаНДСИтог, ФорматНовыхЦен)); 
	мРазноеКлиент.Заменить(Поиск, "СтоимостьСНДСИтог", Формат(СтоимостьСНДСИтог, ФорматНовыхЦен)); 
	
	// Договор в рублях
	СтоимостьДоговора = мРаботаСДоговорами.СуммаЧисломИПрописью(СтоимостьСНДСИтог, РублиНовые);
	Если СуммаНДС > 0 Тогда
		СуммаНДСПрописьюПолная = мРаботаСДоговорами.СуммаЧисломИПрописью(СуммаНДСИтог, РублиНовые);
		СтоимостьДоговора = СтоимостьДоговора + ", в том числе НДС по ставке " + СтавкаНДСДляПрописи +"% в сумме " + СуммаНДСПрописьюПолная;
	КонецЕсли;

	Док.Bookmarks("СтоимостьДоговора").Range.Text = СтоимостьДоговора; 
	
	мРазноеКлиент.Заменить(Поиск, "ЛьготаНДС", ЛьготаНДС); 
	
	// Пункт 3.2
	Если ОдинЭтап Тогда
		мРазноеКлиент.Заменить(Поиск, "%Доля%", Заказчики.Количество()); 
		ВывестиПоле(Док, "%МоментОплаты32_1Этап%", ЭтапыДоговора[0].МоментОплаты, "подписания настоящего договора");
		
		// Удаляем
		УдалитьЗакладку("Пункт32Несколько");
		УдалитьЗакладку("ПодПункт32");
		
	Иначе
		// Удаляем
		УдалитьЗакладку("Пункт32Один");
		
		// Запоминаем
		УдалитьЗакладку("ПодПункт32");
		
		мРазноеКлиент.Заменить(Поиск, "%ИзНих%", ", из них выполнение работ:"); 
		
		й=ЭтапыДоговора.Количество()-1;
		Пока й >= 0 Цикл
			селекция.Start = НачалоЗакладки; // Начало вставки
			селекция.Collapse();             // Вставка, а не замещение
			селекция.Paste();
			НомерПодпункта = й+1;
			мРазноеКлиент.Заменить(Поиск, "%Подпункт32%", НомерПодпункта); 
			мРазноеКлиент.Заменить(Поиск, "%Порядковый32%", мРаботаСДоговорами.ПорядковыйНомер(НомерПодпункта, 3)); 
			мРазноеКлиент.Заменить(Поиск, "%Доля%", Заказчики.Количество()); 
			ВывестиПоле(Док, "%МоментОплаты32%", ЭтапыДоговора[й].МоментОплаты, "подписания настоящего договора");
			й=й-1;
		КонецЦикла; 
	КонецЕсли; 
	
	мРазноеКлиент.Заменить(Поиск, "КолЭкземпляров", нРег(мРаботаСДоговорами.КоличествоЭкземпляровДляДоговоров(Заказчики.Количество()+1))); 
	
	// Подписи документа
	ВывестиПодписи(Док, СтруктураНашихРеквизитов, Подписи);
	
	// Вывод на печать или в файл
	ВывестиДокумент();
	
КонецПроцедуры 

&НаКлиенте
Процедура ПечатьДоговорФизЛицТопосъемка()
	
	ПолучитьОбщиеДанныеДоговора();
	
	Подписи = ПолучитьПодписиПодрядчика(Договор);
	СтруктураНашихРеквизитов = мРаботаСДоговорами.ПолучитьНашиРеквизиты(Договор);
	Город = мРазное.НашГород(СтруктураНашихРеквизитов);
	
	ИнициализироватьДокументWord();
	
	// Заполнение договора
	Если ГородБазы = "Минск" ИЛИ ГородБазы = "Прилуки" Тогда

		мРазноеКлиент.Заменить(Поиск, "%ТелефонНачОтдела%", ТелефонИсполнителя);  
		
		//Штрихкод
		ВставитьШтрихКод();
	КонецЕсли; 

	РегНомер = НомерДоговора;
	ДатаРег = Формат(ДатаДоговора,"ДЛФ=DD");
	мРазноеКлиент.Заменить(Поиск, "РегНомер", РегНомер);  
	мРазноеКлиент.Заменить(Поиск, "ДатаРег", ДатаРег); 
	мРазноеКлиент.Заменить(Поиск, "%Город", Город); 
	
	// Руководители
	Док.Bookmarks("Руководитель").Range.Text = ПолучитьСтрокуРуководителя(Подписи); 
	Док.Bookmarks("Доверенность").Range.Text = ПолучитьДоверенность(Подписи.Подписал, ДатаДоговора); 
	мРазноеКлиент.Заменить(Поиск, "%Свидетельство%", СвидетельствоОГосРегистрации); 
	мРазноеКлиент.Заменить(Поиск, "%Заказчик%", Заказчики[0].ПолноеНаименование); 
	
	ОдинЭтап = Ложь;
	Если ЭтапыДоговора.Количество() = 1 Тогда
		ОдинЭтап = Истина;	
	КонецЕсли; 
	
	// Пункт 1.1 ПереченьРабот
	ПереченьРабот = " - " + ЭтапыДоговора[0].НаименованиеРаботы;
	Док.Bookmarks("ПереченьРабот").Range.Text = ПереченьРабот; 
	Док.Bookmarks("Цель").Range.Text = ПолучитьЦель(); 
	Док.Bookmarks("Месторасположение").Range.Text = ДобавитьТочку(ЭтапыДоговора[0].Месторасположение); 
	
	// Пункт 2.1
	мРазноеКлиент.Заменить(Поиск, "%ПредУсловие%", мРаботаСДоговорами.ДлительностьВыполненияРаботСтрокой(ЭтапыДоговора[0].ДлительностьВыполненияРабот, ЭтапыДоговора[0].ВидДней)); 
	Док.Bookmarks("РезультатРаботы1Этап").Range.Text = ДобавитьТочку(ЭтапыДоговора[0].РезультатРаботы); 
	
	// Стоимость
	Стоимость = ЭтапыДоговора[0].Стоимость; 
	СуммаНДС = ЭтапыДоговора[0].СуммаНДС; 
	СтоимостьСНДС = ЭтапыДоговора[0].СтоимостьСНДС; 
	
	// Льгота
	РеквизитыЛьготы = мРазноеКлиент.ПолучитьЛьготуНДС(ЭтапыДоговора);
	ЛьготаНДС = РеквизитыЛьготы.ЛьготаНДС;
	СтавкаНДСДляПрописи = ПолучитьПредставлениеСтавкиНДС(РеквизитыЛьготы.СтавкаНДСДляПрописи);
	
	// Договор в рублях
	СтоимостьДоговора = мРаботаСДоговорами.СуммаЧисломИПрописью(СтоимостьСНДС, РублиНовые);
	Если СуммаНДС > 0 Тогда
		СуммаНДСПрописьюПолная = мРаботаСДоговорами.СуммаЧисломИПрописью(СуммаНДС, РублиНовые);
		СтоимостьДоговора = СтоимостьДоговора + ", в том числе НДС по ставке " + СтавкаНДСДляПрописи +" в сумме " + СуммаНДСПрописьюПолная;
	КонецЕсли;

	мРазноеКлиент.Заменить(Поиск, "СтоимостьДоговора", СтоимостьДоговора); 
	
	мРазноеКлиент.Заменить(Поиск, "ЛьготаНДС", Символы.ПС + ЛьготаНДС); 

	Док.Bookmarks("СтоимостьДоговора").Range.Text = СтоимостьДоговора; 
	
	// Подписи документа
	ВывестиПодписи(Док, СтруктураНашихРеквизитов, Подписи);
	
	// Вывод на печать или в файл
	ВывестиДокумент();
	
КонецПроцедуры 

Функция ВыполнитьЗамену(знач Object, Параметр, Значение)
  СтрокаПоиска = "[" + Параметр + "]";
  СтрокаЗамены = Строка(Значение);
//Необходимо выделить областей, в которой мы осуществляем замену
  Object.Select();
//Получаем выделенную область
  Selection = Object.Application.Selection;
//Найдем все вхождения параметра и заменим его на нужное нам значение
  FindObject = Selection.Find;
  FindObject.ClearFormatting();
  Пока FindObject.Execute(СтрокаПоиска) Цикл
    Если ПустаяСтрока(СтрокаЗамены) Тогда
      Selection.Delete();
    Иначе
      Selection.TypeText(СтрокаЗамены);
    КонецЕсли;
  КонецЦикла;
//Отменим выделение
  Selection.Collapse();
КонецФункции

&НаКлиенте
Процедура ПечатьДоговорЮрЛиц()
	
	ПолучитьОбщиеДанныеДоговора();
	
	Подписи = ПолучитьПодписиПодрядчика(Договор);
	СтруктураНашихРеквизитов = мРаботаСДоговорами.ПолучитьНашиРеквизиты(Договор);
	Город = мРазное.НашГород(СтруктураНашихРеквизитов);
	
	ИнициализироватьДокументWord();
	
	// Заполнение договора
	Если ГородБазы = "Минск" ИЛИ ГородБазы = "Прилуки" Тогда
		мРазноеКлиент.Заменить(Поиск, "%ТелефонНачОтдела%", ТелефонИсполнителя);  
		
		//Штрихкод
		ВставитьШтрихКод();
	КонецЕсли; 
	
	РегНомер = НомерДоговора;
	ДатаРег = Формат(ДатаДоговора,"ДЛФ=DD");
	мРазноеКлиент.Заменить(Поиск, "РегНомер", РегНомер);  
	мРазноеКлиент.Заменить(Поиск, "ДатаРег", ДатаРег); 
	мРазноеКлиент.Заменить(Поиск, "%Город", Город); 
	
	// Руководители
	Док.Bookmarks("Руководитель").Range.Text = ПолучитьСтрокуРуководителя(Подписи); 
	Док.Bookmarks("Доверенность").Range.Text = ПолучитьДоверенность(Подписи.Подписал, ДатаДоговора); 
	мРазноеКлиент.Заменить(Поиск, "%Свидетельство%", СвидетельствоОГосРегистрации); 
	мРазноеКлиент.Заменить(Поиск, "%Заказчик%", Заказчики[0].ПолноеНаименование); 
	Док.Bookmarks("РуководительЗаказчик").Range.Text = ПолучитьСтрокуРуководителяЗаказчика(Заказчики[0].ПодписалОтКорреспондента); 
	
	//Колонтитулы
	ГородБазы = мРазное.ПолучитьГородБазы();
	Если ГородБазы = "Брест" Тогда
		Если Не СобственныеСредства Тогда
			Если ЗначениеЗаполнено(Подписи.ПодписалКратко) Тогда
				Док.Bookmarks("ПодписьНижнийКолонтитул").Range.Text = " _______________________ "+Подписи.ПодписалКратко; 
			Иначе
				Док.Bookmarks("ПодписьНижнийКолонтитул").Range.Text = ""; 
			КонецЕсли;
		Иначе
			Док.Bookmarks("ПодписьНижнийКолонтитул").Range.Text = ""; 
		КонецЕсли; 
	КонецЕсли; 
	
	ОдинЭтап = Ложь;
	Если ЭтапыДоговора.Количество() = 1 Тогда
		ОдинЭтап = Истина;	
	КонецЕсли; 
	
	// Пункт 1.1 ПереченьРабот
	ПереченьРабот = "";
	Если ОдинЭтап Тогда
		ПодПунктРабот = "1.2";
		ПереченьРабот = " - " + ЭтапыДоговора[0].НаименованиеРаботы;
	Иначе
		ПодПунктРабот = "1.3";
	    ПереченьРабот = ":"+Символы.ПС;
        
        СпРабот = ПолучитьСписокРабот();
		Для каждого Стр Из СпРабот Цикл
			ПереченьРабот = ПереченьРабот + "- "+Стр.Представление+";"+Символы.ПС;
		КонецЦикла; 
		ПереченьРабот = Лев(ПереченьРабот, СтрДлина(ПереченьРабот)-2);
	КонецЕсли;
	Док.Bookmarks("ПереченьРабот").Range.Text = ПереченьРабот; 
    
	
	// Пункт 1.2
	Если ОдинЭтап Тогда
		// Удаляем
		УдалитьЗакладку("Пункт12");
	Иначе
		// оставляем	
		УдалитьЗакладку("Подпункт12");
        
        ц = СпРабот.Количество()-1;
        Пока ц >= 0 Цикл
            НомерПодпункта = ц+1;
            ПорядковыйЭтапа = "";
            СтрокаЭтапов = "этап";
            
            й=ЭтапыДоговора.Количество()-1;
            Пока й >= 0 Цикл
                Если СпРабот[ц].Значение = ЭтапыДоговора[й].ВидРабот Тогда
                    Если СтрНайти(ПорядковыйЭтапа, " и ") > 0 Тогда
                        // Это третье и последующие дубли
                    	ПорядковыйЭтапа = мРазноеКлиент.ПорядковыйНомер(й+1)+", "+ПорядковыйЭтапа;
                    ИначеЕсли ПорядковыйЭтапа = "" Тогда
                        // Это первое вхождение
                    	ПорядковыйЭтапа = мРазноеКлиент.ПорядковыйНомер(й+1);
                    Иначе
                        // Это второе
                     	ПорядковыйЭтапа = мРазноеКлиент.ПорядковыйНомер(й+1)+" и "+ПорядковыйЭтапа;
                        СтрокаЭтапов = "этапы";
                    КонецЕсли; 
                КонецЕсли;
                й=й-1;
            КонецЦикла; 
            ПорядковыйЭтапа =  ВРег(Лев(ПорядковыйЭтапа, 1))+Сред(НРег(ПорядковыйЭтапа), 2);
            селекция.Start = НачалоЗакладки; // Начало вставки
            селекция.Collapse();             // Вставка, а не замещение
            селекция.Paste();
            //НомерПодпункта = й+1;
            мРазноеКлиент.Заменить(Поиск, "%Подпункт12%", НомерПодпункта); 
            мРазноеКлиент.Заменить(Поиск, "%ПорядковыйЭтапа%", ПорядковыйЭтапа+" "+СтрокаЭтапов); 
            мРазноеКлиент.Заменить(Поиск, "%ВидРаботЭтапа%", ДобавитьТочку(СпРабот[ц].Представление)); 
            ц=ц-1;
        КонецЦикла; 
	КонецЕсли; 
	
	// Оставшиеся пункты 1 раздела
	Если ОдинЭтап Тогда
		мРазноеКлиент.Заменить(Поиск, "%ПодПунктАдрес%", "1.3"); 
		мРазноеКлиент.Заменить(Поиск, "%ПодПунктОбъем%", "1.4"); 
		мРазноеКлиент.Заменить(Поиск, "%ПодПунктДанные%", "1.5"); 
	Иначе
		мРазноеКлиент.Заменить(Поиск, "%ПодПунктАдрес%", "1.4"); 
		мРазноеКлиент.Заменить(Поиск, "%ПодПунктОбъем%", "1.5"); 
		мРазноеКлиент.Заменить(Поиск, "%ПодПунктДанные%", "1.6"); 
	КонецЕсли; 
	
	мРазноеКлиент.Заменить(Поиск, "%ПодПунктРабот%", ПодПунктРабот); 
	Док.Bookmarks("ОбъектРабот").Range.Text = ДобавитьТочку(СокрЛП(ЭтапыДоговора[0].ОбъектРабот)); 
	Док.Bookmarks("Месторасположение").Range.Text = ДобавитьТочку(ЭтапыДоговора[0].Месторасположение); 
	
	// Пункт 2.1
	Если ОдинЭтап Тогда
		// Удаляем
		НачалоЗакладки = Док.Bookmarks("Пункт21Несколько").Start;
		КонецЗакладки = Док.Bookmarks("Пункт21Несколько").End;
		Селекция.Start = НачалоЗакладки;
		Селекция.End = КонецЗакладки;
		Селекция.Cut(); 
		
		мРазноеКлиент.Заменить(Поиск, "%ПредУсловие%", мРаботаСДоговорами.ДлительностьВыполненияРаботСтрокой(ЭтапыДоговора[0].ДлительностьВыполненияРабот, ЭтапыДоговора[0].ВидДней)); 
		Док.Bookmarks("РезультатРаботы1Этап").Range.Text = ДобавитьТочку(ЭтапыДоговора[0].РезультатРаботы); 
		
	Иначе
		// Удаляем
		УдалитьЗакладку("Пункт21ОдинЭтап");
		УдалитьЗакладку("РезультатРаботы1Этап");
		
		// Запоминаем
		УдалитьЗакладку("Пункт21");
		
        ц = СпРабот.Количество()-1;
        Пока ц >= 0 Цикл
            НомерПодпункта = ц+1;
            ПорядковыйЭтапа21 = "";
            ПорядковыйЭтапаРП = "";
            СтрокаЭтапов21 = "этап";
            СтрокаЭтаповРП = "этапа";
            ПредУсловие = "";
            РезультатРаботы = "";
            
            й=ЭтапыДоговора.Количество()-1;
            Пока й >= 0 Цикл
                Если СпРабот[ц].Значение = ЭтапыДоговора[й].ВидРабот Тогда
                    Если СтрНайти(ПорядковыйЭтапа21, " и ") > 0 Тогда
                        // Это третье и последующие дубли
                        ПорядковыйЭтапа21 = мРазноеКлиент.ПорядковыйНомер(й+1)+", "+ПорядковыйЭтапа21;
                        ПорядковыйЭтапаРП = мРазноеКлиент.ПорядковыйНомер(й+1, 2)+", "+ПорядковыйЭтапаРП;
                    ИначеЕсли ПорядковыйЭтапа21 = "" Тогда
                        // Это первое вхождение
                        ПорядковыйЭтапа21 = мРазноеКлиент.ПорядковыйНомер(й+1);
                        ПорядковыйЭтапаРП = мРазноеКлиент.ПорядковыйНомер(й+1, 2);
                    Иначе
                        // Это второе
                        ПорядковыйЭтапа21 = мРазноеКлиент.ПорядковыйНомер(й+1)+" и "+ПорядковыйЭтапа21;
                        ПорядковыйЭтапаРП = мРазноеКлиент.ПорядковыйНомер(й+1, 2)+" и "+ПорядковыйЭтапаРП;
                        СтрокаЭтапов21 = "этапы";
                        СтрокаЭтаповРП = "этапов";
                    КонецЕсли;
                    Если ПредУсловие = "" Тогда
                        ПредУсловие = мРазноеКлиент.ДлительностьВыполненияРаботСтрокой(ЭтапыДоговора[й].ДлительностьВыполненияРабот, ЭтапыДоговора[й].ВидДней);
                    КонецЕсли;
                    Если РезультатРаботы = "" Тогда
                        РезультатРаботы = ЭтапыДоговора[й].РезультатРаботы;
                    КонецЕсли;
                КонецЕсли;
                й=й-1;
            КонецЦикла; 
            ПорядковыйЭтапа21 =  ВРег(Лев(ПорядковыйЭтапа21, 1))+Сред(НРег(ПорядковыйЭтапа21), 2);
            селекция.Start = НачалоЗакладки; // Начало вставки
            селекция.Collapse();             // Вставка, а не замещение
            селекция.Paste();
            //НомерПодпункта = й+1;
            мРазноеКлиент.Заменить(Поиск, "%Подпункт21%", НомерПодпункта); 
            мРазноеКлиент.Заменить(Поиск, "%ПорядковыйЭтапа21%", ПорядковыйЭтапа21+" "+СтрокаЭтапов21); 
            мРазноеКлиент.Заменить(Поиск, "%ПорядковыйЭтапаРП%", ПорядковыйЭтапаРП+" "+СтрокаЭтаповРП); 
            мРазноеКлиент.Заменить(Поиск, "%ПредУсловие%", ПредУсловие); 
            Док.Bookmarks("РезультатРаботы").Range.Text = ДобавитьТочку(РезультатРаботы); 
            ц=ц-1;
        КонецЦикла; 
        
	КонецЕсли; 
	
	// Пункт 3.1
	// Стоимость
	РеквизитыЛьготы = мРазноеКлиент.ПолучитьЛьготуНДС(ЭтапыДоговора);
	ЛьготаНДС = РеквизитыЛьготы.ЛьготаНДС;
	СтавкаНДСДляПрописи = ПолучитьПредставлениеСтавкиНДС(РеквизитыЛьготы.СтавкаНДСДляПрописи);
	
	СтоимостьДоговора = мРаботаСДоговорами.СуммаЧисломИПрописью(ЭтапыДоговора.Итог("СтоимостьСНДС"), ВалютаДоговора);
	Если ЭтапыДоговора.Итог("СуммаНДС") > 0 Тогда
		СуммаНДСПрописьюПолная = мРаботаСДоговорами.СуммаЧисломИПрописью(ЭтапыДоговора.Итог("СуммаНДС"), ВалютаДоговора);
		СтоимостьДоговора = СтоимостьДоговора + ", в том числе НДС по ставке " + СтавкаНДСДляПрописи +"% в сумме " + СуммаНДСПрописьюПолная;
	КонецЕсли;
	Док.Bookmarks("СтоимостьДоговора").Range.Text = СтоимостьДоговора; 
	
	Если ОдинЭтап Тогда
		мРазноеКлиент.Заменить(Поиск, "%ИзНих%", "."); 
		
		// Удаляем
		УдалитьЗакладку("ТаблицаДоговора");
		
	Иначе
		мРазноеКлиент.Заменить(Поиск, "%ИзНих%", ", из них выполнение работ:"); 
		
		// Запоминаем
		УдалитьЗакладку("СтрокаТаблицы");
		
		СтрокаФорматаЦен = ?(СКопейками, "ЧДЦ=2; ЧРД=.; ЧГ=3,0","ЧДЦ=; ЧГ=3,0"); 
		ФорматСтарыхЦен = "ЧРГ=' '; ЧН=-";
		ФорматНовыхЦен = "ЧДЦ=2; ЧРГ=' '; ЧН=-";
        
        Если ДатаДоговора < Дата(2016, 7, 1) Тогда
            СтрокаФорматаЦен = ФорматСтарыхЦен;
        Иначе	
            СтрокаФорматаЦен = ФорматНовыхЦен;
        КонецЕсли; 
		
		й=ЭтапыДоговора.Количество()-1;
		Пока й >= 0 Цикл
			селекция.Start = НачалоЗакладки; // Начало вставки
			селекция.Collapse();             // Вставка, а не замещение
			селекция.Paste();
			НомерПодпункта = й+1;
			мРазноеКлиент.Заменить(Поиск, "%ЭтапыРабот%", ДобавитьТочку(ЭтапыДоговора[й].НаименованиеРаботы)); 
			мРазноеКлиент.Заменить(Поиск, "%СтоимостьБезНДС%", Формат(ЭтапыДоговора[й].Стоимость, СтрокаФорматаЦен)); 
			мРазноеКлиент.Заменить(Поиск, "%СтавкаНДС%", ПолучитьПредставлениеСтавкиНДС(ЭтапыДоговора[й].СтавкаНДС)); 
			мРазноеКлиент.Заменить(Поиск, "%СуммаНДС%", Формат(ЭтапыДоговора[й].СуммаНДС, СтрокаФорматаЦен)); 
			мРазноеКлиент.Заменить(Поиск, "%Стоимость%", Формат(ЭтапыДоговора[й].СтоимостьСНДС, СтрокаФорматаЦен)); 
			й=й-1;
		КонецЦикла;
		// Всего
		мРазноеКлиент.Заменить(Поиск, "%СтоимостьБезНДСВсего%", Формат(ЭтапыДоговора.Итог("Стоимость"), СтрокаФорматаЦен)); 
		мРазноеКлиент.Заменить(Поиск, "%СуммаНДСВсего%", Формат(ЭтапыДоговора.Итог("СуммаНДС"), СтрокаФорматаЦен)); 
		мРазноеКлиент.Заменить(Поиск, "%СтоимостьВсего%", Формат(ЭтапыДоговора.Итог("СтоимостьСНДС"), СтрокаФорматаЦен)); 
	КонецЕсли; 
	
	Док.Bookmarks("ЛьготаНДС").Range.Text = ЛьготаНДС; 
	
	Док.Bookmarks("ИсточникФинанс").Range.Text = ИсточникФинанс; 
	
	// Пункт 3.5
	Если ОдинЭтап Тогда
		мРазноеКлиент.Заменить(Поиск, "%ПроцентПредоплаты%", ЭтапыДоговора[0].ПроцентПредоплаты); 
		ВывестиПоле(Док, "%МоментОплаты35_1Этап%", СокрЛП(ЭтапыДоговора[0].МоментОплаты), "подписания настоящего договора");
		
		// Удаляем
		УдалитьЗакладку("Пункт35Несколько");
		УдалитьЗакладку("ПодПункт35");
		
	Иначе
		// Удаляем
		УдалитьЗакладку("Пункт35Один");
		
		// Запоминаем
		УдалитьЗакладку("ПодПункт35");
		
		мРазноеКлиент.Заменить(Поиск, "%ИзНих%", ", из них выполнение работ:"); 
		СтрокаФорматаЦен = ?(СКопейками, "ЧДЦ=2; ЧРД=.; ЧГ=3,0","ЧДЦ=; ЧГ=3,0"); 
		
        ц = СпРабот.Количество()-1;
        Пока ц >= 0 Цикл
            НомерПодпункта = ц+1;
            ПорядковыйЭтапа35 = "";
            СтрокаЭтапов35 = "этапу";
            ПроцентПредоплаты = "";
            МоментОплаты35 = "";
            
            й=ЭтапыДоговора.Количество()-1;
            Пока й >= 0 Цикл
                Если СпРабот[ц].Значение = ЭтапыДоговора[й].ВидРабот Тогда
                    Если СтрНайти(ПорядковыйЭтапа35, " и ") > 0 Тогда
                        // Это третье и последующие дубли
                        ПорядковыйЭтапа35 = мРазноеКлиент.ПорядковыйНомер(й+1, 3)+", "+ПорядковыйЭтапа35;
                    ИначеЕсли ПорядковыйЭтапа35 = "" Тогда
                        // Это первое вхождение
                        ПорядковыйЭтапа35 = мРазноеКлиент.ПорядковыйНомер(й+1, 3);
                    Иначе
                        // Это второе
                        ПорядковыйЭтапа35 = мРазноеКлиент.ПорядковыйНомер(й+1, 3)+" и "+ПорядковыйЭтапа35;
                        СтрокаЭтапов35 = "этапам";
                    КонецЕсли;
                    Если ПроцентПредоплаты = "" Тогда
                        ПроцентПредоплаты = ЭтапыДоговора[й].ПроцентПредоплаты;
                    КонецЕсли;
                    Если МоментОплаты35 = "" Тогда
                        МоментОплаты35 = СокрЛП(ЭтапыДоговора[й].МоментОплаты);
                    КонецЕсли;
                КонецЕсли;
                й=й-1;
            КонецЦикла; 
            селекция.Start = НачалоЗакладки; // Начало вставки
            селекция.Collapse();             // Вставка, а не замещение
            селекция.Paste();
            //НомерПодпункта = й+1;
            мРазноеКлиент.Заменить(Поиск, "%Подпункт35%", НомерПодпункта); 
            мРазноеКлиент.Заменить(Поиск, "%Порядковый35%", ПорядковыйЭтапа35+" "+СтрокаЭтапов35); 
            мРазноеКлиент.Заменить(Поиск, "%ПроцентПредоплаты%", ПроцентПредоплаты); 
			ВывестиПоле(Док, "%МоментОплаты35%", МоментОплаты35, "подписания настоящего договора");
            ц=ц-1;
        КонецЦикла; 
	КонецЕсли; 
	
	// Подписи документа
	ВывестиПодписи(Док, СтруктураНашихРеквизитов, Подписи);
	
	// Вывод на печать или в файл
	ВывестиДокумент();
	
КонецПроцедуры // ПечатьДоговорТКП()

&НаКлиенте
Процедура ПечатьДоговорЮрЛицВыкопировка()
	
	ПолучитьОбщиеДанныеДоговора();
	
	Подписи = ПолучитьПодписиПодрядчика(Договор);
	СтруктураНашихРеквизитов = мРаботаСДоговорами.ПолучитьНашиРеквизиты(Договор);
	Город = мРазное.НашГород(СтруктураНашихРеквизитов);
	
	ИнициализироватьДокументWord();
	
	// Заполнение договора
	Если ГородБазы = "Минск" ИЛИ ГородБазы = "Прилуки" Тогда
		мРазноеКлиент.Заменить(Поиск, "%ТелефонНачОтдела%", ТелефонИсполнителя);  
		
		//Штрихкод
		ВставитьШтрихКод();
	КонецЕсли; 
	
	РегНомер = НомерДоговора;
	ДатаРег = Формат(ДатаДоговора,"ДЛФ=DD");
	мРазноеКлиент.Заменить(Поиск, "РегНомер", РегНомер);  
	мРазноеКлиент.Заменить(Поиск, "ДатаРег", ДатаРег); 
	мРазноеКлиент.Заменить(Поиск, "%Город", Город); 
	
	// Руководители
	мРазноеКлиент.Заменить(Поиск, "Руководитель", ПолучитьСтрокуРуководителя(Подписи)); 
	мРазноеКлиент.Заменить(Поиск, "Доверенность", ПолучитьДоверенность(Подписи.Подписал, ДатаДоговора)); 
	мРазноеКлиент.Заменить(Поиск, "%Свидетельство%", СвидетельствоОГосРегистрации); 
	мРазноеКлиент.Заменить(Поиск, "%Заказчик%", Заказчики[0].ПолноеНаименование); 
	мРазноеКлиент.Заменить(Поиск, "РуководительЗаказчик", ПолучитьСтрокуРуководителяЗаказчика(Заказчики[0].ПодписалОтКорреспондента)); 
	
	//Колонтитулы
	ГородБазы = мРазное.ПолучитьГородБазы();
	ЗаменаПодписиНижнегоКолонтитула = "";
	Если ГородБазы = "Брест" И Не СобственныеСредства И ЗначениеЗаполнено(Подписи.ПодписалКратко) Тогда
		ЗаменаПодписиНижнегоКолонтитула = " _______________________ "+Подписи.ПодписалКратко;
	КонецЕсли; 
	мРазноеКлиент.Заменить(Поиск, "ПодписьНижнийКолонтитул", ""); 
	
	// Пункты 1.1 - 1.3
	ПереченьРабот = "- " + НРег(ЭтапыДоговора[0].НаименованиеРаботы);
	мРазноеКлиент.Заменить(Поиск, "ПереченьРабот", ПереченьРабот); 
	мРазноеКлиент.Заменить(Поиск, "ОбъектРабот", ДобавитьТочку(ЭтапыДоговора[0].ОбъектРабот)); 
	мРазноеКлиент.Заменить(Поиск, "Месторасположение", ДобавитьТочку(ЭтапыДоговора[0].Месторасположение)); 

	// Пункт 2.1
	мРазноеКлиент.Заменить(Поиск, "%ПредУсловие%", мРаботаСДоговорами.ДлительностьВыполненияРаботСтрокой(ЭтапыДоговора[0].ДлительностьВыполненияРабот, ЭтапыДоговора[0].ВидДней)); 
	мРазноеКлиент.Заменить(Поиск, "РезультатРаботы1Этап", ДобавитьТочку(ЭтапыДоговора[0].РезультатРаботы)); 
	
	// Пункт 3.1
	// Стоимость
	РеквизитыЛьготы = мРазноеКлиент.ПолучитьЛьготуНДС(ЭтапыДоговора);
	ЛьготаНДС = РеквизитыЛьготы.ЛьготаНДС;
	СтавкаНДСДляПрописи = ПолучитьПредставлениеСтавкиНДС(РеквизитыЛьготы.СтавкаНДСДляПрописи);
	
	СтоимостьДоговора = мРаботаСДоговорами.СуммаЧисломИПрописью(ЭтапыДоговора.Итог("СтоимостьСНДС"), ВалютаДоговора);
	Если ЭтапыДоговора.Итог("СуммаНДС") > 0 Тогда
		СуммаНДСПрописьюПолная = мРаботаСДоговорами.СуммаЧисломИПрописью(ЭтапыДоговора.Итог("СуммаНДС"), ВалютаДоговора);
		СтоимостьДоговора = СтоимостьДоговора + ", в том числе НДС по ставке " + СтавкаНДСДляПрописи +"% в сумме " + СуммаНДСПрописьюПолная;
	КонецЕсли;
	мРазноеКлиент.Заменить(Поиск, "СтоимостьДоговора", СтоимостьДоговора); 
	мРазноеКлиент.Заменить(Поиск, "ЛьготаНДС", ЛьготаНДС); 
	мРазноеКлиент.Заменить(Поиск, "ИсточникФинанс", ИсточникФинанс); 
	
	// Пункт 3.5
	мРазноеКлиент.Заменить(Поиск, "%ПроцентПредоплаты%", ЭтапыДоговора[0].ПроцентПредоплаты); 
	ВывестиПоле(Док, "%МоментОплаты35_1Этап%", СокрЛП(ЭтапыДоговора[0].МоментОплаты), "подписания настоящего договора");
	
	// Подписи документа
	ВывестиПодписи(Док, СтруктураНашихРеквизитов, Подписи);
	
	// Вывод на печать или в файл
	ВывестиДокумент();
	
КонецПроцедуры // 

&НаКлиенте
Процедура ПечатьДоговорЮрЛицТопосъемка()
	
	ПолучитьОбщиеДанныеДоговора();
	
	Подписи = ПолучитьПодписиПодрядчика(Договор);
	СтруктураНашихРеквизитов = мРаботаСДоговорами.ПолучитьНашиРеквизиты(Договор);
	Город = мРазное.НашГород(СтруктураНашихРеквизитов);
	
	ИнициализироватьДокументWord();
	
	// Заполнение договора
	Если ГородБазы = "Минск" ИЛИ ГородБазы = "Прилуки" Тогда
		мРазноеКлиент.Заменить(Поиск, "%ТелефонНачОтдела%", ТелефонИсполнителя);  
		
		//Штрихкод
		ВставитьШтрихКод();
	КонецЕсли; 
	
	РегНомер = НомерДоговора;
	ДатаРег = Формат(ДатаДоговора,"ДЛФ=DD");
	мРазноеКлиент.Заменить(Поиск, "РегНомер", РегНомер);  
	мРазноеКлиент.Заменить(Поиск, "ДатаРег", ДатаРег); 
	мРазноеКлиент.Заменить(Поиск, "%Город", Город); 
	
	// Руководители
	мРазноеКлиент.Заменить(Поиск, "Руководитель", ПолучитьСтрокуРуководителя(Подписи)); 
	мРазноеКлиент.Заменить(Поиск, "Доверенность", ПолучитьДоверенность(Подписи.Подписал, ДатаДоговора)); 
	мРазноеКлиент.Заменить(Поиск, "%Свидетельство%", СвидетельствоОГосРегистрации); 
	мРазноеКлиент.Заменить(Поиск, "%Заказчик%", Заказчики[0].ПолноеНаименование); 
	мРазноеКлиент.Заменить(Поиск, "РуководительЗаказчик", ПолучитьСтрокуРуководителяЗаказчика(Заказчики[0].ПодписалОтКорреспондента)); 
	
	//Колонтитулы
	ГородБазы = мРазное.ПолучитьГородБазы();
	ЗаменаПодписиНижнегоКолонтитула = "";
	Если ГородБазы = "Брест" И Не СобственныеСредства И ЗначениеЗаполнено(Подписи.ПодписалКратко) Тогда
		ЗаменаПодписиНижнегоКолонтитула = " _______________________ "+Подписи.ПодписалКратко;
	КонецЕсли; 
	мРазноеКлиент.Заменить(Поиск, "ПодписьНижнийКолонтитул", ""); 
	
	// Пункты 1.1 - 1.3
	ПереченьРабот = "- " + НРег(ЭтапыДоговора[0].НаименованиеРаботы);
	мРазноеКлиент.Заменить(Поиск, "ПереченьРабот", ПереченьРабот); 
	мРазноеКлиент.Заменить(Поиск, "ОбъектРабот", ДобавитьТочку(ЭтапыДоговора[0].ОбъектРабот)); 
	мРазноеКлиент.Заменить(Поиск, "Месторасположение", ДобавитьТочку(ЭтапыДоговора[0].Месторасположение)); 

	// Пункт 2.1
	мРазноеКлиент.Заменить(Поиск, "%ПредУсловие%", мРаботаСДоговорами.ДлительностьВыполненияРаботСтрокой(ЭтапыДоговора[0].ДлительностьВыполненияРабот, ЭтапыДоговора[0].ВидДней)); 
	мРазноеКлиент.Заменить(Поиск, "РезультатРаботы1Этап", ДобавитьТочку(ЭтапыДоговора[0].РезультатРаботы)); 
	
	// Пункт 3.1
	// Стоимость
	РеквизитыЛьготы = мРазноеКлиент.ПолучитьЛьготуНДС(ЭтапыДоговора);
	ЛьготаНДС = РеквизитыЛьготы.ЛьготаНДС;
	СтавкаНДСДляПрописи = ПолучитьПредставлениеСтавкиНДС(РеквизитыЛьготы.СтавкаНДСДляПрописи);
	
	СтоимостьДоговора = мРаботаСДоговорами.СуммаЧисломИПрописью(ЭтапыДоговора.Итог("СтоимостьСНДС"), ВалютаДоговора);
	Если ЭтапыДоговора.Итог("СуммаНДС") > 0 Тогда
		СуммаНДСПрописьюПолная = мРаботаСДоговорами.СуммаЧисломИПрописью(ЭтапыДоговора.Итог("СуммаНДС"), ВалютаДоговора);
		СтоимостьДоговора = СтоимостьДоговора + ", в том числе НДС по ставке " + СтавкаНДСДляПрописи +"% в сумме " + СуммаНДСПрописьюПолная;
	КонецЕсли;
	мРазноеКлиент.Заменить(Поиск, "СтоимостьДоговора", СтоимостьДоговора); 
	мРазноеКлиент.Заменить(Поиск, "ЛьготаНДС", ЛьготаНДС); 
	мРазноеКлиент.Заменить(Поиск, "ИсточникФинанс", ИсточникФинанс); 
	
	// Пункт 3.5
	мРазноеКлиент.Заменить(Поиск, "%ПроцентПредоплаты%", ЭтапыДоговора[0].ПроцентПредоплаты); 
	ВывестиПоле(Док, "%МоментОплаты35_1Этап%", СокрЛП(ЭтапыДоговора[0].МоментОплаты), "подписания настоящего договора");
	
	// Подписи документа
	ВывестиПодписи(Док, СтруктураНашихРеквизитов, Подписи);
	
	// Вывод на печать или в файл
	ВывестиДокумент();
	
КонецПроцедуры // 

&НаКлиенте
Процедура ПечатьДоговорЮрЛицПИРУбытки()
	
	ПолучитьОбщиеДанныеДоговора();
	
	Подписи = ПолучитьПодписиПодрядчика(Договор);
	СтруктураНашихРеквизитов = мРаботаСДоговорами.ПолучитьНашиРеквизиты(Договор);
	Город = мРазное.НашГород(СтруктураНашихРеквизитов);
	
	ИнициализироватьДокументWord();
	
	// Заполнение договора
	Если ГородБазы = "Минск" ИЛИ ГородБазы = "Прилуки" Тогда
		мРазноеКлиент.Заменить(Поиск, "%ТелефонНачОтдела%", ТелефонИсполнителя);  
		
		//Штрихкод
		ВставитьШтрихКод();
	КонецЕсли; 
	
	РегНомер = НомерДоговора;
	ДатаРег = Формат(ДатаДоговора,"ДЛФ=DD");
	мРазноеКлиент.Заменить(Поиск, "РегНомер", РегНомер);  
	мРазноеКлиент.Заменить(Поиск, "ДатаРег", ДатаРег); 
	мРазноеКлиент.Заменить(Поиск, "%Город", Город); 
	
	// Руководители
	Док.Bookmarks("Руководитель").Range.Text = ПолучитьСтрокуРуководителя(Подписи); 
	Док.Bookmarks("Доверенность").Range.Text = ПолучитьДоверенность(Подписи.Подписал, ДатаДоговора); 
	мРазноеКлиент.Заменить(Поиск, "%Свидетельство%", СвидетельствоОГосРегистрации); 
	мРазноеКлиент.Заменить(Поиск, "%Заказчик%", Заказчики[0].ПолноеНаименование); 
	Док.Bookmarks("РуководительЗаказчик").Range.Text = ПолучитьСтрокуРуководителяЗаказчика(Заказчики[0].ПодписалОтКорреспондента); 
	
	//Колонтитулы
	ГородБазы = мРазное.ПолучитьГородБазы();
	Если ГородБазы = "Брест" Тогда
		Если Не СобственныеСредства Тогда
			Если ЗначениеЗаполнено(Подписи.ПодписалКратко) Тогда
				Док.Bookmarks("ПодписьНижнийКолонтитул").Range.Text = " _______________________ "+Подписи.ПодписалКратко; 
			Иначе
				Док.Bookmarks("ПодписьНижнийКолонтитул").Range.Text = ""; 
			КонецЕсли;
		Иначе
			Док.Bookmarks("ПодписьНижнийКолонтитул").Range.Text = ""; 
		КонецЕсли; 
	КонецЕсли; 
	
	Док.Bookmarks("ОбъектРабот").Range.Text = ДобавитьТочку(ЭтапыДоговора[0].ОбъектРабот); 
	Док.Bookmarks("Месторасположение").Range.Text = ДобавитьТочку(ЭтапыДоговора[0].Месторасположение); 
	
	мРазноеКлиент.Заменить(Поиск, "%ПредУсловие%", мРаботаСДоговорами.ДлительностьВыполненияРаботСтрокой(ЭтапыДоговора[0].ДлительностьВыполненияРабот, ЭтапыДоговора[0].ВидДней)); 
	Док.Bookmarks("РезультатРаботы1Этап").Range.Text = ДобавитьТочку(ЭтапыДоговора[0].РезультатРаботы); 
	
	// Пункт 3.1
	// Стоимость
	РеквизитыЛьготы = мРазноеКлиент.ПолучитьЛьготуНДС(ЭтапыДоговора);
	ЛьготаНДС = РеквизитыЛьготы.ЛьготаНДС;
	СтавкаНДСДляПрописи = ПолучитьПредставлениеСтавкиНДС(РеквизитыЛьготы.СтавкаНДСДляПрописи);
	
	СтоимостьДоговора = мРаботаСДоговорами.СуммаЧисломИПрописью(ЭтапыДоговора.Итог("СтоимостьСНДС"), ВалютаДоговора);
	Если ЭтапыДоговора.Итог("СуммаНДС") > 0 Тогда
		СуммаНДСПрописьюПолная = мРаботаСДоговорами.СуммаЧисломИПрописью(ЭтапыДоговора.Итог("СуммаНДС"), ВалютаДоговора);
		СтоимостьДоговора = СтоимостьДоговора + ", в том числе НДС по ставке " + СтавкаНДСДляПрописи +"% в сумме " + СуммаНДСПрописьюПолная;
	КонецЕсли;
	Док.Bookmarks("СтоимостьДоговора").Range.Text = СтоимостьДоговора; 
	
	мРазноеКлиент.Заменить(Поиск, "%ИзНих%", ", из них выполнение работ:"); 
	
	// Запоминаем
	УдалитьЗакладку("СтрокаТаблицы");
	
	СтрокаФорматаЦен = "ЧДЦ=2; ЧРГ=' '; ЧН=-"; 
	
	й=ЭтапыДоговора.Количество()-1;
	Пока й >= 0 Цикл
		селекция.Start = НачалоЗакладки; // Начало вставки
		селекция.Collapse();             // Вставка, а не замещение
		селекция.Paste();
		НомерПодпункта = й+1;
		мРазноеКлиент.Заменить(Поиск, "%ЭтапыРабот%", ДобавитьТочку(ЭтапыДоговора[й].НаименованиеРаботы)); 
		мРазноеКлиент.Заменить(Поиск, "%СтоимостьБезНДС%", Формат(ЭтапыДоговора[й].Стоимость, СтрокаФорматаЦен)); 
		мРазноеКлиент.Заменить(Поиск, "%СтавкаНДС%", ПолучитьПредставлениеСтавкиНДС(ЭтапыДоговора[й].СтавкаНДС)); 
		мРазноеКлиент.Заменить(Поиск, "%СуммаНДС%", Формат(ЭтапыДоговора[й].СуммаНДС, СтрокаФорматаЦен)); 
		мРазноеКлиент.Заменить(Поиск, "%Стоимость%", Формат(ЭтапыДоговора[й].СтоимостьСНДС, СтрокаФорматаЦен)); 
		й=й-1;
	КонецЦикла;
	// Всего
	мРазноеКлиент.Заменить(Поиск, "%СтоимостьБезНДСВсего%", Формат(ЭтапыДоговора.Итог("Стоимость"), СтрокаФорматаЦен)); 
	мРазноеКлиент.Заменить(Поиск, "%СуммаНДСВсего%", Формат(ЭтапыДоговора.Итог("СуммаНДС"), СтрокаФорматаЦен)); 
	мРазноеКлиент.Заменить(Поиск, "%СтоимостьВсего%", Формат(ЭтапыДоговора.Итог("СтоимостьСНДС"), СтрокаФорматаЦен)); 
	
	Док.Bookmarks("ЛьготаНДС").Range.Text = ЛьготаНДС; 
	
	Док.Bookmarks("ИсточникФинанс").Range.Text = ИсточникФинанс; 
	
	// Пункт 3.5
	мРазноеКлиент.Заменить(Поиск, "%ПроцентПредоплаты%", ЭтапыДоговора[0].ПроцентПредоплаты); 
	ВывестиПоле(Док, "%МоментОплаты35_1Этап%", СокрЛП(ЭтапыДоговора[0].МоментОплаты), "подписания настоящего договора");
		
	// Подписи документа
	ВывестиПодписи(Док, СтруктураНашихРеквизитов, Подписи);
	
	// Вывод на печать или в файл
	ВывестиДокумент();
	
КонецПроцедуры // ПечатьДоговорТКП()

&НаКлиенте
Процедура ПечатьДоговорЮрЛицПИРУбыткиПоАктам()
	
	ПолучитьОбщиеДанныеДоговора();
	
	Подписи = ПолучитьПодписиПодрядчика(Договор);
	СтруктураНашихРеквизитов = мРаботаСДоговорами.ПолучитьНашиРеквизиты(Договор);
	Город = мРазное.НашГород(СтруктураНашихРеквизитов);
	
	ИнициализироватьДокументWord();
	
	// Заполнение договора
	Если ГородБазы = "Минск" ИЛИ ГородБазы = "Прилуки" Тогда
		мРазноеКлиент.Заменить(Поиск, "%ТелефонНачОтдела%", ТелефонИсполнителя);  
		
		//Штрихкод
		ВставитьШтрихКод();
	КонецЕсли; 
	
	РегНомер = НомерДоговора;
	ДатаРег = Формат(ДатаДоговора,"ДЛФ=DD");
	мРазноеКлиент.Заменить(Поиск, "РегНомер", РегНомер);  
	мРазноеКлиент.Заменить(Поиск, "ДатаРег", ДатаРег); 
	мРазноеКлиент.Заменить(Поиск, "%Город", Город); 
	
	// Руководители
	Док.Bookmarks("Руководитель").Range.Text = ПолучитьСтрокуРуководителя(Подписи); 
	Док.Bookmarks("Доверенность").Range.Text = ПолучитьДоверенность(Подписи.Подписал, ДатаДоговора); 
	мРазноеКлиент.Заменить(Поиск, "%Свидетельство%", СвидетельствоОГосРегистрации); 
	мРазноеКлиент.Заменить(Поиск, "%Заказчик%", Заказчики[0].ПолноеНаименование); 
	Док.Bookmarks("РуководительЗаказчик").Range.Text = ПолучитьСтрокуРуководителяЗаказчика(Заказчики[0].ПодписалОтКорреспондента); 
	
	//Колонтитулы
	ГородБазы = мРазное.ПолучитьГородБазы();
	Если ГородБазы = "Брест" Тогда
		Если Не СобственныеСредства Тогда
			Если ЗначениеЗаполнено(Подписи.ПодписалКратко) Тогда
				Док.Bookmarks("ПодписьНижнийКолонтитул").Range.Text = " _______________________ "+Подписи.ПодписалКратко; 
			Иначе
				Док.Bookmarks("ПодписьНижнийКолонтитул").Range.Text = ""; 
			КонецЕсли;
		Иначе
			Док.Bookmarks("ПодписьНижнийКолонтитул").Range.Text = ""; 
		КонецЕсли; 
	КонецЕсли; 
	
	Док.Bookmarks("ОбъектРабот").Range.Text = ДобавитьТочку(ЭтапыДоговора[0].ОбъектРабот); 
	Док.Bookmarks("Месторасположение").Range.Text = ДобавитьТочку(ЭтапыДоговора[0].Месторасположение); 
	
	мРазноеКлиент.Заменить(Поиск, "%ПредУсловие%", мРаботаСДоговорами.ДлительностьВыполненияРаботСтрокой(ЭтапыДоговора[0].ДлительностьВыполненияРабот, ЭтапыДоговора[0].ВидДней)); 
	Док.Bookmarks("РезультатРаботы1Этап").Range.Text = ДобавитьТочку(ЭтапыДоговора[0].РезультатРаботы); 
	
	// Пункт 3.1
	// Стоимость
	РеквизитыЛьготы = мРазноеКлиент.ПолучитьЛьготуНДС(ЭтапыДоговора);
	ЛьготаНДС = РеквизитыЛьготы.ЛьготаНДС;
	СтавкаНДСДляПрописи = ПолучитьПредставлениеСтавкиНДС(РеквизитыЛьготы.СтавкаНДСДляПрописи);
	
	СтоимостьДоговора = мРаботаСДоговорами.СуммаЧисломИПрописью(ЭтапыДоговора.Итог("СтоимостьСНДС"), ВалютаДоговора);
	Если ЭтапыДоговора.Итог("СуммаНДС") > 0 Тогда
		СуммаНДСПрописьюПолная = мРаботаСДоговорами.СуммаЧисломИПрописью(ЭтапыДоговора.Итог("СуммаНДС"), ВалютаДоговора);
		СтоимостьДоговора = СтоимостьДоговора + ", в том числе НДС по ставке " + СтавкаНДСДляПрописи +"% в сумме " + СуммаНДСПрописьюПолная;
	КонецЕсли;
	Док.Bookmarks("СтоимостьДоговора").Range.Text = СтоимостьДоговора; 
	
	мРазноеКлиент.Заменить(Поиск, "%ИзНих%", ", из них выполнение работ:"); 
	
	// Запоминаем
	УдалитьЗакладку("СтрокаТаблицы");
	
	СтрокаФорматаЦен = "ЧДЦ=2; ЧРГ=' '; ЧН=-"; 
	
	й=ЭтапыДоговора.Количество()-1;
	Пока й >= 0 Цикл
		селекция.Start = НачалоЗакладки; // Начало вставки
		селекция.Collapse();             // Вставка, а не замещение
		селекция.Paste();
		НомерПодпункта = й+1;
		мРазноеКлиент.Заменить(Поиск, "%ЭтапыРабот%", ДобавитьТочку(ЭтапыДоговора[й].НаименованиеРаботы)); 
		мРазноеКлиент.Заменить(Поиск, "%СтоимостьБезНДС%", Формат(ЭтапыДоговора[й].Стоимость, СтрокаФорматаЦен)); 
		мРазноеКлиент.Заменить(Поиск, "%СтавкаНДС%", ПолучитьПредставлениеСтавкиНДС(ЭтапыДоговора[й].СтавкаНДС)); 
		мРазноеКлиент.Заменить(Поиск, "%СуммаНДС%", Формат(ЭтапыДоговора[й].СуммаНДС, СтрокаФорматаЦен)); 
		мРазноеКлиент.Заменить(Поиск, "%Стоимость%", Формат(ЭтапыДоговора[й].СтоимостьСНДС, СтрокаФорматаЦен)); 
		й=й-1;
	КонецЦикла;
	// Всего
	мРазноеКлиент.Заменить(Поиск, "%СтоимостьБезНДСВсего%", Формат(ЭтапыДоговора.Итог("Стоимость"), СтрокаФорматаЦен)); 
	мРазноеКлиент.Заменить(Поиск, "%СуммаНДСВсего%", Формат(ЭтапыДоговора.Итог("СуммаНДС"), СтрокаФорматаЦен)); 
	мРазноеКлиент.Заменить(Поиск, "%СтоимостьВсего%", Формат(ЭтапыДоговора.Итог("СтоимостьСНДС"), СтрокаФорматаЦен)); 
	
	Док.Bookmarks("ЛьготаНДС").Range.Text = ЛьготаНДС; 
	
	Док.Bookmarks("ИсточникФинанс").Range.Text = ИсточникФинанс; 
	
	// Пункт 3.5
	мРазноеКлиент.Заменить(Поиск, "%ПроцентПредоплаты%", ЭтапыДоговора[0].ПроцентПредоплаты); 
		
	// Подписи документа
	ВывестиПодписи(Док, СтруктураНашихРеквизитов, Подписи);
	
	// Вывод на печать или в файл
	ВывестиДокумент();
	
КонецПроцедуры // ПечатьДоговорТКП()

&НаКлиенте
Процедура ПечатьДоговорОтводУбытки()
	
	ПолучитьОбщиеДанныеДоговора();
	
	Подписи = ПолучитьПодписиПодрядчика(Договор);
	СтруктураНашихРеквизитов = мРаботаСДоговорами.ПолучитьНашиРеквизиты(Договор);
	Город = мРазное.НашГород(СтруктураНашихРеквизитов);
	
	ИнициализироватьДокументWord();
	
	// Заполнение договора
	Если ГородБазы = "Минск" ИЛИ ГородБазы = "Прилуки" Тогда
		мРазноеКлиент.Заменить(Поиск, "%ТелефонНачОтдела%", ТелефонИсполнителя);  
		
		//Штрихкод
		ВставитьШтрихКод();
	КонецЕсли; 
	
	РегНомер = НомерДоговора;
	ДатаРег = Формат(ДатаДоговора,"ДЛФ=DD");
	мРазноеКлиент.Заменить(Поиск, "РегНомер", РегНомер);  
	мРазноеКлиент.Заменить(Поиск, "ДатаРег", ДатаРег); 
	мРазноеКлиент.Заменить(Поиск, "%Город", Город); 
	
	// Руководители
	Док.Bookmarks("Руководитель").Range.Text = ПолучитьСтрокуРуководителя(Подписи); 
	Док.Bookmarks("Доверенность").Range.Text = ПолучитьДоверенность(Подписи.Подписал, ДатаДоговора); 
	мРазноеКлиент.Заменить(Поиск, "%Свидетельство%", СвидетельствоОГосРегистрации); 
	мРазноеКлиент.Заменить(Поиск, "%Заказчик%", Заказчики[0].ПолноеНаименование); 
	Док.Bookmarks("РуководительЗаказчик").Range.Text = ПолучитьСтрокуРуководителяЗаказчика(Заказчики[0].ПодписалОтКорреспондента); 
	
	//Колонтитулы
	ГородБазы = мРазное.ПолучитьГородБазы();
	Если ГородБазы = "Брест" Тогда
		Если Не СобственныеСредства Тогда
			Если ЗначениеЗаполнено(Подписи.ПодписалКратко) Тогда
				Док.Bookmarks("ПодписьНижнийКолонтитул").Range.Text = " _______________________ "+Подписи.ПодписалКратко; 
			Иначе
				Док.Bookmarks("ПодписьНижнийКолонтитул").Range.Text = ""; 
			КонецЕсли;
		Иначе
			Док.Bookmarks("ПодписьНижнийКолонтитул").Range.Text = ""; 
		КонецЕсли; 
	КонецЕсли; 
	
	ОдинЭтап = Ложь;
	Если ЭтапыДоговора.Количество() = 1 Тогда
		ОдинЭтап = Истина;	
	КонецЕсли; 
	
	// Пункт 1.1 ПереченьРабот
	ПереченьРабот = "";
	Если ОдинЭтап Тогда
		ПодПунктРабот = "1.2";
		ПереченьРабот = " - " + ЭтапыДоговора[0].НаименованиеРаботы;
	Иначе
		ПодПунктРабот = "1.3";
	    ПереченьРабот = ":"+Символы.ПС;
		Для каждого Стр Из ЭтапыДоговора Цикл
			ПереченьРабот = ПереченьРабот + "- "+Стр.НаименованиеРаботы+";"+Символы.ПС;
		КонецЦикла; 
		ПереченьРабот = Лев(ПереченьРабот, СтрДлина(ПереченьРабот)-2);
	КонецЕсли;
	мРазноеКлиент.Заменить(Поиск, "%ПодПунктРабот%", ПодПунктРабот); 
	Док.Bookmarks("ПереченьРабот").Range.Text = ПереченьРабот; 
	
	// Пункт 1.2
	Если ОдинЭтап Тогда
		// Удаляем
		УдалитьЗакладку("Пункт12");
	Иначе
		// оставляем	
		УдалитьЗакладку("Подпункт12");
		
		й=ЭтапыДоговора.Количество()-1;
		Пока й >= 0 Цикл
			селекция.Start = НачалоЗакладки; // Начало вставки
			селекция.Collapse();             // Вставка, а не замещение
			селекция.Paste();
			НомерПодпункта = й+1;
			мРазноеКлиент.Заменить(Поиск, "%Подпункт12%", НомерПодпункта); 
			мРазноеКлиент.Заменить(Поиск, "%ПорядковыйЭтапа%", мРаботаСДоговорами.ПорядковыйНомер(НомерПодпункта)); 
			мРазноеКлиент.Заменить(Поиск, "%ВидРаботЭтапа%", ДобавитьТочку(ЭтапыДоговора[й].НаименованиеРаботы)); 
			й=й-1;
		КонецЦикла; 
	КонецЕсли; 
	
	// Оставшиеся пункты 1 раздела
	Если ОдинЭтап Тогда
		мРазноеКлиент.Заменить(Поиск, "%ПодПунктАдрес%", "1.3"); 
		мРазноеКлиент.Заменить(Поиск, "%ПодПунктОбъем%", "1.4"); 
		мРазноеКлиент.Заменить(Поиск, "%ПодПунктДанные%", "1.5"); 
	Иначе
		мРазноеКлиент.Заменить(Поиск, "%ПодПунктАдрес%", "1.4"); 
		мРазноеКлиент.Заменить(Поиск, "%ПодПунктОбъем%", "1.5"); 
		мРазноеКлиент.Заменить(Поиск, "%ПодПунктДанные%", "1.6"); 
	КонецЕсли; 
	
	Док.Bookmarks("ОбъектРабот").Range.Text = ДобавитьТочку(ЭтапыДоговора[0].ОбъектРабот); 
	Док.Bookmarks("Месторасположение").Range.Text = ДобавитьТочку(ЭтапыДоговора[0].Месторасположение); 
	
	// Пункт 2.1
	Если ОдинЭтап Тогда
		// Удаляем
		НачалоЗакладки = Док.Bookmarks("Пункт21Несколько").Start;
		КонецЗакладки = Док.Bookmarks("Пункт21Несколько").End;
		Селекция.Start = НачалоЗакладки;
		Селекция.End = КонецЗакладки;
		Селекция.Cut(); 
		
		мРазноеКлиент.Заменить(Поиск, "%ПредУсловие%", мРаботаСДоговорами.ДлительностьВыполненияРаботСтрокой(ЭтапыДоговора[0].ДлительностьВыполненияРабот, ЭтапыДоговора[0].ВидДней)); 
		Док.Bookmarks("РезультатРаботы1Этап").Range.Text = ДобавитьТочку(ЭтапыДоговора[0].РезультатРаботы); 
		
	Иначе
		// Удаляем
		УдалитьЗакладку("Пункт21ОдинЭтап");
		УдалитьЗакладку("РезультатРаботы1Этап");
		
		// Запоминаем
		УдалитьЗакладку("Пункт21");
		
		й=ЭтапыДоговора.Количество()-1;
		Пока й >= 0 Цикл
			селекция.Start = НачалоЗакладки; // Начало вставки
			селекция.Collapse();             // Вставка, а не замещение
			селекция.Paste();
			НомерПодпункта = й+1;
			мРазноеКлиент.Заменить(Поиск, "%Подпункт21%", НомерПодпункта); 
			мРазноеКлиент.Заменить(Поиск, "%ПорядковыйЭтапа21%", мРаботаСДоговорами.ПорядковыйНомер(НомерПодпункта)); 
			мРазноеКлиент.Заменить(Поиск, "%ПорядковыйЭтапаРП%", мРаботаСДоговорами.ПорядковыйНомер(НомерПодпункта, 2)); 
			мРазноеКлиент.Заменить(Поиск, "%ПредУсловие%", мРаботаСДоговорами.ДлительностьВыполненияРаботСтрокой(ЭтапыДоговора[й].ДлительностьВыполненияРабот, ЭтапыДоговора[й].ВидДней)); 
			Док.Bookmarks("РезультатРаботы").Range.Text = ДобавитьТочку(ЭтапыДоговора[й].РезультатРаботы); 
			й=й-1;
		КонецЦикла; 
	КонецЕсли; 
	
	// Пункт 3.1
	// Стоимость
	РеквизитыЛьготы = мРазноеКлиент.ПолучитьЛьготуНДС(ЭтапыДоговора);
	ЛьготаНДС = РеквизитыЛьготы.ЛьготаНДС;
	СтавкаНДСДляПрописи = ПолучитьПредставлениеСтавкиНДС(РеквизитыЛьготы.СтавкаНДСДляПрописи);
	
	СтоимостьДоговора = мРаботаСДоговорами.СуммаЧисломИПрописью(ЭтапыДоговора.Итог("СтоимостьСНДС"), ВалютаДоговора);
	Если ЭтапыДоговора.Итог("СуммаНДС") > 0 Тогда
		СуммаНДСПрописьюПолная = мРаботаСДоговорами.СуммаЧисломИПрописью(ЭтапыДоговора.Итог("СуммаНДС"), ВалютаДоговора);
		СтоимостьДоговора = СтоимостьДоговора + ", в том числе НДС по ставке " + СтавкаНДСДляПрописи +"% в сумме " + СуммаНДСПрописьюПолная;
	КонецЕсли;
	Док.Bookmarks("СтоимостьДоговора").Range.Text = СтоимостьДоговора; 
	
	Если ОдинЭтап Тогда
		мРазноеКлиент.Заменить(Поиск, "%ИзНих%", "."); 
		
		// Удаляем
		УдалитьЗакладку("ТаблицаДоговора");
		
	Иначе
		мРазноеКлиент.Заменить(Поиск, "%ИзНих%", ", из них выполнение работ:"); 
		
		// Запоминаем
		УдалитьЗакладку("СтрокаТаблицы");
		
		СтрокаФорматаЦен = ?(СКопейками, "ЧДЦ=2; ЧРД=.; ЧГ=3,0","ЧДЦ=; ЧГ=3,0"); 
		ФорматСтарыхЦен = "ЧРГ=' '; ЧН=-";
		ФорматНовыхЦен = "ЧДЦ=2; ЧРГ=' '; ЧН=-";
        
        Если ДатаДоговора < Дата(2016, 7, 1) Тогда
            СтрокаФорматаЦен = ФорматСтарыхЦен;
        Иначе	
            СтрокаФорматаЦен = ФорматНовыхЦен;
        КонецЕсли; 
        
		
		й=ЭтапыДоговора.Количество()-1;
		Пока й >= 0 Цикл
			селекция.Start = НачалоЗакладки; // Начало вставки
			селекция.Collapse();             // Вставка, а не замещение
			селекция.Paste();
			НомерПодпункта = й+1;
			мРазноеКлиент.Заменить(Поиск, "%ЭтапыРабот%", ДобавитьТочку(ЭтапыДоговора[й].НаименованиеРаботы)); 
			мРазноеКлиент.Заменить(Поиск, "%СтоимостьБезНДС%", Формат(ЭтапыДоговора[й].Стоимость, СтрокаФорматаЦен)); 
			мРазноеКлиент.Заменить(Поиск, "%СтавкаНДС%", ПолучитьПредставлениеСтавкиНДС(ЭтапыДоговора[й].СтавкаНДС)); 
			мРазноеКлиент.Заменить(Поиск, "%СуммаНДС%", Формат(ЭтапыДоговора[й].СуммаНДС, СтрокаФорматаЦен)); 
			мРазноеКлиент.Заменить(Поиск, "%Стоимость%", Формат(ЭтапыДоговора[й].СтоимостьСНДС, СтрокаФорматаЦен)); 
			й=й-1;
		КонецЦикла;
		// Всего
		мРазноеКлиент.Заменить(Поиск, "%СтоимостьБезНДСВсего%", Формат(ЭтапыДоговора.Итог("Стоимость"), СтрокаФорматаЦен)); 
		мРазноеКлиент.Заменить(Поиск, "%СуммаНДСВсего%", Формат(ЭтапыДоговора.Итог("СуммаНДС"), СтрокаФорматаЦен)); 
		мРазноеКлиент.Заменить(Поиск, "%СтоимостьВсего%", Формат(ЭтапыДоговора.Итог("СтоимостьСНДС"), СтрокаФорматаЦен)); 
	КонецЕсли; 
	
	Док.Bookmarks("ЛьготаНДС").Range.Text = ЛьготаНДС; 
	
	Док.Bookmarks("ИсточникФинанс").Range.Text = ИсточникФинанс; 
	
	// Пункт 3.5
	Если ОдинЭтап Тогда
		мРазноеКлиент.Заменить(Поиск, "%ПроцентПредоплаты%", ЭтапыДоговора[0].ПроцентПредоплаты); 
		ВывестиПоле(Док, "%МоментОплаты35_1Этап%", СокрЛП(ЭтапыДоговора[0].МоментОплаты), "подписания настоящего договора");
		
		// Удаляем
		УдалитьЗакладку("Пункт35Несколько");
		УдалитьЗакладку("ПодПункт35");
		
	Иначе
		// Удаляем
		УдалитьЗакладку("Пункт35Один");
		
		// Запоминаем
		УдалитьЗакладку("ПодПункт35");
		
		мРазноеКлиент.Заменить(Поиск, "%ИзНих%", ", из них выполнение работ:"); 
		СтрокаФорматаЦен = ?(СКопейками, "ЧДЦ=2; ЧРД=.; ЧГ=3,0","ЧДЦ=; ЧГ=3,0"); 
		
		й=ЭтапыДоговора.Количество()-1;
		Пока й >= 0 Цикл
			селекция.Start = НачалоЗакладки; // Начало вставки
			селекция.Collapse();             // Вставка, а не замещение
			селекция.Paste();
			НомерПодпункта = й+1;
			мРазноеКлиент.Заменить(Поиск, "%Подпункт35%", НомерПодпункта); 
			мРазноеКлиент.Заменить(Поиск, "%Порядковый35%", мРаботаСДоговорами.ПорядковыйНомер(НомерПодпункта, 3)); 
			мРазноеКлиент.Заменить(Поиск, "%ПроцентПредоплаты%", ЭтапыДоговора[й].ПроцентПредоплаты); 
			ВывестиПоле(Док, "%МоментОплаты35%", СокрЛП(ЭтапыДоговора[й].МоментОплаты), "подписания настоящего договора");
			й=й-1;
		КонецЦикла; 
	КонецЕсли; 
	
	// Подписи документа
	ВывестиПодписи(Док, СтруктураНашихРеквизитов, Подписи);
	
	// Вывод на печать или в файл
	ВывестиДокумент();
	
КонецПроцедуры // ПечатьДоговорТКП()

&НаКлиенте
Процедура ПечатьДоговорОтводУбыткиПоАктам()
	
	ПолучитьОбщиеДанныеДоговора();
	
	Подписи = ПолучитьПодписиПодрядчика(Договор);
	СтруктураНашихРеквизитов = мРаботаСДоговорами.ПолучитьНашиРеквизиты(Договор);
	Город = мРазное.НашГород(СтруктураНашихРеквизитов);
	
	ИнициализироватьДокументWord();
	
	// Заполнение договора
	Если ГородБазы = "Минск" ИЛИ ГородБазы = "Прилуки" Тогда
		мРазноеКлиент.Заменить(Поиск, "%ТелефонНачОтдела%", ТелефонИсполнителя);  
		
		//Штрихкод
		ВставитьШтрихКод();
	КонецЕсли; 
	
	РегНомер = НомерДоговора;
	ДатаРег = Формат(ДатаДоговора,"ДЛФ=DD");
	мРазноеКлиент.Заменить(Поиск, "РегНомер", РегНомер);  
	мРазноеКлиент.Заменить(Поиск, "ДатаРег", ДатаРег); 
	мРазноеКлиент.Заменить(Поиск, "%Город", Город); 
	
	// Руководители
	Док.Bookmarks("Руководитель").Range.Text = ПолучитьСтрокуРуководителя(Подписи); 
	Док.Bookmarks("Доверенность").Range.Text = ПолучитьДоверенность(Подписи.Подписал, ДатаДоговора); 
	мРазноеКлиент.Заменить(Поиск, "%Свидетельство%", СвидетельствоОГосРегистрации); 
	мРазноеКлиент.Заменить(Поиск, "%Заказчик%", Заказчики[0].ПолноеНаименование); 
	Док.Bookmarks("РуководительЗаказчик").Range.Text = ПолучитьСтрокуРуководителяЗаказчика(Заказчики[0].ПодписалОтКорреспондента); 
	
	//Колонтитулы
	Город = мРазное.ПолучитьГородБазы();
	Если Город = "Брест" Тогда
		Если Не СобственныеСредства Тогда
			Если ЗначениеЗаполнено(Подписи.ПодписалКратко) Тогда
				Док.Bookmarks("ПодписьНижнийКолонтитул").Range.Text = " _______________________ "+Подписи.ПодписалКратко; 
			Иначе
				Док.Bookmarks("ПодписьНижнийКолонтитул").Range.Text = ""; 
			КонецЕсли;
		Иначе
			Док.Bookmarks("ПодписьНижнийКолонтитул").Range.Text = ""; 
		КонецЕсли; 
	КонецЕсли; 
	
	ОдинЭтап = Ложь;
	Если ЭтапыДоговора.Количество() = 1 Тогда
		ОдинЭтап = Истина;	
	КонецЕсли; 
	
	// Пункт 1.1 ПереченьРабот
	ПереченьРабот = "";
	Если ОдинЭтап Тогда
		ПодПунктРабот = "1.2";
		ПереченьРабот = " - " + ЭтапыДоговора[0].НаименованиеРаботы;
	Иначе
		ПодПунктРабот = "1.3";
	    ПереченьРабот = ":"+Символы.ПС;
        Сч = 0;
        Для каждого Стр Из ЭтапыДоговора Цикл
            Сч=Сч+1;
            Если Сч=3 Тогда
                // Третий этап не печатаем
            	Продолжить;
            КонецЕсли; 
			ПереченьРабот = ПереченьРабот + "- "+Стр.НаименованиеРаботы+";"+Символы.ПС;
		КонецЦикла; 
		ПереченьРабот = Лев(ПереченьРабот, СтрДлина(ПереченьРабот)-2);
	КонецЕсли;
	мРазноеКлиент.Заменить(Поиск, "%ПодПунктРабот%", ПодПунктРабот); 
	Док.Bookmarks("ПереченьРабот").Range.Text = ПереченьРабот; 
	
	// Пункт 1.2
	Если ОдинЭтап Тогда
		// Удаляем
		УдалитьЗакладку("Пункт12");
	Иначе
		// оставляем	
		УдалитьЗакладку("Подпункт12");
		
		й=ЭтапыДоговора.Количество()-1;
		Пока й >= 0 Цикл
           Если й = 2 Тогда
                // Третий этап не печатаем
    			й=й-1;
            	Продолжить;
            КонецЕсли; 
			селекция.Start = НачалоЗакладки; // Начало вставки
			селекция.Collapse();             // Вставка, а не замещение
			селекция.Paste();
			НомерПодпункта = й+1;
			мРазноеКлиент.Заменить(Поиск, "%Подпункт12%", НомерПодпункта); 
			мРазноеКлиент.Заменить(Поиск, "%ПорядковыйЭтапа%", мРаботаСДоговорами.ПорядковыйНомер(НомерПодпункта)); 
			мРазноеКлиент.Заменить(Поиск, "%ВидРаботЭтапа%", ДобавитьТочку(ЭтапыДоговора[й].НаименованиеРаботы)); 
			й=й-1;
 		КонецЦикла; 
	КонецЕсли; 
	
	// Оставшиеся пункты 1 раздела
	Если ОдинЭтап Тогда
		мРазноеКлиент.Заменить(Поиск, "%ПодПунктАдрес%", "1.3"); 
		мРазноеКлиент.Заменить(Поиск, "%ПодПунктОбъем%", "1.4"); 
		мРазноеКлиент.Заменить(Поиск, "%ПодПунктДанные%", "1.5"); 
	Иначе
		мРазноеКлиент.Заменить(Поиск, "%ПодПунктАдрес%", "1.4"); 
		мРазноеКлиент.Заменить(Поиск, "%ПодПунктОбъем%", "1.5"); 
		мРазноеКлиент.Заменить(Поиск, "%ПодПунктДанные%", "1.6"); 
	КонецЕсли; 
	
	Док.Bookmarks("ОбъектРабот").Range.Text = ДобавитьТочку(ЭтапыДоговора[0].ОбъектРабот); 
	Док.Bookmarks("Месторасположение").Range.Text = ДобавитьТочку(ЭтапыДоговора[0].Месторасположение); 
	
	// Пункт 2.1
	Если ОдинЭтап Тогда
		// Удаляем
		НачалоЗакладки = Док.Bookmarks("Пункт21Несколько").Start;
		КонецЗакладки = Док.Bookmarks("Пункт21Несколько").End;
		Селекция.Start = НачалоЗакладки;
		Селекция.End = КонецЗакладки;
		Селекция.Cut(); 
		
		мРазноеКлиент.Заменить(Поиск, "%ПредУсловие%", мРаботаСДоговорами.ДлительностьВыполненияРаботСтрокой(ЭтапыДоговора[0].ДлительностьВыполненияРабот, ЭтапыДоговора[0].ВидДней)); 
		Док.Bookmarks("РезультатРаботы1Этап").Range.Text = ДобавитьТочку(ЭтапыДоговора[0].РезультатРаботы); 
		
	Иначе
		// Удаляем
		УдалитьЗакладку("Пункт21ОдинЭтап");
		УдалитьЗакладку("РезультатРаботы1Этап");
		
		// Запоминаем
		УдалитьЗакладку("Пункт21");
		
		й=ЭтапыДоговора.Количество()-1;
		Пока й >= 0 Цикл
            Если й = 2 Тогда
                // Третий этап не печатаем
	    		й=й-1;
               	Продолжить;
            КонецЕсли; 
			селекция.Start = НачалоЗакладки; // Начало вставки
			селекция.Collapse();             // Вставка, а не замещение
			селекция.Paste();
			НомерПодпункта = й+1;
			мРазноеКлиент.Заменить(Поиск, "%Подпункт21%", НомерПодпункта); 
			мРазноеКлиент.Заменить(Поиск, "%ПорядковыйЭтапа21%", мРаботаСДоговорами.ПорядковыйНомер(НомерПодпункта)); 
			мРазноеКлиент.Заменить(Поиск, "%ПорядковыйЭтапаРП%", мРаботаСДоговорами.ПорядковыйНомер(НомерПодпункта, 2)); 
			мРазноеКлиент.Заменить(Поиск, "%ПредУсловие%", мРаботаСДоговорами.ДлительностьВыполненияРаботСтрокой(ЭтапыДоговора[й].ДлительностьВыполненияРабот, ЭтапыДоговора[й].ВидДней)); 
			Док.Bookmarks("РезультатРаботы").Range.Text = ДобавитьТочку(ЭтапыДоговора[й].РезультатРаботы); 
			й=й-1;
		КонецЦикла; 
	КонецЕсли; 
	
	// Пункт 3.1
	// Стоимость
	РеквизитыЛьготы = мРазноеКлиент.ПолучитьЛьготуНДС(ЭтапыДоговора);
	ЛьготаНДС = РеквизитыЛьготы.ЛьготаНДС;
	СтавкаНДСДляПрописи = ПолучитьПредставлениеСтавкиНДС(РеквизитыЛьготы.СтавкаНДСДляПрописи);
	
	СтоимостьДоговора = мРаботаСДоговорами.СуммаЧисломИПрописью(ЭтапыДоговора.Итог("СтоимостьСНДС"), ВалютаДоговора);
	Если ЭтапыДоговора.Итог("СуммаНДС") > 0 Тогда
		СуммаНДСПрописьюПолная = мРаботаСДоговорами.СуммаЧисломИПрописью(ЭтапыДоговора.Итог("СуммаНДС"), ВалютаДоговора);
		СтоимостьДоговора = СтоимостьДоговора + ", в том числе НДС по ставке " + СтавкаНДСДляПрописи +"% в сумме " + СуммаНДСПрописьюПолная;
	КонецЕсли;
	Док.Bookmarks("СтоимостьДоговора").Range.Text = СтоимостьДоговора; 
	
	Если ОдинЭтап Тогда
		мРазноеКлиент.Заменить(Поиск, "%ИзНих%", "."); 
		
		// Удаляем
		УдалитьЗакладку("ТаблицаДоговора");
		
	Иначе
		мРазноеКлиент.Заменить(Поиск, "%ИзНих%", ", из них выполнение работ:"); 
		
		// Запоминаем
		УдалитьЗакладку("СтрокаТаблицы");
		
		СтрокаФорматаЦен = ?(СКопейками, "ЧДЦ=2; ЧРД=.; ЧГ=3,0","ЧДЦ=; ЧГ=3,0"); 
		ФорматСтарыхЦен = "ЧРГ=' '; ЧН=-";
		ФорматНовыхЦен = "ЧДЦ=2; ЧРГ=' '; ЧН=-";
        
        Если ДатаДоговора < Дата(2016, 7, 1) Тогда
            СтрокаФорматаЦен = ФорматСтарыхЦен;
        Иначе	
            СтрокаФорматаЦен = ФорматНовыхЦен;
        КонецЕсли; 
        
		
		й=ЭтапыДоговора.Количество()-1;
		Пока й >= 0 Цикл
			селекция.Start = НачалоЗакладки; // Начало вставки
			селекция.Collapse();             // Вставка, а не замещение
			селекция.Paste();
			НомерПодпункта = й+1;
			мРазноеКлиент.Заменить(Поиск, "%ЭтапыРабот%", ДобавитьТочку(ЭтапыДоговора[й].НаименованиеРаботы)); 
			мРазноеКлиент.Заменить(Поиск, "%СтоимостьБезНДС%", Формат(ЭтапыДоговора[й].Стоимость, СтрокаФорматаЦен)); 
			мРазноеКлиент.Заменить(Поиск, "%СтавкаНДС%", ПолучитьПредставлениеСтавкиНДС(ЭтапыДоговора[й].СтавкаНДС)); 
			мРазноеКлиент.Заменить(Поиск, "%СуммаНДС%", Формат(ЭтапыДоговора[й].СуммаНДС, СтрокаФорматаЦен)); 
			мРазноеКлиент.Заменить(Поиск, "%Стоимость%", Формат(ЭтапыДоговора[й].СтоимостьСНДС, СтрокаФорматаЦен)); 
			й=й-1;
		КонецЦикла;
		// Всего
		мРазноеКлиент.Заменить(Поиск, "%СтоимостьБезНДСВсего%", Формат(ЭтапыДоговора.Итог("Стоимость"), СтрокаФорматаЦен)); 
		мРазноеКлиент.Заменить(Поиск, "%СуммаНДСВсего%", Формат(ЭтапыДоговора.Итог("СуммаНДС"), СтрокаФорматаЦен)); 
		мРазноеКлиент.Заменить(Поиск, "%СтоимостьВсего%", Формат(ЭтапыДоговора.Итог("СтоимостьСНДС"), СтрокаФорматаЦен)); 
	КонецЕсли; 
	
	Док.Bookmarks("ЛьготаНДС").Range.Text = ЛьготаНДС; 
	
	Док.Bookmarks("ИсточникФинанс").Range.Text = ИсточникФинанс; 
	
	// Подписи документа
	ВывестиПодписи(Док, СтруктураНашихРеквизитов, Подписи);
	
	// Вывод на печать или в файл
	ВывестиДокумент();
	
КонецПроцедуры // ПечатьДоговорТКП()

&НаКлиенте
Процедура ПечатьДоговорЮрЛицБюджет()
	
	ПолучитьОбщиеДанныеДоговора();
	
	Подписи = ПолучитьПодписиПодрядчика(Договор);
	СтруктураНашихРеквизитов = мРаботаСДоговорами.ПолучитьНашиРеквизиты(Договор);
	Город = мРазное.НашГород(СтруктураНашихРеквизитов);
	
	ИнициализироватьДокументWord();
	
	// Заполнение договора
	Если ГородБазы = "Минск" ИЛИ ГородБазы = "Прилуки" Тогда
		мРазноеКлиент.Заменить(Поиск, "%ТелефонНачОтдела%", ТелефонИсполнителя);  
		
		//Штрихкод
		ВставитьШтрихКод();
	КонецЕсли; 
	
	РегНомер = НомерДоговора;
	ДатаРег = Формат(ДатаДоговора,"ДЛФ=DD");
	мРазноеКлиент.Заменить(Поиск, "РегНомер", РегНомер);  
	мРазноеКлиент.Заменить(Поиск, "ДатаРег", ДатаРег); 
	мРазноеКлиент.Заменить(Поиск, "%Город", Город); 
	
	// Руководители
	Док.Bookmarks("Руководитель").Range.Text = ПолучитьСтрокуРуководителя(Подписи); 
	Док.Bookmarks("Доверенность").Range.Text = ПолучитьДоверенность(Подписи.Подписал, ДатаДоговора); 
	мРазноеКлиент.Заменить(Поиск, "%Свидетельство%", СтруктураНашихРеквизитов.Свидетельство); 
	мРазноеКлиент.Заменить(Поиск, "%Заказчик%", Заказчики[0].ПолноеНаименование); 
	Док.Bookmarks("РуководительЗаказчик").Range.Text = ПолучитьСтрокуРуководителяЗаказчика(Заказчики[0].ПодписалОтКорреспондента); 
	
	//Колонтитулы
	ГородБазы = мРазное.ПолучитьГородБазы();
	Если ГородБазы = "Брест" Тогда
		Если Не СобственныеСредства Тогда
			Если ЗначениеЗаполнено(Подписи.ПодписалКратко) Тогда
				Док.Bookmarks("ПодписьНижнийКолонтитул").Range.Text = " _______________________ "+Подписи.ПодписалКратко; 
			Иначе
				Док.Bookmarks("ПодписьНижнийКолонтитул").Range.Text = ""; 
			КонецЕсли;
		Иначе
			Док.Bookmarks("ПодписьНижнийКолонтитул").Range.Text = ""; 
		КонецЕсли;
	КонецЕсли; 
	
	ОдинЭтап = Ложь;
	Если ЭтапыДоговора.Количество() = 1 Тогда
		ОдинЭтап = Истина;	
	КонецЕсли; 
	
	// Пункт 1.1 ПереченьРабот
	ПереченьРабот = "";
	Если ОдинЭтап Тогда
		ПодПунктРабот = "1.2";
		ПереченьРабот = " - " + ЭтапыДоговора[0].НаименованиеРаботы;
	Иначе
		ПодПунктРабот = "1.3";
	    ПереченьРабот = ":"+Символы.ПС;
		
        СпРабот = ПолучитьСписокРабот();
		Для каждого Стр Из СпРабот Цикл
			ПереченьРабот = ПереченьРабот + "- "+Стр.Представление+";"+Символы.ПС;
		КонецЦикла; 
		ПереченьРабот = Лев(ПереченьРабот, СтрДлина(ПереченьРабот)-2);
	КонецЕсли;
	Док.Bookmarks("ПереченьРабот").Range.Text = ПереченьРабот; 
	
	// Пункт 1.2
	Если ОдинЭтап Тогда
		// Удаляем
		УдалитьЗакладку("Пункт12");
	Иначе
		// оставляем	
		УдалитьЗакладку("Подпункт12");
		
        ц = СпРабот.Количество()-1;
        Пока ц >= 0 Цикл
            НомерПодпункта = ц+1;
            ПорядковыйЭтапа = "";
            СтрокаЭтапов = "этап";
            
            й=ЭтапыДоговора.Количество()-1;
            Пока й >= 0 Цикл
                Если СпРабот[ц].Значение = ЭтапыДоговора[й].ВидРабот Тогда
                    Если СтрНайти(ПорядковыйЭтапа, " и ") > 0 Тогда
                        // Это третье и последующие дубли
                    	ПорядковыйЭтапа = мРазноеКлиент.ПорядковыйНомер(й+1)+", "+ПорядковыйЭтапа;
                    ИначеЕсли ПорядковыйЭтапа = "" Тогда
                        // Это первое вхождение
                    	ПорядковыйЭтапа = мРазноеКлиент.ПорядковыйНомер(й+1);
                    Иначе
                        // Это второе
                     	ПорядковыйЭтапа = мРазноеКлиент.ПорядковыйНомер(й+1)+" и "+ПорядковыйЭтапа;
                        СтрокаЭтапов = "этапы";
                    КонецЕсли; 
                КонецЕсли;
                й=й-1;
            КонецЦикла; 
            ПорядковыйЭтапа =  ВРег(Лев(ПорядковыйЭтапа, 1))+Сред(НРег(ПорядковыйЭтапа), 2);
            селекция.Start = НачалоЗакладки; // Начало вставки
            селекция.Collapse();             // Вставка, а не замещение
            селекция.Paste();
            //НомерПодпункта = й+1;
            мРазноеКлиент.Заменить(Поиск, "%Подпункт12%", НомерПодпункта); 
            мРазноеКлиент.Заменить(Поиск, "%ПорядковыйЭтапа%", ПорядковыйЭтапа+" "+СтрокаЭтапов); 
            мРазноеКлиент.Заменить(Поиск, "%ВидРаботЭтапа%", ДобавитьТочку(СпРабот[ц].Представление)); 
            ц=ц-1;
        КонецЦикла; 
	КонецЕсли; 
	
	// Оставшиеся пункты 1 раздела
	Если ОдинЭтап Тогда
		мРазноеКлиент.Заменить(Поиск, "%ПодПунктАдрес%", "1.3"); 
		мРазноеКлиент.Заменить(Поиск, "%ПодПунктОбъем%", "1.4"); 
		мРазноеКлиент.Заменить(Поиск, "%ПодПунктДанные%", "1.5"); 
	Иначе
		мРазноеКлиент.Заменить(Поиск, "%ПодПунктАдрес%", "1.4"); 
		мРазноеКлиент.Заменить(Поиск, "%ПодПунктОбъем%", "1.5"); 
		мРазноеКлиент.Заменить(Поиск, "%ПодПунктДанные%", "1.6"); 
	КонецЕсли; 
	
	мРазноеКлиент.Заменить(Поиск, "%ПодПунктРабот%", ПодПунктРабот); 
	Док.Bookmarks("ОбъектРабот").Range.Text = ДобавитьТочку(СокрЛП(ЭтапыДоговора[0].ОбъектРабот)); 
	Док.Bookmarks("Месторасположение").Range.Text = ДобавитьТочку(ЭтапыДоговора[0].Месторасположение); 
	
	// Пункт 2.1
	Если ОдинЭтап Тогда
		// Удаляем
		НачалоЗакладки = Док.Bookmarks("Пункт21Несколько").Start;
		КонецЗакладки = Док.Bookmarks("Пункт21Несколько").End;
		Селекция.Start = НачалоЗакладки;
		Селекция.End = КонецЗакладки;
		Селекция.Cut(); 
		
		мРазноеКлиент.Заменить(Поиск, "%ПредУсловие%", мРаботаСДоговорами.ДлительностьВыполненияРаботСтрокой(ЭтапыДоговора[0].ДлительностьВыполненияРабот, ЭтапыДоговора[0].ВидДней)); 
		Док.Bookmarks("РезультатРаботы1Этап").Range.Text = ДобавитьТочку(ЭтапыДоговора[0].РезультатРаботы); 
		
	Иначе
		// Удаляем
		УдалитьЗакладку("Пункт21ОдинЭтап");
		УдалитьЗакладку("РезультатРаботы1Этап");
		
		// Запоминаем
		УдалитьЗакладку("Пункт21");
		
        ц = СпРабот.Количество()-1;
        Пока ц >= 0 Цикл
            НомерПодпункта = ц+1;
            ПорядковыйЭтапа21 = "";
            ПорядковыйЭтапаРП = "";
            СтрокаЭтапов21 = "этап";
            СтрокаЭтаповРП = "этапа";
			ПредУсловие = "";
            РезультатРаботы = "";
            
            й=ЭтапыДоговора.Количество()-1;
            Пока й >= 0 Цикл
                Если СпРабот[ц].Значение = ЭтапыДоговора[й].ВидРабот Тогда
                    Если СтрНайти(ПорядковыйЭтапа21, " и ") > 0 Тогда
                        // Это третье и последующие дубли
                        ПорядковыйЭтапа21 = мРазноеКлиент.ПорядковыйНомер(й+1)+", "+ПорядковыйЭтапа21;
                        ПорядковыйЭтапаРП = мРазноеКлиент.ПорядковыйНомер(й+1, 2)+", "+ПорядковыйЭтапаРП;
                    ИначеЕсли ПорядковыйЭтапа21 = "" Тогда
                        // Это первое вхождение
                        ПорядковыйЭтапа21 = мРазноеКлиент.ПорядковыйНомер(й+1);
                        ПорядковыйЭтапаРП = мРазноеКлиент.ПорядковыйНомер(й+1, 2);
                    Иначе
                        // Это второе
                        ПорядковыйЭтапа21 = мРазноеКлиент.ПорядковыйНомер(й+1)+" и "+ПорядковыйЭтапа21;
                        ПорядковыйЭтапаРП = мРазноеКлиент.ПорядковыйНомер(й+1, 2)+" и "+ПорядковыйЭтапаРП;
                        СтрокаЭтапов21 = "этапы";
                        СтрокаЭтаповРП = "этапов";
                    КонецЕсли;
                    Если ПредУсловие = "" Тогда
                        ПредУсловие = мРазноеКлиент.ДлительностьВыполненияРаботСтрокой(ЭтапыДоговора[й].ДлительностьВыполненияРабот, ЭтапыДоговора[й].ВидДней);
                    КонецЕсли;
                    Если РезультатРаботы = "" Тогда
                        РезультатРаботы = ЭтапыДоговора[й].РезультатРаботы;
                    КонецЕсли;
                КонецЕсли;
                й=й-1;
            КонецЦикла; 
            ПорядковыйЭтапа21 =  ВРег(Лев(ПорядковыйЭтапа21, 1))+Сред(НРег(ПорядковыйЭтапа21), 2);
            селекция.Start = НачалоЗакладки; // Начало вставки
            селекция.Collapse();             // Вставка, а не замещение
            селекция.Paste();
            //НомерПодпункта = й+1;
            мРазноеКлиент.Заменить(Поиск, "%Подпункт21%", НомерПодпункта); 
            мРазноеКлиент.Заменить(Поиск, "%ПорядковыйЭтапа21%", ПорядковыйЭтапа21+" "+СтрокаЭтапов21); 
            мРазноеКлиент.Заменить(Поиск, "%ПорядковыйЭтапаРП%", ПорядковыйЭтапаРП+" "+СтрокаЭтаповРП); 
 			Если ц=0 Тогда
				мРазноеКлиент.Заменить(Поиск, "%СодержаниеПункта%", "со дня получения Подрядчиком подписанного со стороны Заказчика договора и предоставления необходимых документов, указанных в подпункте 1.6 договора"); 
			Иначе
				мРазноеКлиент.Заменить(Поиск, "%СодержаниеПункта%", "со дня предоставления Заказчиком документов, необходимых для выполнения работ по "+мРаботаСДоговорами.ПорядковыйНомер(НомерПодпункта, 3)+" этапу"); 
			КонецЕсли; 
            мРазноеКлиент.Заменить(Поиск, "%ПредУсловие%", ПредУсловие); 
            Док.Bookmarks("РезультатРаботы").Range.Text = ДобавитьТочку(РезультатРаботы); 
            ц=ц-1;
        КонецЦикла; 
		
	КонецЕсли; 
	
	// Пункт 3.1
	// Стоимость
	РеквизитыЛьготы = мРазноеКлиент.ПолучитьЛьготуНДС(ЭтапыДоговора);
	ЛьготаНДС = РеквизитыЛьготы.ЛьготаНДС;
	СтавкаНДСДляПрописи = ПолучитьПредставлениеСтавкиНДС(РеквизитыЛьготы.СтавкаНДСДляПрописи);
	
	СтоимостьДоговора = мРаботаСДоговорами.СуммаЧисломИПрописью(ЭтапыДоговора.Итог("СтоимостьСНДС"), ВалютаДоговора);
	Если ЭтапыДоговора.Итог("СуммаНДС") > 0 Тогда
		СуммаНДСПрописьюПолная = мРаботаСДоговорами.СуммаЧисломИПрописью(ЭтапыДоговора.Итог("СуммаНДС"), ВалютаДоговора);
		СтоимостьДоговора = СтоимостьДоговора + ", в том числе НДС по ставке " + СтавкаНДСДляПрописи +"% в сумме " + СуммаНДСПрописьюПолная;
	КонецЕсли;
	Док.Bookmarks("СтоимостьДоговора").Range.Text = СтоимостьДоговора; 
	
	Если ОдинЭтап Тогда
		мРазноеКлиент.Заменить(Поиск, "%ИзНих%", "."); 
		
		// Удаляем
		УдалитьЗакладку("ТаблицаДоговора");
		
	Иначе
		мРазноеКлиент.Заменить(Поиск, "%ИзНих%", ", из них выполнение работ:"); 
		
		// Запоминаем
		УдалитьЗакладку("СтрокаТаблицы");
		
		СтрокаФорматаЦен = ?(СКопейками, "ЧДЦ=2; ЧРД=.; ЧГ=3,0","ЧДЦ=; ЧГ=3,0"); 
		ФорматСтарыхЦен = "ЧРГ=' '; ЧН=-";
		ФорматНовыхЦен = "ЧДЦ=2; ЧРГ=' '; ЧН=-";
        
        Если ДатаДоговора < Дата(2016, 7, 1) Тогда
            СтрокаФорматаЦен = ФорматСтарыхЦен;
        Иначе	
            СтрокаФорматаЦен = ФорматНовыхЦен;
        КонецЕсли; 
		
		й=ЭтапыДоговора.Количество()-1;
		Пока й >= 0 Цикл
			селекция.Start = НачалоЗакладки; // Начало вставки
			селекция.Collapse();             // Вставка, а не замещение
			селекция.Paste();
			НомерПодпункта = й+1;
			мРазноеКлиент.Заменить(Поиск, "%ЭтапыРабот%", ДобавитьТочку(ЭтапыДоговора[й].НаименованиеРаботы)); 
			мРазноеКлиент.Заменить(Поиск, "%СтоимостьБезНДС%", Формат(ЭтапыДоговора[й].Стоимость, СтрокаФорматаЦен)); 
			мРазноеКлиент.Заменить(Поиск, "%СтавкаНДС%", ПолучитьПредставлениеСтавкиНДС(ЭтапыДоговора[й].СтавкаНДС)); 
			мРазноеКлиент.Заменить(Поиск, "%СуммаНДС%", Формат(ЭтапыДоговора[й].СуммаНДС, СтрокаФорматаЦен)); 
			мРазноеКлиент.Заменить(Поиск, "%Стоимость%", Формат(ЭтапыДоговора[й].СтоимостьСНДС, СтрокаФорматаЦен)); 
			й=й-1;
		КонецЦикла;
		// Всего
		мРазноеКлиент.Заменить(Поиск, "%СтоимостьБезНДСВсего%", Формат(ЭтапыДоговора.Итог("Стоимость"), СтрокаФорматаЦен)); 
		мРазноеКлиент.Заменить(Поиск, "%СуммаНДСВсего%", Формат(ЭтапыДоговора.Итог("СуммаНДС"), СтрокаФорматаЦен)); 
		мРазноеКлиент.Заменить(Поиск, "%СтоимостьВсего%", Формат(ЭтапыДоговора.Итог("СтоимостьСНДС"), СтрокаФорматаЦен)); 
	КонецЕсли; 
	
	Док.Bookmarks("ЛьготаНДС").Range.Text = ЛьготаНДС; 
	
	Док.Bookmarks("ИсточникФинанс").Range.Text = ИсточникФинанс; 
	
	// Подписи документа
	ВывестиПодписи(Док, СтруктураНашихРеквизитов, Подписи);
	
	// Вывод на печать или в файл
	ВывестиДокумент();
	
КонецПроцедуры // ПечатьДоговорТКП()

&НаКлиенте
Процедура ПечатьДоговорТКП()
	
	ПолучитьОбщиеДанныеДоговора();
	ПолучитьДанныеДоговораТКППОЭтапам();
	
	Если НоменклатураТаблица.Количество() = 0 Тогда
		Сообщить("В этапах нет данных по номенклатуре производства!");	
		Возврат;
	КонецЕсли; 
	
	Подписи = ПолучитьПодписиПодрядчика(Договор);
	СтруктураНашихРеквизитов = мРаботаСДоговорами.ПолучитьНашиРеквизиты(Договор);
	Город = мРазное.НашГород(СтруктураНашихРеквизитов);
	
	ИнициализироватьДокументWord();
	
	// Заполнение договора
	Если ГородБазы = "Минск" ИЛИ ГородБазы = "Прилуки" Тогда

		мРазноеКлиент.Заменить(Поиск, "%ТелефонНачОтдела%", ТелефонИсполнителя);  
		
		//Штрихкод
		ВставитьШтрихКод();
	КонецЕсли; 
	
	РегНомер = НомерДоговора;
	ДатаРег = Формат(ДатаДоговора,"ДЛФ=DD");
	мРазноеКлиент.Заменить(Поиск, "РегНомер", РегНомер);  
	мРазноеКлиент.Заменить(Поиск, "ДатаРег", ДатаРег); 
	мРазноеКлиент.Заменить(Поиск, "%Город", Город); 
	
	// Руководители
	Док.Bookmarks("Руководитель").Range.Text = ПолучитьСтрокуРуководителя(Подписи); 
	Док.Bookmarks("Доверенность").Range.Text = ПолучитьДоверенность(Подписи.Подписал, ДатаДоговора); 
	мРазноеКлиент.Заменить(Поиск, "%Заказчик%", Заказчики[0].ПолноеНаименование); 
	Док.Bookmarks("РуководительЗаказчик").Range.Text = ПолучитьСтрокуРуководителяЗаказчика(Заказчики[0].ПодписалОтКорреспондента); 
	
	РеквизитыЛьготы = мРазноеКлиент.ПолучитьЛьготуНДСНоменклатуры(НоменклатураТаблица);
	ЛьготаНДС = РеквизитыЛьготы.ЛьготаНДС;
	СтавкаНДСДляПрописи = ПолучитьПредставлениеСтавкиНДС(РеквизитыЛьготы.СтавкаНДСДляПрописи);
	
	// Стоимость
	СтоимостьДоговора = мРаботаСДоговорами.СуммаЧисломИПрописью(НоменклатураТаблица.Итог("Всего"), ВалютаДоговора);
	Если НоменклатураТаблица.Итог("НДС") > 0 Тогда
		СуммаНДСПрописьюПолная = мРаботаСДоговорами.СуммаЧисломИПрописью(НоменклатураТаблица.Итог("НДС"), ВалютаДоговора);
		СтоимостьДоговора = СтоимостьДоговора + ", в том числе НДС по ставке " + СтавкаНДСДляПрописи +"% в сумме " + СуммаНДСПрописьюПолная;
	КонецЕсли;
	
	Док.Bookmarks("СтоимостьДоговора1").Range.Text = СтоимостьДоговора; 
	
	// Таблица договора
	//работаем с копированием абзацев
	НачалоЗакладки = Док.Bookmarks("СтрокаТаблицы").Start;
	КонецЗакладки = Док.Bookmarks("СтрокаТаблицы").End;
	Селекция.Start = НачалоЗакладки;
	Селекция.End = КонецЗакладки;
	Селекция.Cut();   
	
	СтрокаФорматаЦен = ?(СКопейками, "ЧДЦ=2; ЧРД=.; ЧГ=3,0","ЧДЦ=; ЧГ=3,0"); 
	
	Для Каждого Стр Из НоменклатураТаблица Цикл
		селекция.Start = НачалоЗакладки; // Начало вставки
		//селекция.Collapse();             // Вставка, а не замещение
		селекция.Paste();
	
		мРазноеКлиент.Заменить(Поиск, "%Номенклатура", Стр.Номенклатура); 
		мРазноеКлиент.Заменить(Поиск, "%ЕдИзм", Стр.ЕдИзм); 
		мРазноеКлиент.Заменить(Поиск, "%Количество%", Стр.Количество); 
		мРазноеКлиент.Заменить(Поиск, "%Цена", Формат(Стр.Цена, СтрокаФорматаЦен)); 
		мРазноеКлиент.Заменить(Поиск, "%Сумма%", Формат(Стр.Сумма, СтрокаФорматаЦен)); 
		мРазноеКлиент.Заменить(Поиск, "%СтавкаНДС", Стр.СтавкаНДС); 
		мРазноеКлиент.Заменить(Поиск, "%НДС%", Формат(Стр.НДС, СтрокаФорматаЦен)); 
		мРазноеКлиент.Заменить(Поиск, "%Всего%", Формат(Стр.Всего, СтрокаФорматаЦен)); 
		
		СтавкаНДСДляПрописи = ?(Стр.НДС>0, Стр.СтавкаНДС, СтавкаНДСДляПрописи); 
		Если Стр.НДС = 0 Тогда
			ЛьготаНДС = "Вышеуказанные работы освобождаются от обложения налогом на добавленную стоимость.";
			//ЛьготаНДС = "В соответствии с "+СтрЭтапа.ОсвобождениеОтНДСДляПечати+" вышеуказанные работы освобождаются от обложения налогом на добавленную стоимость.";
		КонецЕсли; 
	КонецЦикла; 

	// ВСЕГО
	мРазноеКлиент.Заменить(Поиск, "%КоличествоВсего%", НоменклатураТаблица.Итог("Количество")); 
	мРазноеКлиент.Заменить(Поиск, "%СуммаВсего%", Формат(НоменклатураТаблица.Итог("Сумма"), СтрокаФорматаЦен)); 
	мРазноеКлиент.Заменить(Поиск, "%НДСВсего%", Формат(НоменклатураТаблица.Итог("НДС"), СтрокаФорматаЦен)); 
	мРазноеКлиент.Заменить(Поиск, "%ВсегоВсего%", Формат(НоменклатураТаблица.Итог("Всего"), СтрокаФорматаЦен)); 
	
	// Строка калькуляций
	СписокКалькуляций = Новый СписокЗначений; 
	Для каждого Стр Из НоменклатураТаблица Цикл
		ИскЭлемент = СписокКалькуляций.НайтиПоЗначению(Стр.КалькуляцияНомер);
		Если ИскЭлемент = Неопределено Тогда
			//СписокКалькуляций.Добавить(Стр.КалькуляцияНомер, "№ "+Формат(Число(Стр.КалькуляцияНомер),"ЧДЦ=; ЧГ=0")  + " от " + Формат(Стр.КалькуляцияДата, "ДФ=dd.MM.yy")); 
			СписокКалькуляций.Добавить(Стр.КалькуляцияНомер, "№ "+Стр.КалькуляцияНомер  + " от " + Формат(Стр.КалькуляцияДата, "ДФ=dd.MM.yy")); 
		КонецЕсли; 
	КонецЦикла;
	
	КоличествоКалькуляций = СписокКалькуляций.Количество();
	
	Если КоличествоКалькуляций = 0 Тогда
		СтрокаКалькуляции = "_______________________";	
	ИначеЕсли КоличествоКалькуляций = 1 Тогда	
		СтрокаКалькуляции = "калькуляции";
	Иначе	
		СтрокаКалькуляции = "калькуляций";
	КонецЕсли;
	
	Для каждого Кальк Из СписокКалькуляций Цикл
		СтрокаКалькуляции = СтрокаКалькуляции + " " + Кальк.Представление+",";	
	КонецЦикла; 
	СтрокаКалькуляции = Лев(СтрокаКалькуляции, СтрДлина(СтрокаКалькуляции)-1);	
	Док.Bookmarks("СтрокаКалькуляции").Range.Text = СтрокаКалькуляции; 
	Док.Bookmarks("ИсточникФинанс").Range.Text = ИсточникФинанс; 
	
	// Подписи документа
	ВывестиПодписи(Док, СтруктураНашихРеквизитов, Подписи);
	
	// Вывод на печать или в файл
	ВывестиДокумент();
	
КонецПроцедуры // ПечатьДоговорТКП()
	
&НаКлиенте
Процедура ПечатьДоговорПоставки()
	
	ПолучитьОбщиеДанныеДоговора();
	ПолучитьДанныеДоговораПоставкиПоЭтапам();
	
	Если НоменклатураТаблица.Количество() = 0 Тогда
		Сообщить("В этапах нет данных по номенклатуре производства!");	
		Возврат;
	КонецЕсли; 
	
	ИнициализироватьДокументWord();
			
	//Город = мРазное.ПолучитьГородБазы();
	Подписи = ПолучитьПодписиПодрядчика(Договор);
	СтруктураНашихРеквизитов = мРаботаСДоговорами.ПолучитьНашиРеквизиты(Договор);
	Город = мРазное.НашГород(СтруктураНашихРеквизитов);
	
	// Заполнение договора
	Если ГородБазы = "Минск" ИЛИ ГородБазы = "Прилуки" Тогда

		мРазноеКлиент.Заменить(Поиск, "%ТелефонНачОтдела%", ТелефонИсполнителя);  
		
		//Штрихкод
		ВставитьШтрихКод();
	КонецЕсли; 
	
	РегНомер = НомерДоговора;
	ДатаРег = Формат(ДатаДоговора,"ДЛФ=DD");
	мРазноеКлиент.Заменить(Поиск, "РегНомер", РегНомер);  
	мРазноеКлиент.Заменить(Поиск, "ДатаРег", ДатаРег); 
	мРазноеКлиент.Заменить(Поиск, "%Город", Город); 
	
	// Руководители
	Док.Bookmarks("Руководитель").Range.Text = ПолучитьСтрокуРуководителя(Подписи); 
	Док.Bookmarks("Доверенность").Range.Text = ПолучитьДоверенность(Подписи.Подписал, ДатаДоговора); 
	мРазноеКлиент.Заменить(Поиск, "%Заказчик%", Заказчики[0].ПолноеНаименование); 
	Док.Bookmarks("РуководительЗаказчик").Range.Text = ПолучитьСтрокуРуководителяЗаказчика(Заказчики[0].ПодписалОтКорреспондента); 
	
	РеквизитыЛьготы = мРазноеКлиент.ПолучитьЛьготуНДСНоменклатуры(НоменклатураТаблица);
	ЛьготаНДС = РеквизитыЛьготы.ЛьготаНДС;
	СтавкаНДСДляПрописи = ПолучитьПредставлениеСтавкиНДС(РеквизитыЛьготы.СтавкаНДСДляПрописи);
	
	ЦенаПрописью = "";
	Для Каждого Стр Из НоменклатураТаблица Цикл
		
		ЦенаПрописью = мРаботаСДоговорами.СуммаЧисломИПрописью(Стр.Цена, ВалютаДоговора);
		
	КонецЦикла; 
	
	// Стоимость
	СтоимостьДоговора = мРаботаСДоговорами.СуммаЧисломИПрописью(НоменклатураТаблица.Итог("Всего"), ВалютаДоговора);
	Если НоменклатураТаблица.Итог("НДС") > 0 Тогда
		СуммаНДСПрописьюПолная = мРаботаСДоговорами.СуммаЧисломИПрописью(НоменклатураТаблица.Итог("НДС"), ВалютаДоговора);
		СтоимостьДоговора = СтоимостьДоговора + ", в том числе НДС по ставке " + СтавкаНДСДляПрописи +"% в сумме " + СуммаНДСПрописьюПолная;
	КонецЕсли;
	
	мРазноеКлиент.Заменить(Поиск, "%Год", СтрЗаменить(Год(ДатаДоговора), Символы.НПП, "")); 
	мРазноеКлиент.Заменить(Поиск, "%ЦенаПрописью%", СокрЛП(ЦенаПрописью)); 
	
	Док.Bookmarks("СтоимостьДоговора1").Range.Text = СтоимостьДоговора; 
	
	// Таблица договора
	//работаем с копированием абзацев
	НачалоЗакладки = Док.Bookmarks("СтрокаТаблицы").Start;
	КонецЗакладки = Док.Bookmarks("СтрокаТаблицы").End;
	Селекция.Start = НачалоЗакладки;
	Селекция.End = КонецЗакладки;
	Селекция.Cut();   
	
	СтрокаФорматаЦен = ?(СКопейками, "ЧДЦ=2; ЧРД=.; ЧГ=3,0","ЧДЦ=; ЧГ=3,0"); 
	
	Для Каждого Стр Из НоменклатураТаблица Цикл
		селекция.Start = НачалоЗакладки; // Начало вставки
		//селекция.Collapse();             // Вставка, а не замещение
		селекция.Paste();
	
		мРазноеКлиент.Заменить(Поиск, "%Номенклатура", Стр.Номенклатура); 
		мРазноеКлиент.Заменить(Поиск, "%ЕдИзм", Стр.ЕдИзм); 
		мРазноеКлиент.Заменить(Поиск, "%КоличествоКвартал%", Стр.КоличествоКвартал); 
		мРазноеКлиент.Заменить(Поиск, "%Количество%", Стр.Количество); 
		мРазноеКлиент.Заменить(Поиск, "%Цена%", Формат(Стр.Цена, СтрокаФорматаЦен)); 
		мРазноеКлиент.Заменить(Поиск, "%Сумма%", Формат(Стр.Сумма, СтрокаФорматаЦен)); 
		мРазноеКлиент.Заменить(Поиск, "%СтавкаНДС", Стр.СтавкаНДС); 
		мРазноеКлиент.Заменить(Поиск, "%НДС%", Формат(Стр.НДС, СтрокаФорматаЦен)); 
		мРазноеКлиент.Заменить(Поиск, "%Всего%", Формат(Стр.Всего, СтрокаФорматаЦен)); 
		
		СтавкаНДСДляПрописи = ?(Стр.НДС>0, Стр.СтавкаНДС, СтавкаНДСДляПрописи); 
		Если Стр.НДС = 0 Тогда
			ЛьготаНДС = "Вышеуказанные работы освобождаются от обложения налогом на добавленную стоимость.";
			//ЛьготаНДС = "В соответствии с "+СтрЭтапа.ОсвобождениеОтНДСДляПечати+" вышеуказанные работы освобождаются от обложения налогом на добавленную стоимость.";
		КонецЕсли; 
	КонецЦикла; 

	// ВСЕГО
	мРазноеКлиент.Заменить(Поиск, "%КоличествоВсего%", НоменклатураТаблица.Итог("Количество")); 
	мРазноеКлиент.Заменить(Поиск, "%СуммаВсего%", Формат(НоменклатураТаблица.Итог("Сумма"), СтрокаФорматаЦен)); 
	мРазноеКлиент.Заменить(Поиск, "%НДСВсего%", Формат(НоменклатураТаблица.Итог("НДС"), СтрокаФорматаЦен)); 
	мРазноеКлиент.Заменить(Поиск, "%ВсегоВсего%", Формат(НоменклатураТаблица.Итог("Всего"), СтрокаФорматаЦен)); 
	
	Док.Bookmarks("ИсточникФинанс").Range.Text = ИсточникФинанс; 
	
	// Подписи документа
	ВывестиПодписи(Док, СтруктураНашихРеквизитов, Подписи);
	
	// Вывод на печать или в файл
	ВывестиДокумент();
	
КонецПроцедуры // ПечатьДоговорТКП()

&НаКлиенте
Процедура ПечатьДопСоглашениеЮрЛицаИзмОбъема()
	
	ПолучитьОбщиеДанныеДоговора();
	
	Подписи = ПолучитьПодписиПодрядчика(Договор, ДопСоглашение);
	СтруктураНашихРеквизитов = мРаботаСДоговорами.ПолучитьНашиРеквизиты(Договор);
	Город = мРазное.НашГород(СтруктураНашихРеквизитов);
	
	ИнициализироватьДокументWord();
	
	// Заполнение договора
	Если ГородБазы = "Минск" ИЛИ ГородБазы = "Прилуки" Тогда

		мРазноеКлиент.Заменить(Поиск, "%ТелефонНачОтдела%", ТелефонИсполнителя);  
		
		//Штрихкод
		ВставитьШтрихКод();
	КонецЕсли; 
	
	РегНомер = НомерДоговора;
	ДатаРег = Формат(ДатаДоговора,"ДЛФ=DD");
	мРазноеКлиент.Заменить(Поиск, "РегНомер", РегНомер);  
	мРазноеКлиент.Заменить(Поиск, "%НомерДопСогл%", НомерДопСоглашения);  
	мРазноеКлиент.Заменить(Поиск, "ДатаРег", ДатаРег); 
	мРазноеКлиент.Заменить(Поиск, "ТекДата", Формат(ДатаДопСоглашения, "ДЛФ=DD")); 
	мРазноеКлиент.Заменить(Поиск, "%Город", Город); 
	
	// Руководители
	Док.Bookmarks("Руководитель").Range.Text = ПолучитьСтрокуРуководителя(Подписи); 
	Док.Bookmarks("Доверенность").Range.Text = ПолучитьДоверенность(Подписи.Подписал, ДатаДоговора); 
	мРазноеКлиент.Заменить(Поиск, "%Заказчик%", Заказчики[0].ПолноеНаименование); 
	мРазноеКлиент.Заменить(Поиск, "%Свидетельство%", СвидетельствоОГосРегистрации); 
	Док.Bookmarks("РуководительЗаказчик").Range.Text = ПолучитьСтрокуРуководителяЗаказчика(Заказчики[0].ПодписалОтКорреспондента); 
	
	ОдинЭтап = Ложь;
	Если ЭтапыДоговора.Количество() = 1 Тогда
		ОдинЭтап = Истина;	
	КонецЕсли; 
	
	// Пункт 3.1
	// Стоимость
	РеквизитыЛьготы = мРазноеКлиент.ПолучитьЛьготуНДС(ЭтапыДоговора);
	ЛьготаНДС = РеквизитыЛьготы.ЛьготаНДС;
	СтавкаНДСДляПрописи = ПолучитьПредставлениеСтавкиНДС(РеквизитыЛьготы.СтавкаНДСДляПрописи);
    
    ДатаДеноминации = Дата(2016,7,1);
    СуммаПоДоговору = 0;
    СуммаНДСПоДоговору = 0;
    Для каждого Стр Из ЭтапыДоговора Цикл
        СуммаПоДоговору = СуммаПоДоговору + Стр.СтоимостьСНДС;
        СуммаНДСПоДоговору = СуммаНДСПоДоговору + Стр.СуммаНДС;
        //СуммаПоДоговору = СуммаПоДоговору + СуммаСУчетомДеноминации(Стр.СтоимостьСНДС, ДатаДеноминации, Стр.ДатаПоследнейЗаписи, Стр.Комментарий);
        //СуммаНДСПоДоговору = СуммаНДСПоДоговору + СуммаСУчетомДеноминации(Стр.СуммаНДС, ДатаДеноминации, Стр.ДатаПоследнейЗаписи, Стр.Комментарий);
    КонецЦикла; 
    
	СтоимостьДоговора = мРаботаСДоговорами.СуммаЧисломИПрописью(СуммаПоДоговору, ВалютаДоговора);
    //СтоимостьДоговора = мРаботаСДоговорами.СуммаЧисломИПрописью(ЭтапыДоговора.Итог("СтоимостьСНДС"), ВалютаДоговора);
    
	Если СуммаНДСПоДоговору > 0 Тогда
    //Если ЭтапыДоговора.Итог("СуммаНДС") > 0 Тогда
		СуммаНДСПрописьюПолная = мРаботаСДоговорами.СуммаЧисломИПрописью(СуммаНДСПоДоговору, ВалютаДоговора);
        //СуммаНДСПрописьюПолная = мРаботаСДоговорами.СуммаЧисломИПрописью(ЭтапыДоговора.Итог("СуммаНДС"), ВалютаДоговора);
		СтоимостьДоговора = СтоимостьДоговора + ", в том числе НДС по ставке " + СтавкаНДСДляПрописи +"% в сумме " + СуммаНДСПрописьюПолная;
	КонецЕсли;
	Док.Bookmarks("СтоимостьДоговора").Range.Text = СтоимостьДоговора; 
	
	Если ОдинЭтап Тогда
		мРазноеКлиент.Заменить(Поиск, "%ИзНих%", "."); 
		
		// Удаляем
		УдалитьЗакладку("ТаблицаДоговора");
		
	Иначе
		мРазноеКлиент.Заменить(Поиск, "%ИзНих%", ", из них выполнение работ:"); 
		
		// Запоминаем
		УдалитьЗакладку("СтрокаТаблицы");
		
		ФорматНовыхЦен = "ЧДЦ=2; ЧРГ=' '; ЧН=-";
        СтрокаФорматаЦен = ФорматНовыхЦен; 
        
        ИтогСтоимость = 0;
        ИтогСуммаНДС = 0;
        ИтогСтоимостьСНДС = 0;
        
		й=ЭтапыДоговора.Количество()-1;
		Пока й >= 0 Цикл
			селекция.Start = НачалоЗакладки; // Начало вставки
			селекция.Collapse();             // Вставка, а не замещение
			селекция.Paste();
			НомерПодпункта = й+1;
            Стоимость = ЭтапыДоговора[й].Стоимость;
            СуммаНДС = ЭтапыДоговора[й].СуммаНДС;
            СтоимостьСНДС = ЭтапыДоговора[й].СтоимостьСНДС;
			мРазноеКлиент.Заменить(Поиск, "%ЭтапыРабот%", ДобавитьТочку(ЭтапыДоговора[й].НаименованиеРаботы)); 
			мРазноеКлиент.Заменить(Поиск, "%СтоимостьБезНДС%", Формат(Стоимость, СтрокаФорматаЦен)); 
			мРазноеКлиент.Заменить(Поиск, "%СтавкаНДС%", ПолучитьПредставлениеСтавкиНДС(ЭтапыДоговора[й].СтавкаНДС)); 
			мРазноеКлиент.Заменить(Поиск, "%СуммаНДС%", Формат(СуммаНДС, СтрокаФорматаЦен)); 
			мРазноеКлиент.Заменить(Поиск, "%Стоимость%", Формат(СтоимостьСНДС, СтрокаФорматаЦен)); 
            
            ИтогСтоимость = ИтогСтоимость + Стоимость;
            ИтогСуммаНДС = ИтогСуммаНДС + СуммаНДС;
            ИтогСтоимостьСНДС = ИтогСтоимостьСНДС + СтоимостьСНДС;
			й=й-1;
		КонецЦикла;
		// Всего
		мРазноеКлиент.Заменить(Поиск, "%СтоимостьБезНДСВсего%", Формат(ИтогСтоимость, СтрокаФорматаЦен)); 
		мРазноеКлиент.Заменить(Поиск, "%СуммаНДСВсего%", Формат(ИтогСуммаНДС, СтрокаФорматаЦен)); 
		мРазноеКлиент.Заменить(Поиск, "%СтоимостьВсего%", Формат(ИтогСтоимостьСНДС, СтрокаФорматаЦен)); 
	КонецЕсли; 
	
	Док.Bookmarks("ЛьготаНДС").Range.Text = ЛьготаНДС; 
	
	СтоимостьЦифрами = мРаботаСДоговорами.СуммаЧисломИПрописью(ЭтапыДоговора.Итог("СтоимостьСНДС"), ВалютаДоговора, , Истина);
	Док.Bookmarks("СтоимостьЦифрами").Range.Text = СтоимостьЦифрами; 

	СтруктураРасчетов = мРаботаСДоговорами.ПолучитьСтрокуРасчетов(Договор, ДатаДопСоглашения);
	Расчеты = СтрокаРасчетов(СтруктураРасчетов);
	
	Док.Bookmarks("Расчеты").Range.Text = Расчеты; 
	
	// Подписи документа
	ВывестиПодписи(Док, СтруктураНашихРеквизитов, Подписи);
	
	// Вывод на печать или в файл
	ВывестиДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьДопСоглашениеЮрЛицаИзмРасчСчета()
	
	ПолучитьОбщиеДанныеДоговора();
	
	Подписи = ПолучитьПодписиПодрядчика(Договор, ДопСоглашение);
	СтруктураНашихРеквизитов = мРаботаСДоговорами.ПолучитьНашиРеквизиты(Договор);
	Город = мРазное.НашГород(СтруктураНашихРеквизитов);
	
	ИнициализироватьДокументWord();
	
	// Заполнение договора
	Если ГородБазы = "Минск" ИЛИ ГородБазы = "Прилуки" Тогда

		мРазноеКлиент.Заменить(Поиск, "%ТелефонНачОтдела%", ТелефонИсполнителя);  
		
		//Штрихкод
		ВставитьШтрихКод();
	КонецЕсли; 
	
	РегНомер = НомерДоговора;
	ДатаРег = Формат(ДатаДоговора,"ДЛФ=DD");
	мРазноеКлиент.Заменить(Поиск, "РегНомер", РегНомер);  
	мРазноеКлиент.Заменить(Поиск, "%НомерДопСогл%", НомерДопСоглашения);  
	мРазноеКлиент.Заменить(Поиск, "ДатаРег", ДатаРег); 
	мРазноеКлиент.Заменить(Поиск, "ТекДата", Формат(ДатаДопСоглашения, "ДЛФ=DD")); 
	мРазноеКлиент.Заменить(Поиск, "%Город", Город); 
	
	// Руководители
	Док.Bookmarks("Руководитель").Range.Text = ПолучитьСтрокуРуководителя(Подписи); 
	Док.Bookmarks("Доверенность").Range.Text = Подписи.ПодписалДоверенность; 
	//Док.Bookmarks("Доверенность").Range.Text = ПолучитьДоверенность(Подписи.Подписал, ДатаДоговора); 
	мРазноеКлиент.Заменить(Поиск, "%Заказчик%", Заказчики[0].ПолноеНаименование); 
	мРазноеКлиент.Заменить(Поиск, "%Свидетельство%", СвидетельствоОГосРегистрации); 
	Док.Bookmarks("РуководительЗаказчик").Range.Text = ПолучитьСтрокуРуководителяЗаказчика(Заказчики[0].ПодписалОтКорреспондента); 
	
	// Подписи документа
	ВывестиПодписи(Док, СтруктураНашихРеквизитов, Подписи);
	
	// Вывод на печать или в файл
	ВывестиДокумент();
	
КонецПроцедуры // ПечатьДопСоглашениеЮрЛицаИзмОбъема()

&НаКлиенте
Процедура ПечатьДопСоглашениеФизЛицаНДС()
	
	ПолучитьОбщиеДанныеДоговора();
	
	Подписи = ПолучитьПодписиПодрядчика(Договор, ДопСоглашение);
	СтруктураНашихРеквизитов = мРаботаСДоговорами.ПолучитьНашиРеквизиты(Договор);
	Город = мРазное.НашГород(СтруктураНашихРеквизитов);
	
	ИнициализироватьДокументWord();
	
	// Заполнение договора
	Если ГородБазы = "Минск" ИЛИ ГородБазы = "Прилуки" Тогда

		мРазноеКлиент.Заменить(Поиск, "%ТелефонНачОтдела%", ТелефонИсполнителя);  
		
		//Штрихкод
		ВставитьШтрихКод();
	КонецЕсли; 
	
	РегНомер = НомерДоговора;
	ДатаРег = Формат(ДатаДоговора,"ДЛФ=DD");
	мРазноеКлиент.Заменить(Поиск, "РегНомер", РегНомер);  
	мРазноеКлиент.Заменить(Поиск, "%НомерДопСогл%", НомерДопСоглашения);  
	мРазноеКлиент.Заменить(Поиск, "ДатаРег", ДатаРег); 
	мРазноеКлиент.Заменить(Поиск, "ТекДата", Формат(ДатаДопСоглашения, "ДЛФ=DD")); 
	мРазноеКлиент.Заменить(Поиск, "%Город", Город); 
	
	// Руководители
	Док.Bookmarks("Руководитель").Range.Text = ПолучитьСтрокуРуководителя(Подписи); 
	Док.Bookmarks("Доверенность").Range.Text = ПолучитьДоверенность(Подписи.Подписал, ДатаДоговора); 
	мРазноеКлиент.Заменить(Поиск, "%Свидетельство%", СвидетельствоОГосРегистрации);
	Если Заказчики.Количество() = 1 Тогда
		мРазноеКлиент.Заменить(Поиск, "%Заказчик%", Заказчики[0].ПолноеНаименование); 
	Иначе	
		СтрокаЗаказчиков = "";
		Для каждого Стр Из Заказчики Цикл
			СтрокаЗаказчиков = СтрокаЗаказчиков + СокрЛП(Стр.ПолноеНаименование)+", ";
		КонецЦикла; 
		СтрокаЗаказчиков = Лев(СтрокаЗаказчиков, СтрДлина(СтрокаЗаказчиков)-2);
		мРазноеКлиент.Заменить(Поиск, "%Заказчик%", СтрокаЗаказчиков); 
		мРазноеКлиент.Заменить(Поиск, "именуемый(ая) в дальнейшем «Заказчик»", "именуемые в дальнейшем «Заказчики»"); 
	КонецЕсли; 
	
	ОдинЭтап = Ложь;
	Если ЭтапыДоговора.Количество() = 1 Тогда
		ОдинЭтап = Истина;	
	КонецЕсли; 
	
	// Пункт 3.1
	// Стоимость
	РеквизитыЛьготы = мРазноеКлиент.ПолучитьЛьготуНДС(ЭтапыДоговора);
	ЛьготаНДС = РеквизитыЛьготы.ЛьготаНДС;
	СтавкаНДСДляПрописи = ПолучитьПредставлениеСтавкиНДС(РеквизитыЛьготы.СтавкаНДСДляПрописи);
    
    ДатаДеноминации = Дата(2016,7,1);
    СуммаПоДоговору = 0;
    СуммаНДСПоДоговору = 0;
    Для каждого Стр Из ЭтапыДоговора Цикл
        СуммаПоДоговору = СуммаПоДоговору + Стр.СтоимостьСНДС;
        СуммаНДСПоДоговору = СуммаНДСПоДоговору + Стр.СуммаНДС;
    КонецЦикла; 
    
	СтоимостьДоговора = мРаботаСДоговорами.СуммаЧисломИПрописью(СуммаПоДоговору, ВалютаДоговора);
	
	// Номер прейскуранта
	Док.Bookmarks("НомерПрейскуранта").Range.Text = ПолучитьНомерПрейскуранта(СтруктураНашихРеквизитов); 
    
	Если СуммаНДСПоДоговору > 0 Тогда
		СуммаНДСПрописьюПолная = мРаботаСДоговорами.СуммаЧисломИПрописью(СуммаНДСПоДоговору, ВалютаДоговора);
		СтоимостьДоговора = СтоимостьДоговора + ", в том числе НДС по ставке " + СтавкаНДСДляПрописи +"% в сумме " + СуммаНДСПрописьюПолная;
	КонецЕсли;
	Док.Bookmarks("СтоимостьДоговора").Range.Text = СтоимостьДоговора; 
	
	Если ОдинЭтап Тогда
		мРазноеКлиент.Заменить(Поиск, "%ИзНих%", "."); 
		
		// Удаляем
		УдалитьЗакладку("ТаблицаДоговора");
		
	Иначе
		мРазноеКлиент.Заменить(Поиск, "%ИзНих%", ", из них выполнение работ:"); 
		
		// Запоминаем
		УдалитьЗакладку("СтрокаТаблицы");
		
		ФорматНовыхЦен = "ЧДЦ=2; ЧРГ=' '; ЧН=-";
        
        СтоимостьИтог = 0;
        СуммаНДСИтог = 0;
        СтоимостьСНДСИтог = 0;
        
		й=ЭтапыДоговора.Количество()-1;
		Пока й >= 0 Цикл
			селекция.Start = НачалоЗакладки; // Начало вставки
			селекция.Collapse();             // Вставка, а не замещение
			селекция.Paste();
			
			мРазноеКлиент.Заменить(Поиск, "НомерЭтапа", ЭтапыДоговора[й].НомерЭтапа); 
			Док.Bookmarks("НаименованиеРаботы").Range.Text = ДобавитьТочку(ЭтапыДоговора[й].НаименованиеРаботы); 
			Док.Bookmarks("ЕдиницаИзмерения").Range.Text = "учас- ток"; 
			Док.Bookmarks("КоличествоУчастков").Range.Text = ЭтапыДоговора[й].КоличествоУчастков; 
			Док.Bookmarks("СтавкаНДС").Range.Text = ПолучитьПредставлениеСтавкиНДС(ЭтапыДоговора[й].СтавкаНДС); 
			
			Стоимость = ЭтапыДоговора[й].Стоимость;
            СуммаНДС = ЭтапыДоговора[й].СуммаНДС;
            СтоимостьСНДС = ЭтапыДоговора[й].СтоимостьСНДС;
			
			Док.Bookmarks("Стоимость").Range.Text = Формат(Стоимость, ФорматНовыхЦен); 
			Док.Bookmarks("СуммаНДС").Range.Text = Формат(СуммаНДС, ФорматНовыхЦен); 
			Док.Bookmarks("СтоимостьСНДС").Range.Text = Формат(СтоимостьСНДС, ФорматНовыхЦен); 
            
            СтоимостьИтог = СтоимостьИтог + Стоимость;
            СуммаНДСИтог = СуммаНДСИтог + СуммаНДС;
            СтоимостьСНДСИтог = СтоимостьСНДСИтог + СтоимостьСНДС;
			й=й-1;
		КонецЦикла;
		// Всего
		мРазноеКлиент.Заменить(Поиск, "СтоимостьИтог", Формат(СтоимостьИтог, ФорматНовыхЦен)); 
		мРазноеКлиент.Заменить(Поиск, "СуммаНДСИтог", Формат(СуммаНДСИтог, ФорматНовыхЦен)); 
		мРазноеКлиент.Заменить(Поиск, "СтоимостьСНДСИтог", Формат(СтоимостьСНДСИтог, ФорматНовыхЦен)); 
	КонецЕсли; 
	
	Док.Bookmarks("ЛьготаНДС").Range.Text = ЛьготаНДС; 
	
	СтоимостьЦифрами = мРаботаСДоговорами.СуммаЧисломИПрописью(ЭтапыДоговора.Итог("СтоимостьСНДС"), ВалютаДоговора, , Истина);
	Док.Bookmarks("СтоимостьЦифрами").Range.Text = СтоимостьЦифрами; 

	СтруктураРасчетов = мРаботаСДоговорами.ПолучитьСтрокуРасчетов(Договор, ДатаДопСоглашения);
	Расчеты = СтрокаРасчетов(СтруктураРасчетов);
	
	Док.Bookmarks("Расчеты").Range.Text = Расчеты; 
	
	// Подписи документа
	ВывестиПодписи(Док, СтруктураНашихРеквизитов, Подписи);
	
	// Вывод на печать или в файл
	ВывестиДокумент();
	
КонецПроцедуры // ПечатьДопСоглашениеЮрЛицаИзмОбъема()

&НаКлиенте
Процедура ПечатьДопСоглашениеФизЛицаИзмОбъема()
	
	ПолучитьОбщиеДанныеДоговора();
	
	Подписи = ПолучитьПодписиПодрядчика(Договор, ДопСоглашение);
	СтруктураНашихРеквизитов = мРаботаСДоговорами.ПолучитьНашиРеквизиты(Договор);
	Город = мРазное.НашГород(СтруктураНашихРеквизитов);
	
	ИнициализироватьДокументWord();
	
	// Заполнение договора
	Если ГородБазы = "Минск" ИЛИ ГородБазы = "Прилуки" Тогда

		мРазноеКлиент.Заменить(Поиск, "%ТелефонНачОтдела%", ТелефонИсполнителя);  
		
		//Штрихкод
		ВставитьШтрихКод();
	КонецЕсли; 
	
	РегНомер = НомерДоговора;
	ДатаРег = Формат(ДатаДоговора,"ДЛФ=DD");
	мРазноеКлиент.Заменить(Поиск, "РегНомер", РегНомер);  
	мРазноеКлиент.Заменить(Поиск, "%НомерДопСогл%", НомерДопСоглашения);  
	мРазноеКлиент.Заменить(Поиск, "ДатаРег", ДатаРег); 
	мРазноеКлиент.Заменить(Поиск, "ТекДата", Формат(ДатаДопСоглашения, "ДЛФ=DD")); 
	мРазноеКлиент.Заменить(Поиск, "%Город", Город); 
	
	// Руководители
	Док.Bookmarks("Руководитель").Range.Text = ПолучитьСтрокуРуководителя(Подписи); 
	Док.Bookmarks("Доверенность").Range.Text = ПолучитьДоверенность(Подписи.Подписал, ДатаДоговора); 
	мРазноеКлиент.Заменить(Поиск, "%Свидетельство%", СвидетельствоОГосРегистрации);
	Если Заказчики.Количество() = 1 Тогда
		мРазноеКлиент.Заменить(Поиск, "%Заказчик%", Заказчики[0].ПолноеНаименование); 
	Иначе	
		СтрокаЗаказчиков = "";
		Для каждого Стр Из Заказчики Цикл
			СтрокаЗаказчиков = СтрокаЗаказчиков + СокрЛП(Стр.ПолноеНаименование)+", ";
		КонецЦикла; 
		СтрокаЗаказчиков = Лев(СтрокаЗаказчиков, СтрДлина(СтрокаЗаказчиков)-2);
		мРазноеКлиент.Заменить(Поиск, "%Заказчик%", СтрокаЗаказчиков); 
		мРазноеКлиент.Заменить(Поиск, "именуемый(ая) в дальнейшем «Заказчик»", "именуемые в дальнейшем «Заказчики»"); 
	КонецЕсли; 
	
	ОдинЭтап = Ложь;
	Если ЭтапыДоговора.Количество() = 1 Тогда
		ОдинЭтап = Истина;	
	КонецЕсли; 
	
	// Пункт 3.1
	// Стоимость
	РеквизитыЛьготы = мРазноеКлиент.ПолучитьЛьготуНДС(ЭтапыДоговора);
	ЛьготаНДС = РеквизитыЛьготы.ЛьготаНДС;
	СтавкаНДСДляПрописи = ПолучитьПредставлениеСтавкиНДС(РеквизитыЛьготы.СтавкаНДСДляПрописи);
    
    ДатаДеноминации = Дата(2016,7,1);
    СуммаПоДоговору = 0;
    СуммаНДСПоДоговору = 0;
    Для каждого Стр Из ЭтапыДоговора Цикл
        СуммаПоДоговору = СуммаПоДоговору + Стр.СтоимостьСНДС;
        СуммаНДСПоДоговору = СуммаНДСПоДоговору + Стр.СуммаНДС;
    КонецЦикла; 
    
	СтоимостьДоговора = мРаботаСДоговорами.СуммаЧисломИПрописью(СуммаПоДоговору, ВалютаДоговора);
	
	// Номер прейскуранта
	Док.Bookmarks("НомерПрейскуранта").Range.Text = ПолучитьНомерПрейскуранта(СтруктураНашихРеквизитов); 
    
	Если СуммаНДСПоДоговору > 0 Тогда
		СуммаНДСПрописьюПолная = мРаботаСДоговорами.СуммаЧисломИПрописью(СуммаНДСПоДоговору, ВалютаДоговора);
		СтоимостьДоговора = СтоимостьДоговора + ", в том числе НДС по ставке " + СтавкаНДСДляПрописи +"% в сумме " + СуммаНДСПрописьюПолная;
	КонецЕсли;
	Док.Bookmarks("СтоимостьДоговора").Range.Text = СтоимостьДоговора; 
	
	Если ОдинЭтап Тогда
		мРазноеКлиент.Заменить(Поиск, "%ИзНих%", "."); 
		
		// Удаляем
		УдалитьЗакладку("ТаблицаДоговора");
		
	Иначе
		мРазноеКлиент.Заменить(Поиск, "%ИзНих%", ", из них выполнение работ:"); 
		
		// Запоминаем
		УдалитьЗакладку("СтрокаТаблицы");
		
		ФорматНовыхЦен = "ЧДЦ=2; ЧРГ=' '; ЧН=-";
        
        СтоимостьИтог = 0;
        СуммаНДСИтог = 0;
        СтоимостьСНДСИтог = 0;
        
		й=ЭтапыДоговора.Количество()-1;
		Пока й >= 0 Цикл
			селекция.Start = НачалоЗакладки; // Начало вставки
			селекция.Collapse();             // Вставка, а не замещение
			селекция.Paste();
			
			мРазноеКлиент.Заменить(Поиск, "НомерЭтапа", ЭтапыДоговора[й].НомерЭтапа); 
			Док.Bookmarks("НаименованиеРаботы").Range.Text = ДобавитьТочку(ЭтапыДоговора[й].НаименованиеРаботы); 
			Док.Bookmarks("ЕдиницаИзмерения").Range.Text = "учас- ток"; 
			Док.Bookmarks("КоличествоУчастков").Range.Text = ЭтапыДоговора[й].КоличествоУчастков; 
			Док.Bookmarks("СтавкаНДС").Range.Text = ПолучитьПредставлениеСтавкиНДС(ЭтапыДоговора[й].СтавкаНДС); 
			
			Стоимость = ЭтапыДоговора[й].Стоимость;
            СуммаНДС = ЭтапыДоговора[й].СуммаНДС;
            СтоимостьСНДС = ЭтапыДоговора[й].СтоимостьСНДС;
			
			Док.Bookmarks("Стоимость").Range.Text = Формат(Стоимость, ФорматНовыхЦен); 
			Док.Bookmarks("СуммаНДС").Range.Text = Формат(СуммаНДС, ФорматНовыхЦен); 
			Док.Bookmarks("СтоимостьСНДС").Range.Text = Формат(СтоимостьСНДС, ФорматНовыхЦен); 
            
            СтоимостьИтог = СтоимостьИтог + Стоимость;
            СуммаНДСИтог = СуммаНДСИтог + СуммаНДС;
            СтоимостьСНДСИтог = СтоимостьСНДСИтог + СтоимостьСНДС;
			й=й-1;
		КонецЦикла;
		// Всего
		мРазноеКлиент.Заменить(Поиск, "СтоимостьИтог", Формат(СтоимостьИтог, ФорматНовыхЦен)); 
		мРазноеКлиент.Заменить(Поиск, "СуммаНДСИтог", Формат(СуммаНДСИтог, ФорматНовыхЦен)); 
		мРазноеКлиент.Заменить(Поиск, "СтоимостьСНДСИтог", Формат(СтоимостьСНДСИтог, ФорматНовыхЦен)); 
	КонецЕсли; 
	
	Док.Bookmarks("ЛьготаНДС").Range.Text = ЛьготаНДС; 
	
	СтоимостьЦифрами = мРаботаСДоговорами.СуммаЧисломИПрописью(ЭтапыДоговора.Итог("СтоимостьСНДС"), ВалютаДоговора, , Истина);
	Док.Bookmarks("СтоимостьЦифрами").Range.Text = СтоимостьЦифрами; 

	СтруктураРасчетов = мРаботаСДоговорами.ПолучитьСтрокуРасчетов(Договор, ДатаДопСоглашения);
	Расчеты = СтрокаРасчетов(СтруктураРасчетов);
	
	Док.Bookmarks("Расчеты").Range.Text = Расчеты; 
	
	// Подписи документа
	ВывестиПодписи(Док, СтруктураНашихРеквизитов, Подписи);
	
	// Вывод на печать или в файл
	ВывестиДокумент();
	
КонецПроцедуры // ПечатьДопСоглашениеЮрЛицаИзмОбъема()

&НаКлиенте
Функция СтрокаРасчетов(СтруктураРасчетов)
	Если СтруктураРасчетов = Неопределено Тогда
		Результат = "оплачено – ___ белорусских рублей, к оплате/возврату – ____ белорусских рублей";
	Иначе
		РазницаСтоимости = СтруктураРасчетов.СтоимостьПосле - СтруктураРасчетов.СтоимостьДо;
		Если РазницаСтоимости > 0  Тогда
			Результат = "увеличение стоимости по дополнительному соглашению составило " + 
			мРаботаСДоговорами.СуммаЧисломИПрописью(РазницаСтоимости, ВалютаДоговора, , Истина);
		Иначе
			Результат = "уменьшение стоимости по дополнительному соглашению составило " + 
			мРаботаСДоговорами.СуммаЧисломИПрописью(-РазницаСтоимости, ВалютаДоговора, , Истина);
		КонецЕсли; 
		
		Оплачено = "";
		Если СтруктураРасчетов.Оплата > 0 Тогда
			Оплачено = ", оплачено "+мРаботаСДоговорами.СуммаЧисломИПрописью(СтруктураРасчетов.Оплата, ВалютаДоговора, , Истина);
		КонецЕсли; 
		
		Если СтруктураРасчетов.Оплата > СтруктураРасчетов.НоваяСтоимость Тогда
			Разница = СтруктураРасчетов.Оплата - СтруктураРасчетов.НоваяСтоимость;
			КВозврату = мРаботаСДоговорами.СуммаЧисломИПрописью(Разница, ВалютаДоговора, , Истина);
			Результат = Результат + Оплачено+", к возврату "+КВозврату;
			
		ИначеЕсли СтруктураРасчетов.НоваяСтоимость > СтруктураРасчетов.Оплата Тогда
			Разница = СтруктураРасчетов.НоваяСтоимость - СтруктураРасчетов.Оплата;
			КОплате = мРаботаСДоговорами.СуммаЧисломИПрописью(Разница, ВалютаДоговора, , Истина);
			Результат = Результат + Оплачено+", к оплате "+КОплате;
		Иначе
			Оплачено = мРаботаСДоговорами.СуммаЧисломИПрописью(СтруктураРасчетов.Оплата, ВалютаДоговора, , Истина);
			Результат = Результат + Оплачено;
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция СуммаСУчетомДеноминации(Сумма, ДатаДеноминации, ДатаПоследнейЗаписи, _Комментарий)
    Если ДатаПоследнейЗаписи >= ДатаДеноминации Тогда
        // Сумма уже деноминирована
        Возврат Сумма;
    КонецЕсли;

    Если СтрНайти(_Комментарий, "#Деном") = 0 Тогда
        // В этапе старая стоимость - деноминируем
        Возврат Окр(Сумма/10000, 2);
    Иначе
        // Этап деноминирован
        Возврат Сумма;
    КонецЕсли; 
    	
КонецФункции // СуммаСУчетомДеноминации()()

&НаСервере
Функция ПолучитьЦель() 
	Цель = " ";
	ИскСвойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Цель предоставления зем. участка физлицам");
	МасСвойств = Новый Массив;
	МасСвойств.Добавить(ИскСвойство);
	ТаблСвойств = УправлениеСвойствами.ПолучитьЗначенияСвойств(Договор, Истина, Ложь, МасСвойств); 
	Если ТаблСвойств.Количество() > 0 Тогда
		Цель = НРег(ТаблСвойств[0].Значение);
	КонецЕсли; 
	Возврат Цель;
КонецФункции

&НаСервере
Функция ПолучитьНомерПрейскуранта(СтруктураНашихРеквизитов)
	УстановитьПривилегированныйРежим(Истина);
    
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрейскурантСрезПоследних.Регистратор.НомерПриказа КАК НомерПриказа,
		|	ПрейскурантСрезПоследних.Регистратор.ДатаПриказа КАК ДатаПриказа,
		|	ПрейскурантСрезПоследних.Регистратор.ДолжностьУтвердившего КАК ДолжностьУтвердившего,
		|	ПрейскурантСрезПоследних.Регистратор.Номер КАК НомерПрейскуранта
		|ИЗ
		|	Справочник.мЭтапыДоговоров КАК ЭтапыДоговоров
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.мПрейскурант.СрезПоследних(&ДатаСреза, ) КАК ПрейскурантСрезПоследних
		|		ПО ЭтапыДоговоров.ВидРабот = ПрейскурантСрезПоследних.ВидРаботФизЛица
		|ГДЕ
		|	НЕ ЭтапыДоговоров.ПометкаУдаления И
		|	ЭтапыДоговоров.ДатаИсключенИзДоговора=ДатаВремя(1,1,1,0,0,0) И
		|	ЭтапыДоговоров.Владелец В(&МассивОбъектов)";

	Запрос.УстановитьПараметр("МассивОбъектов", Договор);
	Запрос.УстановитьПараметр("ДатаСреза", Договор.ДатаРегистрации);
	
	ТаблицаЭтапы = Запрос.Выполнить().Выгрузить();
	
	НашеНаименование = СтруктураНашихРеквизитов.НашеНаименованиеКратко;
	Если СтрНайти(НашеНаименование, "Борисовский") > 0 Тогда
		НашеНаименование = СокрЛП(Справочники.Организации.НайтиПоКоду("00-000001").Наименование);
	КонецЕсли; 
	
	РезультатОбработки = СокрЛП(ТаблицаЭтапы[0].НомерПрейскуранта) + ", утвержденным приказом " +
	НРег(СклонениеПоПадежам.обСклонениеСтроки(СокрЛП(ТаблицаЭтапы[0].ДолжностьУтвердившего), 2, "Должность"))+ " " + НашеНаименование + " от ";
	РезультатОбработки = РезультатОбработки + Формат(ТаблицаЭтапы[0].ДатаПриказа, "ДЛФ = DD");
	РезультатОбработки = РезультатОбработки + " № " + СокрЛП(ТаблицаЭтапы[0].НомерПриказа);
	Возврат РезультатОбработки;
КонецФункции

&НаСервере
Функция ПолучитьДанныеДоговораТКППОЭтапам()
	НоменклатураТаблица.Очистить();	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	мЭтапыДоговоровНоменклатура.Ссылка КАК ЭтапДоговора,
		|	мЭтапыДоговоровНоменклатура.НомерСтроки КАК НомерСтрокиНоменклатуры,
		|	мЭтапыДоговоровНоменклатура.НоменклатураПроизводства,
		|	мЭтапыДоговоровНоменклатура.Калькуляция,
		|	мЭтапыДоговоровНоменклатура.Цена,
		|	мЭтапыДоговоровНоменклатура.КоличествоКвартал,
		|	мЭтапыДоговоровНоменклатура.Количество,
		|	мЭтапыДоговоровНоменклатура.Сумма,
		|	мЭтапыДоговоровНоменклатура.СтавкаНДС.Наименование КАК СтавкаНДС,
		|	мЭтапыДоговоровНоменклатура.ОсвобождениеОтНДС,
		|	мЭтапыДоговоровНоменклатура.НДС,
		|	мЭтапыДоговоровНоменклатура.Всего,
		|	мЭтапыДоговоровНоменклатура.НоменклатураПроизводства.Наименование КАК Номенклатура,
		|	мЭтапыДоговоровНоменклатура.Калькуляция.Номер КАК КалькуляцияНомер,
		|	мЭтапыДоговоровНоменклатура.Калькуляция.Дата КАК КалькуляцияДата,
		|	мЭтапыДоговоровНоменклатура.НоменклатураПроизводства.ЕдиницаИзменения.Наименование КАК ЕдИзм
		|ИЗ
		|	Справочник.мЭтапыДоговоров.Номенклатура КАК мЭтапыДоговоровНоменклатура
		|ГДЕ
		|	мЭтапыДоговоровНоменклатура.Ссылка.Владелец = &Договор
		|	И НЕ мЭтапыДоговоровНоменклатура.Ссылка.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтрокиНоменклатуры УБЫВ";
	
	Запрос.УстановитьПараметр("Договор", Договор);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() = 0 Тогда
		Возврат Неопределено;	
	КонецЕсли; 
	
	Для каждого Стр Из Результат Цикл
	
		НовСтр = НоменклатураТаблица.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
	
	КонецЦикла; 
	Возврат Истина;
КонецФункции // ПолучитьДанныеДоговораТКППОЭтапам()

&НаСервере
Функция ПолучитьДанныеДоговораПоставкиПоЭтапам()
	НоменклатураТаблица.Очистить();	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	мЭтапыДоговоровНоменклатура.Ссылка КАК ЭтапДоговора,
		|	мЭтапыДоговоровНоменклатура.НомерСтроки КАК НомерСтрокиНоменклатуры,
		|	мЭтапыДоговоровНоменклатура.НоменклатураПроизводства,
		|	мЭтапыДоговоровНоменклатура.Калькуляция,
		|	мЭтапыДоговоровНоменклатура.Цена,
		|	мЭтапыДоговоровНоменклатура.КоличествоКвартал,
		|	мЭтапыДоговоровНоменклатура.Количество,
		|	мЭтапыДоговоровНоменклатура.Сумма,
		|	мЭтапыДоговоровНоменклатура.СтавкаНДС.Наименование КАК СтавкаНДС,
		|	мЭтапыДоговоровНоменклатура.ОсвобождениеОтНДС,
		|	мЭтапыДоговоровНоменклатура.НДС,
		|	мЭтапыДоговоровНоменклатура.Всего,
		|	мЭтапыДоговоровНоменклатура.НоменклатураПроизводства.Наименование КАК Номенклатура,
		|	мЭтапыДоговоровНоменклатура.Калькуляция.Номер КАК КалькуляцияНомер,
		|	мЭтапыДоговоровНоменклатура.Калькуляция.Дата КАК КалькуляцияДата,
		|	мЭтапыДоговоровНоменклатура.НоменклатураПроизводства.ЕдиницаИзменения.Наименование КАК ЕдИзм
		|ИЗ
		|	Справочник.мЭтапыДоговоров.Номенклатура КАК мЭтапыДоговоровНоменклатура
		|ГДЕ
		|	мЭтапыДоговоровНоменклатура.Ссылка.Владелец = &Договор
		|	И НЕ мЭтапыДоговоровНоменклатура.Ссылка.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтрокиНоменклатуры УБЫВ";
	
	Запрос.УстановитьПараметр("Договор", Договор);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() = 0 Тогда
		Возврат Неопределено;	
	КонецЕсли; 
	
	Для каждого Стр Из Результат Цикл
	
		НовСтр = НоменклатураТаблица.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
	
	КонецЦикла; 
	Возврат Истина;
КонецФункции // ПолучитьДанныеДоговораТКППОЭтапам()

#Область УправлениеДиалогом
&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	// При изменении договора по его виду документа 
	//  отбираются настройки для печати
	//  После выбора настройки - шаблон уже известен
	
	ЗаполнитьСписокНастроекПечати();
	ЗаполнитьНастройку();
	СформироватьИмяФайла();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокНастроекПечати()
	СписокНастроекПечати.Очистить();
	Если ЗначениеЗаполнено(Договор) Тогда
		Если ЗначениеЗаполнено(ДопСоглашение) Тогда
			ВидДокумента = ДопСоглашение.ВидДокумента;
			РеквДопСогл = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ДопСоглашение, "ДатаРегистрации, РегистрационныйНомер");
			НомерДопСоглашения = РеквДопСогл.РегистрационныйНомер;
			ДатаДопсоглашения = РеквДопСогл.ДатаРегистрации;
		Иначе	
			ВидДокумента = Договор.ВидДокумента;
		КонецЕсли;
	КонецЕсли; 
	
	Отбор = Новый Структура("ВидДокумента", ВидДокумента);
	ИскСтроки = НастройкиПечати.НайтиСтроки(Отбор);
	
	Для каждого Настройка Из ИскСтроки Цикл
		СписокНастроекПечати.Добавить(Настройка.Настройка, Настройка.НаименованиеНастройки); 
	КонецЦикла; 
	
	НомерДоговора = Договор.РегистрационныйНомер;
	//ВидДоговора = Договор.ВидДокумента;
	ВидДоговора = ВидДокумента;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНастройку()
	СистемнаяИнформация = Новый СистемнаяИнформация();
	ИдентификаторКлиента = СистемнаяИнформация.ИдентификаторКлиента;
	
	//НастройкаПечати = "";
	Если СписокНастроекПечати.Количество()>0 Тогда
		СохраненнаяНастройкаПечати = 
		ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(""+ВидДоговора, ИдентификаторКлиента);
		
		Если СохраненнаяНастройкаПечати = Неопределено Тогда
			НастройкаПечати = СписокНастроекПечати[0].Значение;	
		Иначе
			НастройкаПечати = СохраненнаяНастройкаПечати;	
		КонецЕсли;
		ШаблонДоговора = ПолучитьФайлШаблона(НастройкаПечати);
	КонецЕсли; 
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьФайлШаблона(НастройкаПечати) 
	Возврат НастройкаПечати.ФайлШаблона;
КонецФункции

&НаКлиенте
Процедура СохранитьНастройкуПечати() 
	МассивСтруктур = Новый Массив;
	
	СистемнаяИнформация = Новый СистемнаяИнформация();
	ИдентификаторКлиента = СистемнаяИнформация.ИдентификаторКлиента;
	
	Элемент = Новый Структура;
	Элемент.Вставить("Объект", ""+ВидДоговора);
	Элемент.Вставить("Настройка", ИдентификаторКлиента);
	Элемент.Вставить("Значение", НастройкаПечати);
	
	МассивСтруктур.Добавить (Элемент);
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранитьМассив(МассивСтруктур);
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьНазваниеПроцедуры(НастройкаПечати) 
	Возврат НастройкаПечати.НазваниеПроцедуры;
КонецФункции

&НаКлиенте
Процедура НастройкаПечатиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = СписокНастроекПечати;
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПечатиПриИзменении(Элемент)
	ШаблонДоговора = ПолучитьФайлШаблона(НастройкаПечати);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьНастройку(); 
	Элементы.ИмяФайла.ТолькоПросмотр = Не СоздатьДокумент;
	СформироватьИмяФайла();
КонецПроцедуры
	
&НаСервере
Процедура ОбновитьНастройкиНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	мНастройкиПечатиДоговоров.НазваниеПроцедуры,
		|	мНастройкиПечатиДоговоров.ВидДокумента,
		|	мНастройкиПечатиДоговоров.ФайлШаблона,
		|	мНастройкиПечатиДоговоров.Наименование КАК НаименованиеНастройки,
		|	мНастройкиПечатиДоговоров.Ссылка КАК Настройка
		|ИЗ
		|	Справочник.мНастройкиПечатиДоговоров КАК мНастройкиПечатиДоговоров
		|ГДЕ
		|	НЕ мНастройкиПечатиДоговоров.ПометкаУдаления";
	
	Результат = Запрос.Выполнить().Выгрузить();
	ЗначениеВРеквизитФормы(Результат, "НастройкиПечати");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНастройки(Команда)
	ОбновитьНастройкиНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПутьКШаблону(ШаблонДоговора) 
	Возврат ШаблонДоговора.ТекущаяВерсияТом.ПолныйПутьWindows + ШаблонДоговора.ТекущаяВерсияПутьКФайлу;
КонецФункции

&НаКлиенте
Процедура СоздатьДокументПриИзменении(Элемент)
	Элементы.ИмяФайла.ТолькоПросмотр = Не СоздатьДокумент;
КонецПроцедуры

#КонецОбласти

#Область ОбщиеПроцедурыПечати

&НаКлиенте
Процедура ИнициализироватьДокументWord() 
	ВременныйПуть = КаталогВременныхФайлов();
	//ПутьКФайлуНаДиске = ВременныйПуть + "Договор "+ИмяФайла+".docx";
	ПутьКФайлуНаДиске = ВременныйПуть + ИмяФайла;
    
    АдресХранения = ПолучитьАдресФайлаШаблона(ШаблонДоговора);
    
    Описание=Новый ОписаниеПередаваемогоФайла(ПутьКФайлуНаДиске, АдресХранения);
    МассивОписаний=Новый Массив;
    МассивОписаний.Добавить(Описание);
    ПолучитьФайлы(МассивОписаний,,,Ложь);

    
    //ПутьКШаблону = ПолучитьПутьКШаблону(ШаблонДоговора); 
    //
    //ФайлШаблона = Новый ДвоичныеДанные(ПутьКШаблону);
    //ФайлШаблона.Записать(ПутьКФайлуНаДиске);
	
	//Если ТипЗнч(WordApp) <> Тип("COMОбъект") Тогда
		WordApp = Новый COMОбъект("Word.Application");
	//КонецЕсли; 
	
	Док = WordApp.Documents.ADD(ПутьКФайлуНаДиске);
	
	Селекция = WordApp.Selection;
	
	Поиск = Док.Content.Find;
	Поиск.ClearFormatting();
	Поиск.Replacement.ClearFormatting();
КонецПроцедуры 

&НаКлиенте
Функция СформироватьИмяФайла() 
	Если ЗначениеЗаполнено(ДопСоглашение) Тогда
		ИмяФайла = СтрЗаменить(НомерДопСоглашения, "/", "-");
		ИмяФайла = СтрЗаменить(ИмяФайла, "\", "-");
		ИмяФайла = "Допсогл "+СокрЛП(ИмяФайла)+".docx";
	Иначе	
		ИмяФайла = СтрЗаменить(НомерДоговора, "/", "-");
		ИмяФайла = СтрЗаменить(ИмяФайла, "\", "-");
		ИмяФайла = "Договор "+СокрЛП(ИмяФайла)+".docx";
	КонецЕсли; 
КонецФункции 

&НаКлиенте
Процедура ВывестиПодписи(Док, СтруктураНашихРеквизитов, Подписи) 
	ВывестиНашиПодписи(Док, СтруктураНашихРеквизитов, Подписи);
	ВывестиПодписиЗаказчика(Док);
КонецПроцедуры 

&НаКлиенте
Процедура ВывестиНашиПодписи(Док, Рекв, Подписи)
	
	мРазноеКлиент.Заменить(Поиск, "НашеНаименование", Рекв.НашеНаименование);  
	мРазноеКлиент.Заменить(Поиск, "НашАдрес", Рекв.НашАдрес);  
	
	НашБанк = Рекв.НашБанк + ?(ЗначениеЗаполнено(Рекв.НашАдресБанка), ", "+Рекв.НашАдресБанка, "");
	мРазноеКлиент.Заменить(Поиск, "НашБанк", НашБанк);  
	//мРазноеКлиент.Заменить(Поиск, "НашРасчетныйСчет", Рекв.НашСчет+", БИК "+Рекв.НашКодБанка);  
	мРазноеКлиент.Заменить(Поиск, "НашРасчетныйСчет", Рекв.НашРасчетныйСчет);   
	мРазноеКлиент.Заменить(Поиск, "НашСчетИБАН", Рекв.НашСчетИБАН);  
	мРазноеКлиент.Заменить(Поиск, "НашБИКБанка", Рекв.НашБИКБанка);  
	мРазноеКлиент.Заменить(Поиск, "НашУНП", Рекв.НашУНП);  
	мРазноеКлиент.Заменить(Поиск, "НашОКПО", Рекв.НашОКПО);  
	мРазноеКлиент.Заменить(Поиск, "НашТелефон", Рекв.НашТелефон);  
	
	//Для каждого Реквизит Из СтруктураНашихРеквизитов Цикл
	//	Если Реквизит.Ключ = "Свидетельство" Тогда
	//		Продолжить;
	//	КонецЕсли; 
	//	мРазноеКлиент.Заменить(Поиск, Реквизит.Ключ, Реквизит.Значение);  
	//КонецЦикла;
	
	ВывестиПоле(Док, "%ПодписалДолжность", Подписи.ПодписалДолжность, "_________________ ");
	ВывестиПоле(Док, "%ПодписалКратко", Подписи.ПодписалКратко, "_________________ ");
	
	мРазноеКлиент.Заменить(Поиск, "ОтделИсполнителя", ОтделИсполнителя);  
	мРазноеКлиент.Заменить(Поиск, "ДолжностьИсполнителя", ДолжностьИсполнителя);  
	//Док.Bookmarks("Исполнитель").Range.Text = НачИсполнителя; 
	мРазноеКлиент.Заменить(Поиск, "%Исполнитель", ФизическиеЛицаКлиентСервер.ФамилияИнициалыФизЛица(Строка(НачИсполнителя),,,,Ложь));  
	//мРазноеКлиент.Заменить(Поиск, "%Исполнитель", ПолучитьИсполнителяКратко(НачИсполнителя));  
	мРазноеКлиент.Заменить(Поиск, "ТелефонИсполнителя", ТелефонИсполнителя);  
	
КонецПроцедуры 

&НаКлиенте
Процедура ВывестиПодписиЗаказчика(Док)
	Если ЭтоФизЛица Тогда
		ВывестиПодписиЗаказчикаФизЛица(Док);
	Иначе
		ВывестиПодписиЗаказчикаЮрЛица(Док);
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ВывестиПодписиЗаказчикаФизЛица(Док)
	
	Если Заказчики.Количество() = 1 Тогда
		НомерЗаказчика = "";
		ВывестиПоле(Док, "%НомерЗаказчика%", НомерЗаказчика);
		ВывестиПоле(Док, "%ЗаказчикПодпись%", Заказчики[0].ПолноеНаименование);
		
		Если ГородБазы = "Брест" Тогда
			// Данные пастпорта не надо
			ВывестиПоле(Док, "%Паспорт%", "");
			ВывестиПоле(Док, "%НомерПаспорта%", "");
			ВывестиПоле(Док, "%Выдан%", "");
			ВывестиПоле(Док, "%ДанныеВыдачиПаспорта%", "");
		Иначе
			ВывестиПоле(Док, "%Паспорт%", "Паспорт: ");
			НомерПаспорта = Заказчики[0].СерияПаспорта+Заказчики[0].НомерПаспорта;
			ВывестиПоле(Док, "%НомерПаспорта%", НомерПаспорта, "_______________", Истина);
			ВывестиПоле(Док, "%Выдан%", "Выдан: ");
			ДанныеВыдачиПаспорта = Формат(Заказчики[0].ДатаВыдачи, "ДФ=dd.MM.yyyy")+" "+СокрЛП(Заказчики[0].КемВыдан); 
			ВывестиПоле(Док, "%ДанныеВыдачиПаспорта%", ДанныеВыдачиПаспорта, "_______________", Истина);
		КонецЕсли; 
		ВывестиПоле(Док, "%Адрес%", Заказчики[0].Адрес);
		Телефон = "";
		Если ЗначениеЗаполнено(Заказчики[0].ДомашнийТелефон) Тогда
			Телефон = Заказчики[0].ДомашнийТелефон;
		КонецЕсли; 
		Если ЗначениеЗаполнено(Заказчики[0].МобильныйТелефон) Тогда
			Телефон = Телефон + ?(Телефон = "", " ", ", ");  
			Телефон = Телефон + Заказчики[0].МобильныйТелефон;
		КонецЕсли; 
		ВывестиПоле(Док, "%ТелефонЗаказчика%", Телефон, "_______________");
		
		ВывестиПоле(Док, "КорреспондентКратко", ФизическиеЛицаКлиентСервер.ФамилияИнициалыФизЛица(Заказчики[0].КорреспондентКратко,,,,Ложь), "______________________");
	Иначе	
		УдалитьЗакладку("ПодписиЗаказчиков");
		
		й=Заказчики.Количество()-1;
		Пока й >= 0 Цикл
			селекция.Start = НачалоЗакладки; // Начало вставки
			селекция.Collapse();             // Вставка, а не замещение
			селекция.Paste();
			НомерЗаказчика = й+1;
			ВывестиПоле(Док, "%НомерЗаказчика%", " " + НомерЗаказчика);
			ВывестиПоле(Док, "%ЗаказчикПодпись%", Заказчики[й].ПолноеНаименование);
			Если ГородБазы = "Брест" Тогда
				// Данные пастпорта не надо
				ВывестиПоле(Док, "%Паспорт%", "");
				ВывестиПоле(Док, "%НомерПаспорта%", "");
				ВывестиПоле(Док, "%Выдан%", "");
				ВывестиПоле(Док, "%ДанныеВыдачиПаспорта%", "");
			Иначе
				ВывестиПоле(Док, "%Паспорт%", "Паспорт: ");
				НомерПаспорта = Заказчики[й].СерияПаспорта+Заказчики[й].НомерПаспорта;
				ВывестиПоле(Док, "%НомерПаспорта%", НомерПаспорта, "_______________", Истина);
				ВывестиПоле(Док, "%Выдан%", "Выдан: ");
				ДанныеВыдачиПаспорта = Формат(Заказчики[й].ДатаВыдачи, "ДФ=dd.MM.yyyy")+" "+СокрЛП(Заказчики[й].КемВыдан); 
				ВывестиПоле(Док, "%ДанныеВыдачиПаспорта%", ДанныеВыдачиПаспорта, "_______________", Истина);
			КонецЕсли; 
			ВывестиПоле(Док, "%Адрес%", Заказчики[й].Адрес);
			
			Телефон = "";
			Если ЗначениеЗаполнено(Заказчики[й].ДомашнийТелефон) Тогда
				Телефон = Заказчики[й].ДомашнийТелефон;
			КонецЕсли; 
			Если ЗначениеЗаполнено(Заказчики[й].МобильныйТелефон) Тогда
				Телефон = Телефон + ?(Телефон = "", " ", ", ");  
				Телефон = Телефон + Заказчики[й].МобильныйТелефон;
			КонецЕсли; 
			ВывестиПоле(Док, "%ТелефонЗаказчика%", Телефон, "_______________");
			
			ВывестиПоле(Док, "КорреспондентКратко", ФизическиеЛицаКлиентСервер.ФамилияИнициалыФизЛица(Заказчики[й].КорреспондентКратко,,,,Ложь), "______________________");
			й=й-1;
		КонецЦикла; 
	КонецЕсли; 
КонецПроцедуры 

&НаКлиенте
Процедура ВывестиПоле(Док, Что, НаЧто, Заменитель = "", ПереводСтроки=Ложь)
	Вставка = Заменитель;
	Если ЗначениеЗаполнено(НаЧто) Тогда
		Вставка = НаЧто;	
	КонецЕсли; 
	Если ПереводСтроки Тогда
		Вставка = Вставка+Символы.ВК;			
	КонецЕсли; 
	мРазноеКлиент.Заменить(Поиск, Что, Вставка); 
КонецПроцедуры 
 
&НаКлиенте
Процедура ВывестиПодписиЗаказчикаЮрЛица(Док)
	
	мРазноеКлиент.Заменить(Поиск, "%Адрес%", Заказчики[0].Адрес); 
	
	Если ЗначениеЗаполнено(Заказчики[0].НомерСчета) Тогда
		РасчетныйСчет = Заказчики[0].НомерСчета + " " + Заказчики[0].Банк + 
		?(ЗначениеЗаполнено(Заказчики[0].БанкАдрес), ", "+Заказчики[0].БанкАдрес, "")+ ", БИК "+Заказчики[0].КодБанка;
	Иначе
		РасчетныйСчет = "____________ _______________ _________________, БИК _________";
	КонецЕсли; 
	
	Банк = Заказчики[0].Банк + ?(ЗначениеЗаполнено(Заказчики[0].БанкАдрес), ", "+Заказчики[0].БанкАдрес, "");
	мРазноеКлиент.Заменить(Поиск, "%Банк%", Банк);  
	
	//Если ЗначениеЗаполнено(Заказчики[0].СчетИБАН) Тогда
		//мРазноеКлиент.Заменить(Поиск, "%До%", "До 30.06.2017: ");  
		//мРазноеКлиент.Заменить(Поиск, "%ЗагРасчетныйСчет% ", "Расчетный счет: ");  
		//мРазноеКлиент.Заменить(Поиск, "%РасчетныйСчет%", Заказчики[0].НомерСчета + ", БИК "+Заказчики[0].КодБанка + Символы.ВК);  
		мРазноеКлиент.Заменить(Поиск, "%РасчетныйСчет%", РасчетныйСчет + Символы.ВК);  
		//мРазноеКлиент.Заменить(Поиск, "%После%", "С 04.07.2017:" + Символы.ВК);  
		//мРазноеКлиент.Заменить(Поиск, "%ЗагСчетИБАН%", "Расчетный счет:");  
		мРазноеКлиент.Заменить(Поиск, "%СчетИБАН%", Заказчики[0].СчетИБАН);  
		//мРазноеКлиент.Заменить(Поиск, "%ЗагБИКБанка%", "БИК:");  
		мРазноеКлиент.Заменить(Поиск, "%БИКБанка%", Заказчики[0].БИКБанка);  
	//Иначе
	//	мРазноеКлиент.Заменить(Поиск, "%До%", "");  
	//	мРазноеКлиент.Заменить(Поиск, "%ЗагРасчетныйСчет% ", "Расчетный счет: ");  
	//	мРазноеКлиент.Заменить(Поиск, "%РасчетныйСчет%", Заказчики[0].НомерСчета + ", БИК "+Заказчики[0].КодБанка);  
	//	мРазноеКлиент.Заменить(Поиск, "%После%", "");  
	//	мРазноеКлиент.Заменить(Поиск, "%ЗагСчетИБАН%", "");  
	//	мРазноеКлиент.Заменить(Поиск, "%СчетИБАН%", "");  
	//	мРазноеКлиент.Заменить(Поиск, "%ЗагБИКБанка%", "");  
	//	мРазноеКлиент.Заменить(Поиск, "%БИКБанка%", "");  
	//КонецЕсли;
	
	мРазноеКлиент.Заменить(Поиск, "%УНП%", Заказчики[0].УНП);
	Если ЗначениеЗаполнено(Заказчики[0].ОКПО) Тогда
		мРазноеКлиент.Заменить(Поиск, "%НаимОКПО%", "ОКПО");  
		мРазноеКлиент.Заменить(Поиск, "%ОКПО%", Заказчики[0].ОКПО+",");  
	Иначе
		мРазноеКлиент.Заменить(Поиск, "%НаимОКПО%", "");  
		мРазноеКлиент.Заменить(Поиск, "%ОКПО%", "");  
	КонецЕсли; 
	мРазноеКлиент.Заменить(Поиск, "%Телефон%", Заказчики[0].Телефон); 
	Если ЗначениеЗаполнено(Заказчики[0].КодФилиала) Тогда
		мРазноеКлиент.Заменить(Поиск, "%КодФилиала%", "Код филиала для ЭСЧФ " + Заказчики[0].КодФилиала);
	Иначе
		мРазноеКлиент.Заменить(Поиск, "%КодФилиала%", "");
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Заказчики[0].ДолжностьКорр) Тогда
		мРазноеКлиент.Заменить(Поиск, "ДолжностьКорр", Заказчики[0].ДолжностьКорр);  
	Иначе
		мРазноеКлиент.Заменить(Поиск, "ДолжностьКорр", "________________________ ");  
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Заказчики[0].КорреспондентКратко) Тогда
		мРазноеКлиент.Заменить(Поиск, "КорреспондентКратко", Заказчики[0].КорреспондентКратко);  
	Иначе
		мРазноеКлиент.Заменить(Поиск, "КорреспондентКратко", "________________________ ");  
	КонецЕсли; 
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьФизЛицоКорреспондента(Договор) 
	Возврат Договор.Корреспондент.ФизЛицо;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьИсполнителяКратко(Исполнитель) 
    Если ЗначениеЗаполнено(Исполнитель) Тогда
        Возврат Исполнитель.ПредставлениеВДокументах;
    Иначе
        Возврат "_____________";
    КонецЕсли; 
КонецФункции

&НаКлиенте
Процедура ВывестиДокумент() 
	Если НЕ СоздатьДокумент Тогда
		//WordApp.Visible = Истина; 
		
		Док.SaveAs(ПутьКФайлуНаДиске);//(ПутьКФайлуНаДиске)                        
		Док.Saved = Истина;
		//Док.PrintOut();
		Док.Close(); 
		WordApp.Quit();	
		WordApp = Неопределено;
		
		ЗапуститьПриложение(ПутьКФайлуНаДиске,, , ); 
		
	Иначе
		WordApp.Visible = Ложь; 
		
		Док.SaveAs(ПутьКФайлуНаДиске);//(ПутьКФайлуНаДиске)                        
		Док.Saved = Истина;
		Док.Close(); 
		
		РаботаСФайламиКлиент.СоздатьДокументНаОсновеФайла(ПутьКФайлуНаДиске, Договор, ЭтаФорма, Истина, , , , ,);
        Если ЗначениеЗаполнено(ДопСоглашение) Тогда
    		РаботаСФайламиКлиент.СоздатьДокументНаОсновеФайла(ПутьКФайлуНаДиске, ДопСоглашение, ЭтаФорма, Истина, , , , ,);
        КонецЕсли; 
		
		WordApp.Quit();	
		WordApp = Неопределено;
		
		УдалитьФайлы(ПутьКФайлуНаДиске);	
	КонецЕсли; 
КонецПроцедуры 

&НаКлиенте
Функция ДобавитьТочку(ТекстВывода)
	Если Не ЗначениеЗаполнено(ТекстВывода) Тогда
		Возврат "";	
	ИначеЕсли Прав(СокрЛП(ТекстВывода), 1) = "." Тогда
		// Точка уже есть
		Возврат ТекстВывода;
	Иначе
		Возврат ТекстВывода + ".";	
	КонецЕсли; 
КонецФункции

&НаКлиенте
Процедура УдалитьЗакладку(ИмяЗакладки) 
	НачалоЗакладки = Док.Bookmarks(ИмяЗакладки).Start;
	КонецЗакладки = Док.Bookmarks(ИмяЗакладки).End;
	Селекция.Start = НачалоЗакладки;
	Селекция.End = КонецЗакладки;
	Селекция.Cut();   
КонецПроцедуры 

#КонецОбласти 

&НаСервере
Процедура ПолучитьОбщиеДанныеДоговора()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЭтапыДоговоров.Ссылка КАК ЭтапДоговора,
		|	ЭтапыДоговоров.НомерЭтапа КАК НомерЭтапа,
		|	ЭтапыДоговоров.ВидРабот,
		|	ЭтапыДоговоров.ВидРабот.СрокОплаты КАК ПредУсловие,
		|	ЭтапыДоговоров.ВидРабот.ПредметДоговора КАК ПредметДоговора,
		|	ЭтапыДоговоров.ВидРабот.МоментОплаты КАК МоментОплаты,
		|	ЭтапыДоговоров.ВидРабот.РезультатРаботы КАК РезультатРаботы,
		|	ЭтапыДоговоров.ВидРабот.ПолноеНаименование КАК НаименованиеРаботы,
		|	ВЫРАЗИТЬ(ЭтапыДоговоров.ОбъектРабот.ПолноеНаименование КАК СТРОКА(1000)) КАК ОбъектРабот,
		|	ВЫБОР
		|		КОГДА ЭтапыДоговоров.Подразделение.Родитель = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|			ТОГДА ЭтапыДоговоров.Подразделение
		|		ИНАЧЕ ЭтапыДоговоров.Подразделение.Родитель
		|	КОНЕЦ КАК ОтделИсполнителя,
		|	ВЫБОР
		|		КОГДА ЭтапыДоговоров.Подразделение.Родитель = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|			ТОГДА ЭтапыДоговоров.Подразделение.Руководитель
		|		ИНАЧЕ ЭтапыДоговоров.Подразделение.Родитель.Руководитель
		|	КОНЕЦ КАК НачИсполнителя,
		|	ЭтапыДоговоров.СтавкаНДС КАК СтавкаНДС,
		|	ЭтапыДоговоров.ОсвобождениеОтНДС,
		|	ЭтапыДоговоров.ОсвобождениеОтНДС.ДляПечати КАК ОсвобождениеОтНДСДляПечати,
		|	ВЫБОР
		|		КОГДА ЭтапыДоговоров.ДатаПоследнейЗаписи < &ДатаДеноминации
		|			ТОГДА ВЫРАЗИТЬ(ЭтапыДоговоров.Стоимость / 10000 КАК ЧИСЛО(17, 2))
		|		ИНАЧЕ ЭтапыДоговоров.Стоимость
		|	КОНЕЦ КАК Стоимость,
		|	ВЫБОР
		|		КОГДА ЭтапыДоговоров.ДатаПоследнейЗаписи < &ДатаДеноминации
		|			ТОГДА ВЫРАЗИТЬ(ЭтапыДоговоров.Цена / 10000 КАК ЧИСЛО(17, 2))
		|		ИНАЧЕ ЭтапыДоговоров.Цена
		|	КОНЕЦ КАК Цена,
		|	ВЫБОР
		|		КОГДА ЭтапыДоговоров.ДатаПоследнейЗаписи < &ДатаДеноминации
		|			ТОГДА ВЫРАЗИТЬ(ЭтапыДоговоров.СуммаНДС / 10000 КАК ЧИСЛО(17, 2))
		|		ИНАЧЕ ЭтапыДоговоров.СуммаНДС
		|	КОНЕЦ КАК СуммаНДС,
		|	ВЫБОР
		|		КОГДА ЭтапыДоговоров.ДатаПоследнейЗаписи < &ДатаДеноминации
		|			ТОГДА ВЫРАЗИТЬ(ЭтапыДоговоров.СтоимостьСНДС / 10000 КАК ЧИСЛО(17, 2))
		|		ИНАЧЕ ЭтапыДоговоров.СтоимостьСНДС
		|	КОНЕЦ КАК СтоимостьСНДС,
		|	ЭтапыДоговоров.ДатаПоследнейЗаписи,
		|	ЭтапыДоговоров.Комментарий,
		|	ЭтапыДоговоров.КоличествоУчастков,
		|	ЭтапыДоговоров.Месторасположение,
		|	ЭтапыДоговоров.КакДоговорЮрЛица,
		|	ЕСТЬNULL(УчетДоговоровОбороты.СуммаРасход, 0) КАК Заактировано,
		|	ЭтапыДоговоров.ИсточникФинансирования.Наименование КАК ИсточникФинанс,
		|	мУсловияДоговоровСрезПоследних.ПроцентПредоплаты,
		|	ЭтапыДоговоров.ДлительностьВыполненияРабот,
		|	ЭтапыДоговоров.ВидДней,
		|	ВЫБОР
		|		КОГДА ЭтапыДоговоров.ИсточникФинансирования.Родитель = ЗНАЧЕНИЕ(Справочник.мИсточникиФинансирования.СобственныеСредства)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК СобственныеСредства
		|ИЗ
		|	Справочник.мЭтапыДоговоров КАК ЭтапыДоговоров
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.УчетДоговоров.Обороты(&НачПер, &КонПер, День, ЭтапДоговора.Владелец = &Договор) КАК УчетДоговоровОбороты
		|		ПО ЭтапыДоговоров.Ссылка = УчетДоговоровОбороты.ЭтапДоговора
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.мУсловияДоговоров.СрезПоследних(
		|				,
		|				Договор = &Договор
		|					И ЭтапДоговора.Владелец = &Договор) КАК мУсловияДоговоровСрезПоследних
		|		ПО (мУсловияДоговоровСрезПоследних.ЭтапДоговора = ЭтапыДоговоров.Ссылка)
		|ГДЕ
		|	ЭтапыДоговоров.Владелец = &Договор
		|	И НЕ ЭтапыДоговоров.ПометкаУдаления
		|	И ЭтапыДоговоров.ДатаИсключенИзДоговора = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерЭтапа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВнутренниеДокументы.ДатаРегистрации КАК ДатаРегистрации,
		|	ВнутренниеДокументы.РегистрационныйНомер КАК РегистрационныйНомер,
		|	ВнутренниеДокументы.Утвердил,
		|	ВнутренниеДокументы.Валюта,
		|	ВнутренниеДокументы.Ссылка КАК Договор
		|ИЗ
		|	Справочник.ВнутренниеДокументы КАК ВнутренниеДокументы
		|ГДЕ
		|	ВнутренниеДокументы.Ссылка = &Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВнутренниеДокументыКорреспонденты.Корреспондент,
		|	ВнутренниеДокументыКорреспонденты.Корреспондент.ФизЛицо КАК ФизЛицо,
		|	ВнутренниеДокументыКорреспонденты.ПодписалОтКорреспондента,
		|	ВнутренниеДокументыКорреспонденты.КонтактноеЛицо,
		|	ВнутренниеДокументыКорреспонденты.Корреспондент.Наименование,
		|	ВнутренниеДокументыКорреспонденты.Корреспондент.ПолноеНаименование,
		|	ВнутренниеДокументыКорреспонденты.Корреспондент.мНаименованиеФилиала КАК НаименованиеФилиала,
		|	ВнутренниеДокументыКорреспонденты.Корреспондент.ИНН,
		|	ВнутренниеДокументыКорреспонденты.Корреспондент.мКодФилиала КАК КодФилиала,
		|	ВнутренниеДокументыКорреспонденты.Корреспондент.КодПоОКПО,
		|	ВнутренниеДокументыКорреспонденты.Корреспондент.ОсновнойБанковскийСчет.НомерСчета,
		|	ВнутренниеДокументыКорреспонденты.Корреспондент.ОсновнойБанковскийСчет.Банк.Код,
		|	ВнутренниеДокументыКорреспонденты.Корреспондент.ОсновнойБанковскийСчет.СчетИБАН,
		|	ВнутренниеДокументыКорреспонденты.Корреспондент.ОсновнойБанковскийСчет.Банк.БИК,
		|	ВнутренниеДокументыКорреспонденты.Корреспондент.ОсновнойБанковскийСчет.Банк.Наименование,
		|	ВнутренниеДокументыКорреспонденты.Корреспондент.ОсновнойБанковскийСчет.Банк.Адрес,
		|	ВнутренниеДокументыКорреспонденты.ПодписалОтКорреспондента КАК ПодписалОтКорреспондента,
		|	ВнутренниеДокументыКорреспонденты.ПодписалОтКорреспондента.Должность
		|ПОМЕСТИТЬ Заказчики
		|ИЗ
		|	Справочник.ВнутренниеДокументы.Корреспонденты КАК ВнутренниеДокументыКорреспонденты
		|ГДЕ
		|	ВнутренниеДокументыКорреспонденты.Ссылка = &ДокументОснование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КорреспондентыКонтактнаяИнформация.Представление КАК Адрес,
		|	КорреспондентыКонтактнаяИнформация.Ссылка КАК Корреспондент
		|ПОМЕСТИТЬ тАдрес
		|ИЗ
		|	Справочник.Корреспонденты.КонтактнаяИнформация КАК КорреспондентыКонтактнаяИнформация
		|ГДЕ
		|	КорреспондентыКонтактнаяИнформация.Ссылка В
		|			(ВЫБРАТЬ
		|				Заказчики.Корреспондент
		|			ИЗ
		|				Заказчики КАК Заказчики)
		|	И КорреспондентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮридическийАдресКорреспондента)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КорреспондентыКонтактнаяИнформация.Представление КАК Телефон,
		|	КорреспондентыКонтактнаяИнформация.Ссылка КАК Корреспондент
		|ПОМЕСТИТЬ тТелефон
		|ИЗ
		|	Справочник.Корреспонденты.КонтактнаяИнформация КАК КорреспондентыКонтактнаяИнформация
		|ГДЕ
		|	КорреспондентыКонтактнаяИнформация.Ссылка В
		|			(ВЫБРАТЬ
		|				Заказчики.Корреспондент
		|			ИЗ
		|				Заказчики КАК Заказчики)
		|	И КорреспондентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКорреспондента)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(тАдрес.Адрес, ""__________________"") КАК Адрес,
		|	ЕСТЬNULL(тТелефон.Телефон, ""__________________"") КАК Телефон,
		|	Заказчики.Корреспондент,
		|	Заказчики.КорреспондентНаименование КАК Наименование,
		|	Заказчики.КорреспондентПолноеНаименование КАК ПолноеНаименование,
		|	Заказчики.НаименованиеФилиала КАК НаименованиеФилиала,
		|	Заказчики.КодФилиала КАК КодФилиала,
		|	Заказчики.КорреспондентКодПоОКПО КАК ОКПО,
		|	Заказчики.КорреспондентИНН КАК УНП,
		|	Заказчики.КорреспондентОсновнойБанковскийСчетНомерСчета КАК НомерСчета,
		|	Заказчики.КорреспондентОсновнойБанковскийСчетБанкКод КАК КодБанка,
		|	Заказчики.КорреспондентОсновнойБанковскийСчетСчетИБАН КАК СчетИБАН,
		|	Заказчики.КорреспондентОсновнойБанковскийСчетБанкБИК КАК БИКБанка,
		|	Заказчики.КорреспондентОсновнойБанковскийСчетБанкНаименование КАК Банк,
		|	Заказчики.КорреспондентОсновнойБанковскийСчетБанкАдрес КАК БанкАдрес,
		|	Заказчики.ПодписалОтКорреспондента КАК ПодписалОтКорреспондента,
		|	Заказчики.ПодписалОтКорреспондента.Наименование КАК КорреспондентКратко,
		|	Заказчики.ПодписалОтКорреспондентаДолжность КАК ДолжностьКорр
		|ИЗ
		|	Заказчики КАК Заказчики
		|		ЛЕВОЕ СОЕДИНЕНИЕ тАдрес КАК тАдрес
		|		ПО Заказчики.Корреспондент = тАдрес.Корреспондент
		|		ЛЕВОЕ СОЕДИНЕНИЕ тТелефон КАК тТелефон
		|		ПО Заказчики.Корреспондент = тТелефон.Корреспондент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Заказчики.Корреспондент КАК Корреспондент,
		|	Заказчики.ФизЛицо КАК ФизЛицо
		|ПОМЕСТИТЬ ФизЛица
		|ИЗ
		|	Заказчики КАК Заказчики
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КорреспондентыКонтактнаяИнформация.Представление КАК ДомашнийАдрес,
		|	КорреспондентыКонтактнаяИнформация.Ссылка КАК Корреспондент
		|ПОМЕСТИТЬ ДомашниеАдреса
		|ИЗ
		|	Справочник.Корреспонденты.КонтактнаяИнформация КАК КорреспондентыКонтактнаяИнформация
		|ГДЕ
		|	КорреспондентыКонтактнаяИнформация.Ссылка В
		|			(ВЫБРАТЬ
		|				Заказчики.Корреспондент
		|			ИЗ
		|				Заказчики КАК Заказчики)
		|	И КорреспондентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ДомашнийАдресФизическогоЛица)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КорреспондентыКонтактнаяИнформация.Представление КАК ДомашнийТелефон,
		|	КорреспондентыКонтактнаяИнформация.Ссылка КАК Корреспондент
		|ПОМЕСТИТЬ ДомашниеТелефоны
		|ИЗ
		|	Справочник.Корреспонденты.КонтактнаяИнформация КАК КорреспондентыКонтактнаяИнформация
		|ГДЕ
		|	КорреспондентыКонтактнаяИнформация.Ссылка В
		|			(ВЫБРАТЬ
		|				Заказчики.Корреспондент
		|			ИЗ
		|				Заказчики КАК Заказчики)
		|	И КорреспондентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ДомашнийТелефонФизическогоЛица)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КорреспондентыКонтактнаяИнформация.Представление КАК ПочтовыйАдрес,
		|	КорреспондентыКонтактнаяИнформация.Ссылка КАК Корреспондент
		|ПОМЕСТИТЬ ПочтовыеАдреса
		|ИЗ
		|	Справочник.Корреспонденты.КонтактнаяИнформация КАК КорреспондентыКонтактнаяИнформация
		|ГДЕ
		|	КорреспондентыКонтактнаяИнформация.Ссылка В
		|			(ВЫБРАТЬ
		|				Заказчики.Корреспондент
		|			ИЗ
		|				Заказчики КАК Заказчики)
		|	И КорреспондентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ПочтовыйАдресФизическогоЛица)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КорреспондентыКонтактнаяИнформация.Представление КАК МобильныйТелефон,
		|	КорреспондентыКонтактнаяИнформация.Ссылка КАК Корреспондент
		|ПОМЕСТИТЬ МобильныеТелефоны
		|ИЗ
		|	Справочник.Корреспонденты.КонтактнаяИнформация КАК КорреспондентыКонтактнаяИнформация
		|ГДЕ
		|	КорреспондентыКонтактнаяИнформация.Ссылка В
		|			(ВЫБРАТЬ
		|				Заказчики.Корреспондент
		|			ИЗ
		|				Заказчики КАК Заказчики)
		|	И КорреспондентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.МобильныйТелефонФизическогоЛица)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокументыФизическихЛицСрезПоследних.Физлицо,
		|	МАКСИМУМ(ДокументыФизическихЛицСрезПоследних.Период) КАК Период
		|ПОМЕСТИТЬ ДокументыСрез
		|ИЗ
		|	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(
		|			,
		|			ЯвляетсяДокументомУдостоверяющимЛичность
		|				И Физлицо В
		|					(ВЫБРАТЬ
		|						ФизЛица.ФизЛицо
		|					ИЗ
		|						ФизЛица КАК ФизЛица)) КАК ДокументыФизическихЛицСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	ДокументыФизическихЛицСрезПоследних.Физлицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокументыФизическихЛицСрезПоследних.Серия,
		|	ДокументыФизическихЛицСрезПоследних.Номер,
		|	ДокументыФизическихЛицСрезПоследних.ДатаВыдачи,
		|	ДокументыФизическихЛицСрезПоследних.СрокДействия,
		|	ДокументыФизическихЛицСрезПоследних.КемВыдан,
		|	ДокументыФизическихЛицСрезПоследних.Физлицо
		|ПОМЕСТИТЬ ДанныеПаспорта
		|ИЗ
		|	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(
		|			,
		|			ЯвляетсяДокументомУдостоверяющимЛичность
		|				И Физлицо В
		|					(ВЫБРАТЬ
		|						ФизЛица.ФизЛицо
		|					ИЗ
		|						ФизЛица КАК ФизЛица)) КАК ДокументыФизическихЛицСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыСрез КАК ДокументыСрез
		|		ПО ДокументыФизическихЛицСрезПоследних.Период = ДокументыСрез.Период
		|			И ДокументыФизическихЛицСрезПоследних.Физлицо = ДокументыСрез.Физлицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ДокументыСрез
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ДомашниеАдреса.ДомашнийАдрес, """") КАК Адрес,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ДомашниеТелефоны.ДомашнийТелефон, """") <> """"
		|			ТОГДА ЕСТЬNULL(ДомашниеТелефоны.ДомашнийТелефон, """")
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ДомашнийТелефон,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(МобильныеТелефоны.МобильныйТелефон, """") <> """"
		|			ТОГДА ЕСТЬNULL(МобильныеТелефоны.МобильныйТелефон, """")
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК МобильныйТелефон,
		|	ЕСТЬNULL(ПочтовыеАдреса.ПочтовыйАдрес, """") КАК ПочтовыйАдрес,
		|	ЕСТЬNULL(ДанныеПаспорта.Серия, """") КАК СерияПаспорта,
		|	ЕСТЬNULL(ДанныеПаспорта.Номер, """") КАК НомерПаспорта,
		|	ЕСТЬNULL(ДанныеПаспорта.ДатаВыдачи, """") КАК ДатаВыдачи,
		|	ЕСТЬNULL(ДанныеПаспорта.КемВыдан, """") КАК КемВыдан,
		|	ЕСТЬNULL(ДанныеПаспорта.СрокДействия, """") КАК СрокДействия,
		|	ФизЛица.Корреспондент.ПолноеНаименование КАК ПолноеНаименование,
		|	ФизЛица.Корреспондент КАК КорреспондентКратко,
		|	ФизЛица.ФизЛицо
		|ИЗ
		|	ФизЛица КАК ФизЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДомашниеАдреса КАК ДомашниеАдреса
		|		ПО ФизЛица.Корреспондент = ДомашниеАдреса.Корреспондент
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДомашниеТелефоны КАК ДомашниеТелефоны
		|		ПО ФизЛица.Корреспондент = ДомашниеТелефоны.Корреспондент
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПочтовыеАдреса КАК ПочтовыеАдреса
		|		ПО ФизЛица.Корреспондент = ПочтовыеАдреса.ПочтовыйАдрес
		|		ЛЕВОЕ СОЕДИНЕНИЕ МобильныеТелефоны КАК МобильныеТелефоны
		|		ПО ФизЛица.Корреспондент = МобильныеТелефоны.Корреспондент
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПаспорта КАК ДанныеПаспорта
		|		ПО ФизЛица.ФизЛицо = ДанныеПаспорта.Физлицо";

	Запрос.УстановитьПараметр("Договор", Договор);
	
	// Если печать допсоглашения, то берем заказчиков подписантов из него
	Если ЗначениеЗаполнено(ДопСоглашение) Тогда
		Запрос.УстановитьПараметр("ДокументОснование", ДопСоглашение);
	Иначе
		Запрос.УстановитьПараметр("ДокументОснование", Договор);
	КонецЕсли; 
 	Запрос.УстановитьПараметр("НачПер", Договор.ДатаРегистрации);
 	Запрос.УстановитьПараметр("ДатаДеноминации", Дата(2016, 7, 1));
	Запрос.УстановитьПараметр("КонПер", ТекущаяДата());

	Результат = Запрос.ВыполнитьПакет();

	// Этапы
	Выборка = Результат[0].Выбрать();
	
	НачИсполнителя = "";
	ТелефонИсполнителя = "";
	ОтделИсполнителя = "";
    ДолжностьИсполнителя = "";
	
	ЭтапыДоговора.Очистить();
	Пока Выборка.Следующий() Цикл
		Этап = ЭтапыДоговора.Добавить();
		ЗаполнитьЗначенияСвойств(Этап, Выборка);
		Если Выборка.КоличествоУчастков = 0 Тогда
		    Этап.КоличествоУчастков = 1;
		КонецЕсли; 
		Если Выборка.Заактировано > 0 Тогда
			Этап.Пометка = Ложь;
		Иначе
			Этап.Пометка = Истина; 
		КонецЕсли; 
		
		СобственныеСредства = Ложь;
		Если ЗначениеЗаполнено(Выборка.ИсточникФинанс) Тогда
			ИсточникФинанс = Выборка.ИсточникФинанс;
			СобственныеСредства = Выборка.СобственныеСредства;
		КонецЕсли; 
		
		Если Не ЗначениеЗаполнено(НачИсполнителя) Тогда
			Если ЗначениеЗаполнено(Выборка.НачИсполнителя) Тогда
				НачИсполнителя = Выборка.НачИсполнителя;
				ТелефонИсполнителя = УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(Выборка.НачИсполнителя, Справочники.ВидыКонтактнойИнформации.ТелефонПользователя);
                ДолжностьИсполнителя = РаботаСПользователями.ПолучитьДолжность(Выборка.НачИсполнителя).Наименование;
			КонецЕсли; 
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ОтделИсполнителя) Тогда
			Если ЗначениеЗаполнено(Выборка.ОтделИсполнителя) Тогда
				ОтделИсполнителя = Выборка.ОтделИсполнителя;
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;
	
	// Договор
	ДанныеДоговора = Результат[1].Выгрузить();
	НомерДоговора = ДанныеДоговора[0].РегистрационныйНомер;
	ДатаДоговора = ДанныеДоговора[0].ДатаРегистрации;
	Подписал = ДанныеДоговора[0].Утвердил;
    Если ЗначениеЗаполнено(ДопСоглашение) Тогда
        ВалютаДоговора = ДопСоглашение.Валюта; 
    Иначе	
        Если ЗначениеЗаполнено(ДанныеДоговора[0].Валюта) Тогда
            ВалютаДоговора = ДанныеДоговора[0].Валюта; 
        Иначе	
            ВалютаДоговора = Константы.ОсновнаяВалюта.Получить(); 
        КонецЕсли; 
    КонецЕсли; 
	
	// Заказчики
	ЮрЛица = Результат[5].Выгрузить();
	ФизЛица = Результат[14].Выгрузить();
	ЭтоФизЛица = ЮрЛица[0].Корреспондент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо;	
	
	Заказчики.Очистить();
	
	Если ЭтоФизЛица Тогда
		ТзЗаказчики = ФизЛица;
	Иначе
		ТзЗаказчики = ЮрЛица;
	КонецЕсли; 
	
	Для каждого СтрокаТз Из ТзЗаказчики Цикл
		Заказчик = Заказчики.Добавить();
		ЗаполнитьЗначенияСвойств(Заказчик, СтрокаТз);
		Заказчик.КорреспондентКратко = СтрокаТз.КорреспондентКратко;
		//Заказчик.КорреспондентКратко = ФамилияИнициалыФизЛица(СтрокаТз.ПолноеНаименование);
	КонецЦикла; 
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьМакетДоговора()
	//ИмяМакета = ШаблоныДоговоров.НайтиПоЗначению(СписокПроцедур);
	//Если ИмяМакета = Неопределено Тогда
	//	Сообщить("Не найден макет для " + СписокПроцедур); 
	//	Возврат "";
	//КонецЕсли; 
	//
	//Макет = Объект().ПолучитьМакет(ИмяМакета.Представление);
	//Возврат Макет;
КонецФункции // ПолучитьМакетДоговора()

&НаСервереБезКонтекста
Функция ПолучитьПодписиПодрядчика(Договор, ДопСоглашение="")
	СтруктураПараметров = Новый Структура(); 
	
	Если ЗначениеЗаполнено(ДопСоглашение) Тогда
		Подписал = ДопСоглашение.Утвердил;
		ДатаРегистрации = ДопСоглашение.ДатаРегистрации;
	Иначе
		Подписал = Договор.Утвердил;
		ДатаРегистрации = Договор.ДатаРегистрации;
	КонецЕсли; 
	Если ЗначениеЗаполнено(Подписал) Тогда
		ПодписалДолжность = РаботаСПользователями.ПолучитьДолжность(Подписал).Наименование;
		ПодписалКратко = Подписал.ПредставлениеВДокументах;
		ПодписалДоверенность = ПолучитьДоверенность(Подписал, ДатаРегистрации);
	Иначе
		Сообщить("Не заполнен в договоре Подписал!");
		ПодписалДолжность = "___________________";
		ПодписалКратко = "___________________";
		ПодписалДоверенность = "___________________";
	КонецЕсли; 
	
	СтруктураПараметров.Вставить("ПодписалДолжность", ПодписалДолжность);
	СтруктураПараметров.Вставить("ПодписалКратко", ПодписалКратко);
	СтруктураПараметров.Вставить("ПодписалДоверенность", ПодписалДоверенность);
	СтруктураПараметров.Вставить("Подписал", Подписал);
	
	Возврат СтруктураПараметров;
КонецФункции 

&НаСервереБезКонтекста
Функция ПолучитьДоверенность(Подписал, ДатаРегистрации)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДействиеДоверенностей.НомерДоверенности КАК НомерДоверенности,
	|	ДействиеДоверенностей.ДатаНачала КАК ДатаДоверенности,
	|	ДействиеДоверенностей.ДатаОкончания
	|ИЗ
	|	РегистрСведений.ДействиеДоверенностей КАК ДействиеДоверенностей
	|ГДЕ
	|	ДействиеДоверенностей.Пользователь = &Пользователь
	|	И &ДатаДоговора МЕЖДУ ДействиеДоверенностей.ДатаНачала И ДействиеДоверенностей.ДатаОкончания";
	
	Запрос.УстановитьПараметр("ДатаДоговора", ДатаРегистрации);
	Запрос.УстановитьПараметр("Пользователь", Подписал);
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат "";
	КонецЕсли; 
	ВыборкаШапкаДоговора = Результат.Выбрать();
	ВыборкаШапкаДоговора.Следующий();
	
	НомерДоверенности = СокрЛП(ВыборкаШапкаДоговора.НомерДоверенности);
	Если НомерДоверенности = "Устав" Тогда
		РезультатОбработки = "Устава";
	Иначе
		РезультатОбработки = НомерДоверенности+ " от "+Формат(ВыборкаШапкаДоговора.ДатаДоверенности, "ДЛФ = DD");
	КонецЕсли;
	
	Возврат РезультатОбработки;
	
КонецФункции // ПолучитьДоверенность()

&НаСервереБезКонтекста
Функция ПолучитьСтрокуРуководителя(Подписи)
	Если Подписи.Свойство("Подписал") И ЗначениеЗаполнено(Подписи.Подписал) Тогда
		Руководитель = СклонениеПоПадежам.обСклонениеСтроки(Подписи.ПодписалДолжность, "Р", "Должность");
		Руководитель = Руководитель + " " + СклонениеПоПадежам.ПросклонятьСтрокуФИО(Подписи.Подписал, "", "Р", "ФИО");
		ПолСсылка = СклонениеПоПадежам.ПолучитьПол(Подписи.Подписал);
		Если ПолСсылка = Перечисления.ПолФизическогоЛица.Женский тогда 
			Руководитель = Руководитель + ", действующей";
		Иначе
			Руководитель = Руководитель + ", действующего";
		КонецЕсли;
	Иначе
	    Руководитель = "_____________________________________ __________________________, действующего ";
	КонецЕсли; 
	
	Возврат Руководитель;
КонецФункции // ПолучитьСтрокуРуководителя()

&НаСервереБезКонтекста
Функция ПолучитьСтрокуРуководителяЗаказчика(ПодписалОтКорреспондента)
	Если ЗначениеЗаполнено(ПодписалОтКорреспондента) Тогда
		Должность = ПодписалОтКорреспондента.Должность;
	Иначе
		Должность = "";
	КонецЕсли;
	РезультатОбработки = СклонениеПоПадежам.обСклонениеСтроки(Должность, "Р", "Должность");
	РезультатОбработки = РезультатОбработки + " " + СклонениеПоПадежам.ПросклонятьСтрокуФИО(ПодписалОтКорреспондента, "", "Р", "ФИО");
	ПолСсылка = СклонениеПоПадежам.ПолучитьПол(ПодписалОтКорреспондента);
	Если ПолСсылка = Перечисления.ПолФизическогоЛица.Женский тогда 
		РезультатОбработки = РезультатОбработки + ", действующей";
	Иначе
		РезультатОбработки = РезультатОбработки + ", действующего";
	КонецЕсли;
	ДействуетНаОсновании = УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(ПодписалОтКорреспондента, Справочники.ВидыКонтактнойИнформации.ДействуетНаОсновании);
	
	РезультатОбработки = РезультатОбработки + " на основании "+ДействуетНаОсновании;	
	Возврат РезультатОбработки;
КонецФункции // ПолучитьСтрокуРуководителя()

&НаСервереБезКонтекста
Функция ПолучитьКорреспондента(Заказчики)
	// Если заказчиков много, берем пока первого
	Если Заказчики.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли; 
	СтрокаЗаказчика = Заказчики[0];
	
	Если ЗначениеЗаполнено(СтрокаЗаказчика.ПолноеНаименование) Тогда
		Возврат СтрокаЗаказчика.ПолноеНаименование;
	Иначе
		Возврат "_____________________________";
	КонецЕсли;
КонецФункции // ПолучитьКорреспондента()

&НаКлиентеНаСервереБезКонтекста
Функция ФамилияИнициалыФизЛица(ОбъектИлиСтрока = "", Фамилия = " ", Имя = " ", Отчество = " ") Экспорт

	ТипОбъекта = ТипЗнч(ОбъектИлиСтрока);
	Если ТипОбъекта = Тип("Строка") Тогда
		ФИО = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СокрЛП(ОбъектИлиСтрока), " ");
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.ФизическиеЛица") Или ТипОбъекта = Тип("СправочникОбъект.ФизическиеЛица") Тогда
		ФИО = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СокрЛП(ОбъектИлиСтрока.Наименование), " ");
	Иначе
		// используем возможно переданные отдельные строки
		Возврат ?(Не ПустаяСтрока(Фамилия), 
		          Фамилия + ?(Не ПустаяСтрока(Имя), " " + Лев(Имя,1) + "." + ?(Не ПустаяСтрока(Отчество), Лев(Отчество,1) + ".", ""), ""),
		          "")
	КонецЕсли;
	
	КоличествоПодстрок = ФИО.Количество();
	Фамилия            = ?(КоличествоПодстрок > 0, ФИО[0], "");
	Имя                = ?(КоличествоПодстрок > 1, ФИО[1], "");
	Отчество           = ?(КоличествоПодстрок > 2, ФИО[2], "");
	
	Возврат ?(Не ПустаяСтрока(Фамилия), 
	          Фамилия + ?(Не ПустаяСтрока(Имя), " " + Лев(Имя,1) + "." + ?(Не ПустаяСтрока(Отчество), Лев(Отчество, 1) + ".", ""), ""),
	          "");
	
КонецФункции

&НаКлиенте
Процедура ВставитьШтрихКод()
	ОбъектДляВставкиШК = Договор;
	Если ЗначениеЗаполнено(ДопСоглашение) Тогда
		ОбъектДляВставкиШК = ДопСоглашение;
	КонецЕсли; 
	
	ДанныеОШтрихкоде = ШтрихкодированиеСервер.ПолучитьДанныеДляВставкиШтрихкодаВОбъект(ОбъектДляВставкиШК, Ложь, Истина);
	Если ДанныеОШтрихкоде <> Неопределено
		И ДанныеОШтрихкоде.Свойство("ДвоичныеДанныеИзображения") Тогда
		
		// Запись картинки штрихкода во временный файл
		ВременныйФайлКартинки = ПолучитьИмяВременногоФайла("png");
		ДанныеОШтрихкоде.ДвоичныеДанныеИзображения.Записать(ВременныйФайлКартинки);
		
		Док.Bookmarks("Штрихкод").Range.Select();
		Селекция = WordApp.Selection; // активная (выделенная) область 
		Рисунок = Селекция.InlineShapes.AddPicture(ВременныйФайлКартинки, Ложь, Истина);
		
		// Чтобы установить обтекание текста, конвертируем рисунок в фигуру
		Shape = Рисунок.ConvertToShape();
		Shape.WrapFormat.Type = 0; // по контуру...
		
		УдалитьФайлы(ВременныйФайлКартинки);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПредставлениеСтавкиНДС(СтавкаНДС)
    Если ТипЗнч(СтавкаНДС) = Тип("СправочникСсылка.мСтавкиНДС") Тогда
    	Возврат СтавкаНДС.Наименование;	
    Иначе
    	Возврат СтавкаНДС;	
    КонецЕсли; 
КонецФункции

&НаСервере
Функция ПолучитьАдресФайлаШаблона(ШаблонДоговора)
	ПутьКШаблону = ШаблонДоговора.ТекущаяВерсияТом.ПолныйПутьWindows + ШаблонДоговора.ТекущаяВерсияПутьКФайлу; 
	ДвоичныеДанныеВложения = Новый ДвоичныеДанные(ПутьКШаблону);
	Адрес = ПоместитьВоВременноеХранилище(ДвоичныеДанныеВложения);
	Возврат Адрес;
КонецФункции // ПолучитьФайлШаблона()

&НаКлиенте
Функция ПолучитьСписокРабот()
    СпРабот = Новый СписокЗначений;
    Для каждого Этап Из ЭтапыДоговора Цикл
		Если СпРабот.НайтиПоЗначению(Этап.ВидРабот) = Неопределено Тогда
			Если ЗначениеЗаполнено(Этап.ПредметДоговора) Тогда
	            СпРабот.Добавить(Этап.ВидРабот, Этап.ПредметДоговора);
			Иначе	
	            СпРабот.Добавить(Этап.ВидРабот, Этап.НаименованиеРаботы);
			КонецЕсли; 
        КонецЕсли; 
    КонецЦикла; 
    Возврат СпРабот;
КонецФункции // ПолучитьСписокРабот()
 
