
////////////////////////////////////////////////////////////////////////////////
// ОбщийОбработчикОжиданияГлобальный: модуль содержащий глобальные процедуры
// работы механизма Общий обработчик ожидания.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс
//Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура-обработчик ожидания, которая запускается при страте системы.
// Данный обработчик предназначен для группировки периодических обработчиков на клиенте.
//
// Общая схема работы обработчика:
//       1. Вычисление готовых к выполнению обработчиков.
//       2. Если имеются готовые обработчики, то
//          2.1. Производится выполнение кода обработчиков на сервере.
//          2.2. Производится выполнение кода обработчиков на клиенте
//               с учетом результатов серверного выполнения.
//
Процедура ОбщийОбработчикОжидания() Экспорт
	
	ОбработчикиКЗапуску =
		ОбщийОбработчикОжиданияКлиент.ОбработчикиКЗапуску();
		
	Если ОбработчикиКЗапуску.Количество() > 0 Тогда
		
		РезультатыВыполнения =
			ОбщийОбработчикОжиданияВызовСервера.ВыполнитьДействияОбработчикаОжидания(ОбработчикиКЗапуску);
			
		ОбщийОбработчикОжиданияКлиент.ВыполнитьДействияОбработчикаОжидания(РезультатыВыполнения);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
