// УправлениеДоступом

// Заполняет структуру сведений о полях доступа 
Процедура ЗаполнитьСведенияОПоляхДоступа(СведенияОПолях) Экспорт 
	
	СведенияОПолях.ОбъектДоступа1 = "Проект";
	СведенияОПолях.ОбъектДоступа2 = "Пользователь";
	
КонецПроцедуры

// Заполняет параметр ПраваДоступа правами доступа, вычисляя их на 
// основании переданного дескриптора доступа.
// Если указан параметр ПротоколРасчетаПрав, то в него 
// заносится список данных, которые были использованы для расчета прав.
Процедура ЗаполнитьПраваДоступа(ДескрипторДоступа, ПраваДоступа, ПротоколРасчетаПрав) Экспорт
	
	//Добавление прав для руководителя проекта
	Руководитель = ОбщегоНазначения.ПолучитьЗначениеРеквизита(
		ДескрипторДоступа.ОбъектДоступа1, "Руководитель");
		
	Если ЗначениеЗаполнено(Руководитель) Тогда
			
		ПраваПользователя = Новый Структура("Чтение, Добавление, Изменение, Удаление, УправлениеПравами",
										Истина, Ложь, Ложь, Ложь, Ложь);
										
		ДокументооборотПраваДоступа.ДобавитьПользователяВСоответствиеПрав(
			ПраваДоступа,
			Руководитель,
			Неопределено,
			Неопределено,
			ПраваПользователя);
					
	КонецЕсли;
		
	// Добавление прав для пользователя - автора записи
	ПраваПользователя = Новый Структура("Чтение, Добавление, Изменение, Удаление, УправлениеПравами",
									Истина, Истина, Истина, Истина, Ложь);
									
	ДокументооборотПраваДоступа.ДобавитьПользователяВСоответствиеПрав(
		ПраваДоступа,
		ДескрипторДоступа.ОбъектДоступа2,
		Неопределено,
		Неопределено,
		ПраваПользователя);
	
КонецПроцедуры


// Конец УправлениеДоступом
