Функция ПолучитьПараметрыВидаРабот(ВидРабот, ЮрФизЛицо, ДатаСреза) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПараметрыВидовРаботПоДоговорамСрезПоследних.ПредУсловие,
		|	ПараметрыВидовРаботПоДоговорамСрезПоследних.ПостУсловие,
		|	ПараметрыВидовРаботПоДоговорамСрезПоследних.ДнейПоГороду,
		|	ПараметрыВидовРаботПоДоговорамСрезПоследних.ДнейПоОбласти,
		|	ПараметрыВидовРаботПоДоговорамСрезПоследних.ВидыДней,
		|	ПараметрыВидовРаботПоДоговорамСрезПоследних.ЕдиницаИзмерения
		|ИЗ
		|	РегистрСведений.ПараметрыВидовРаботПоДоговорам.СрезПоследних(&ДатаСреза, ) КАК ПараметрыВидовРаботПоДоговорамСрезПоследних
		|ГДЕ
		|	ПараметрыВидовРаботПоДоговорамСрезПоследних.ВидРаботыПоДоговору = &ВидРаботыПоДоговору
		|	И ПараметрыВидовРаботПоДоговорамСрезПоследних.ЮрФизЛицо = &ЮрФизЛицо";

	Запрос.УстановитьПараметр("ВидРаботыПоДоговору", ВидРабот);
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("ЮрФизЛицо", ЮрФизЛицо);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	СтруктураПараметров = Новый Структура("ПредУсловие, ПостУсловие, ДнейПоГороду, ДнейПоОбласти, ВидыДней, ЕдиницаИзмерения");
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураПараметров, ВыборкаДетальныеЗаписи);	
	КонецЕсли;
    Возврат СтруктураПараметров;
КонецФункции
 