
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры.ОбъектДоступа) = Тип("СправочникСсылка.Файлы") Тогда
		ОбъектДоступа = Параметры.ОбъектДоступа;
	ИначеЕсли ТипЗнч(Параметры.ОбъектДоступа) = Тип("СправочникСсылка.ВерсииФайлов") Тогда
		ОбъектДоступа = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Параметры.ОбъектДоступа, "Владелец");
	КонецЕсли;	
	
	Дескриптор = РегистрыСведений.ДескрипторыДоступаДляФайлов.НайтиДескрипторДляФайла(ОбъектДоступа);
	УникальныйИдентификаторДескриптора = Строка(Дескриптор.УникальныйИдентификатор());
	
	ЗаполнитьТаблицуПрав();
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьСервер();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСервер()
	
	Дескриптор = ДокументооборотПраваДоступа.ОпределитьДескрипторДоступаФайлаПоВладельцу(ОбъектДоступа.ВладелецФайла);
	УникальныйИдентификаторДескриптора = Строка(Дескриптор.УникальныйИдентификатор());
	
	Если ЗначениеЗаполнено(Дескриптор) Тогда
		
		МенеджерДескриптора = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Дескриптор);
		МенеджерДескриптора.ОбновитьПрава(
			Дескриптор,
			Неопределено, // Протокол
			Истина); // Немедленно
		
	КонецЕсли;	
	
	ЗаполнитьТаблицуПрав();
	
КонецПроцедуры

&НаСервере	
Процедура ЗаполнитьТаблицуПрав()
	
	ТаблицаПрав = ДокументооборотПраваДоступа.ПолучитьТаблицуПравДляОтображенияВИнтерфейсе(ОбъектДоступа);
	ПраваДоступа.Загрузить(ТаблицаПрав);
	
КонецПроцедуры

&НаКлиенте
Процедура ПраваДоступаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПраваДоступа.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ПоказатьЗначение(,ТекущиеДанные.Пользователь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УникальныйИдентификаторДескриптораНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(,Дескриптор);
	
КонецПроцедуры
