
//&НаКлиенте
//Процедура УстановленныйПериодПриИзменении(Элемент)
//	Список.Параметры.УстановитьЗначениеПараметра("Дата1", УстановленныйПериод.ДатаНачала);
//	Список.Параметры.УстановитьЗначениеПараметра("Дата2", УстановленныйПериод.ДатаОкончания);
//КонецПроцедуры

//&НаКлиенте
//Процедура УстановитьПериод(Команда)
//	//УстановленныйПериод = Новый СтандартныйПериод();
//	//УстановленныйПериод.ДатаНачала = НачалоМесяца(ТекущаяДата());
//	//УстановленныйПериод.ДатаОкончания = КонецМесяца(ТекущаяДата());
//	
//	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
//	Диалог.Период = УстановленныйПериод;
//	Если Диалог.Редактировать() Тогда 
//		УстановленныйПериод = Диалог.Период;
//	Иначе
//		Список.Параметры.УстановитьЗначениеПараметра("Дата1", Дата(1, 1, 1));
//		Список.Параметры.УстановитьЗначениеПараметра("Дата2", КонецМесяца(ТекущаяДата()));
//		Возврат;
//	КонецЕсли;
//	
//	Список.Параметры.УстановитьЗначениеПараметра("Дата1", УстановленныйПериод.ДатаНачала);
//	Список.Параметры.УстановитьЗначениеПараметра("Дата2", УстановленныйПериод.ДатаОкончания);
//КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	////УстановленныйПериод = Новый СтандартныйПериод();
	////УстановленныйПериод.ДатаНачала = Дата(1, 1, 1));
	////УстановленныйПериод.ДатаОкончания = КонецМесяца(ТекущаяДата());
	//Если Не ЗначениеЗаполнено(УстановленныйПериод) Тогда
	//	УстановленныйПериод.ДатаНачала = Дата(1, 1, 1);
	//	УстановленныйПериод.ДатаОкончания = КонецМесяца(ТекущаяДата());
	//КонецЕсли; 
	//Список.Параметры.УстановитьЗначениеПараметра("Дата1", УстановленныйПериод.ДатаНачала);
	//Список.Параметры.УстановитьЗначениеПараметра("Дата2", УстановленныйПериод.ДатаОкончания);
	//
	////ПараметрСтатусСФ = Список.Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СтатусСФ"));
	////Если ПараметрСтатусСФ <> Неопределено Тогда
	////	ПараметрСтатусСФ.Использование = Истина;
	////Иначе
	////	Список.Параметры.УстановитьЗначениеПараметра("СтатусСФ", "$$№№!");
	////КонецЕсли; 
	////
	////МассивСтатусов = ПолучитьМассивСтатусов();
	////ГруппаВсе = Элементы.Найти("ГруппаВсе");
	//
	////Для каждого Статус Из МассивСтатусов Цикл
	////	НовСтраница = Элементы.Добавить("СтатусСФ" + Элементы.ГруппаВсе.ПодчиненныеЭлементы.Количество(), Тип("ГруппаФормы"), ГруппаВсе); 
	////	НовСтраница.Вид = ВидГруппыФормы.Страница;
	////    НовСтраница.Заголовок = Строка(Статус);
	////    //Элементы.ГруппаЭСЧФ.ПодчиненныеЭлементы.Добавить("СтатусСФ" + Элементы.ГруппаЭСЧФ.Страницы.Количество(), СокрЛП(Статус), Статус);
	////КонецЦикла; 

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии()


    
КонецПроцедуры

//&НаКлиенте
//Процедура ГруппаЭСЧФПриСменеСтраницы(Элемент, ТекущаяСтраница)
//	//ПараметрСтатусСФ = Список.Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СтатусСФ"));
//	//Если ТекущаяСтраница = 0 Тогда
//	//    ПараметрСтатусСФ.Использование = Ложь;
//	//Иначе
//	//    ПараметрСтатусСФ.Использование = Истина;
//	//	Список.Параметры.УстановитьЗначениеПараметра("СтатусСФ", Элементы.ГруппаЭСЧФ.Страницы[ТекущаяСтраница].Значение);
//	//    //Список.Отбор.СтатусСФ.Значение = Элементы.ГруппаЭСЧФ.Страницы[ТекущаяСтраница].Значение;
//	//КонецЕсли;
//КонецПроцедуры

//&НаСервере
//Функция ПолучитьМассивСтатусов() 
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ РАЗЛИЧНЫЕ
//		|	мЭСЧФ.СтатусСФ КАК СтатусСФ
//		|ИЗ
//		|	Документ.мЭСЧФ КАК мЭСЧФ
//		|
//		|УПОРЯДОЧИТЬ ПО
//		|	СтатусСФ";
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	Выборка = РезультатЗапроса.Выбрать();
//	
//	МассивСтатусов = Новый Массив;
//	
//	Пока Выборка.Следующий() Цикл
//		МассивСтатусов.Добавить(Выборка.СтатусСФ);
//	КонецЦикла;
//	Возврат МассивСтатусов;
//КонецФункции

//&НаКлиенте
//Процедура СтатусОтборПриИзменении(Элемент)
//	//Все(Все), Подготовленные(Подготовленные), Выставленные(Выставленные), Аннулированные(Аннулированные), Выставленные подписанные(ВыставленныеПодписанные), С ошибками(СОшибками)
//	ПараметрСтатусСФ = Список.Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СтатусСФ"));
//	Если СтатусОтбор = "Все" Тогда
//		МассивСтатусов = ПолучитьМассивСтатусов();
//	
//	ИначеЕсли СтатусОтбор = "Подготовленные" Тогда
//		МассивСтатусов = Новый Массив;
//		МассивСтатусов.Добавить(ПредопределенноеЗначение("Перечисление.мСтатусыСФ.Подготовлен1С"));
//		
//	ИначеЕсли СтатусОтбор = "Выставленные" Тогда
//		МассивСтатусов = Новый Массив;
//		МассивСтатусов.Добавить(ПредопределенноеЗначение("Перечисление.мСтатусыСФ.Выставлен"));
//		
//	ИначеЕсли СтатусОтбор = "Аннулированные" Тогда
//		МассивСтатусов = Новый Массив;
//		МассивСтатусов.Добавить(ПредопределенноеЗначение("Перечисление.мСтатусыСФ.Аннулирован"));
//		
//	ИначеЕсли СтатусОтбор = "Выставленные подписанные" Тогда
//		МассивСтатусов = Новый Массив;
//		МассивСтатусов.Добавить(ПредопределенноеЗначение("Перечисление.мСтатусыСФ.ВыставленПодписанПолучателем"));
//		
//	ИначеЕсли СтатусОтбор = "С ошибками" Тогда
//		МассивСтатусов = Новый Массив;
//		МассивСтатусов.Добавить(ПредопределенноеЗначение("Перечисление.мСтатусыСФ.ВРазработкеОшибка"));
//		
//	КонецЕсли; 
//	
//	Если ПараметрСтатусСФ <> Неопределено Тогда
//		ПараметрСтатусСФ.Использование = Истина;
//		Список.Параметры.УстановитьЗначениеПараметра("СтатусСФ", МассивСтатусов);
//	Иначе
//		Список.Параметры.УстановитьЗначениеПараметра("СтатусСФ", "$$№№!");
//	КонецЕсли; 
//КонецПроцедуры


 