#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// Администратору доступна регистрация сертификатов пользователей
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		Элементы.Пользователь.Видимость = Истина;
		Список.Параметры.УстановитьЗначениеПараметра("ОтображатьВсе", Истина);
		Список.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", Справочники.Пользователи.ПустаяСсылка());
	Иначе
		Элементы.Пользователь.Видимость = Ложь;
		Список.Параметры.УстановитьЗначениеПараметра("ОтображатьВсе", Ложь);
		Список.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", Пользователи.ТекущийПользователь());
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьСертификат(Команда)
	
	РаботаСЭПКлиент.ДобавлениеЛичногоСертификата(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти
