#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ВидСобытия") Тогда
		ОтображатьВидСобытия = Истина;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Список.Отбор,
			"ВидСобытия",
			Параметры.ВидСобытия);
		ВидСобытия = Параметры.ВидСобытия;
		ПодпискаНаВидСобытияПоУмолчанию =
			РаботаСУведомлениями.ПолучитьНастройкуПоУмолчанию(Перечисления.НастройкиУведомлений.Подписка, ВидСобытия);
	КонецЕсли;
	
	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьЭлементовФормы()
	
	Элементы.ОтборВидСобытия.Видимость = ОтображатьВидСобытия;
	Элементы.СписокВидСобытия.Видимость = Не ОтображатьВидСобытия;
	Элементы.ПодпискаПоУмолчанию.Видимость = ОтображатьВидСобытия;
	
КонецПроцедуры

#КонецОбласти