&НаКлиенте
Перем РазрешитьЗакрытие;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Длительность = Параметры.Длительность;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РазрешитьЗакрытие = Ложь;
	ПодключитьОбработчикОжидания("ПослеОжиданияПримененияНастроекВКластере", Длительность, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если Не РазрешитьЗакрытие Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеОжиданияПримененияНастроекВКластере()
	
	РазрешитьЗакрытие = Истина;
	Закрыть(КодВозвратаДиалога.ОК);
	ПоказатьОповещениеПользователя(НСтр("ru = 'Настройка разрешений'"),,
		НСтр("ru = 'Внесены изменения в настройки профилей безопасности в кластере серверов.'"));
	
КонецПроцедуры

#КонецОбласти