
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	М_КаталогВыгрузкиЭСЧФ = Константы.М_КаталогВыгрузкиЭСЧФ.Получить();
	М_КаталогСхемПроверкиЭСЧФ = Константы.М_КаталогСхемПроверкиЭСЧФ.Получить();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИЗакрытьНаСервере()
	Константы.М_КаталогВыгрузкиЭСЧФ.Установить(М_КаталогВыгрузкиЭСЧФ);
	Константы.М_КаталогСхемПроверкиЭСЧФ.Установить(М_КаталогСхемПроверкиЭСЧФ);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗаписатьИЗакрытьНаСервере();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура М_КаталогВыгрузкиЭСЧФНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.Заголовок = "Выберите каталог";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		М_КаталогВыгрузкиЭСЧФ = ДиалогОткрытияФайла.Каталог;
	Иначе
		Текст = "ru = ""Каталог не выбран!""; en = ""File(s) not selected!""";
		Предупреждение(НСтр(Текст));
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура М_КаталогСхемПроверкиЭСЧФНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.Заголовок = "Выберите каталог";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		М_КаталогСхемПроверкиЭСЧФ = ДиалогОткрытияФайла.Каталог;
	Иначе
		Текст = "ru = ""Каталог не выбран!""; en = ""File(s) not selected!""";
		Предупреждение(НСтр(Текст));
	КонецЕсли; 

КонецПроцедуры
