#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает структуру полей ВидаПроектов
//
// Возвращаемое значение:
//   Структура
//     Наименование
//     Комментарий
//     АвтоматическиВестиСоставУчастниковРабочейГруппы
//     ОбязательноеЗаполнениеРабочихГруппДокументов
//
Функция ПолучитьСтруктуруВидаПроектов() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("Наименование");
	Параметры.Вставить("Комментарий");
	Параметры.Вставить("АвтоматическиВестиСоставУчастниковРабочейГруппы");
	Параметры.Вставить("ОбязательноеЗаполнениеРабочихГруппДокументов");
	
	Возврат Параметры;
	
КонецФункции

// Создает и записывает в БД вид проектов
//
// Параметры:
//   СтруктураВидаПроектов - Структура - структура полей вида проектов.
//
Функция СоздатьВидПроектов(СтруктураВидаПроектов) Экспорт
	
	НовыйВидПроекта = СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(НовыйВидПроекта, СтруктураВидаПроектов);
	НовыйВидПроекта.Записать();
	
	Возврат НовыйВидПроекта.Ссылка;
	
КонецФункции

#КонецОбласти

#КонецЕсли