///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ДВИЖЕНИЙ

Процедура ОтразитьУчетДоговоров(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУчетДоговоров;
	
	Таблица.Свернуть("ВидДвижения, Договор, ЭтапДоговора, СтавкаНДС, ОсвобождениеОтНДС, Период, НомерДокумента", "Сумма, НДС");
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Движения.УчетДоговоров.Записывать = Истина;
	Движения.УчетДоговоров.Загрузить(Таблица);
	
КонецПроцедуры

Процедура ОтразитьРасчетыСПокупателями(ДополнительныеСвойства, Движения, Отказ) Экспорт

	Таблица= ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРасчетыСПокупателями;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения.РасчетыСПокупателями.Записывать = Истина;
	Движения.РасчетыСПокупателями.Загрузить(Таблица);
	
КонецПроцедуры

Процедура ОтразитьНачислениеЗП(ДополнительныеСвойства, Движения, Отказ) Экспорт

	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаНачислениеЗП;
	
	// Удаление строк без Сумм
	й = Таблица.Количество()-1;
	Пока й >= 0 Цикл
		Если Таблица[й].Сумма = 0 и Таблица[й].БазовоеНачисление = 0 Тогда
			Таблица.Удалить(й);
		КонецЕсли; 	
	    й = й-1;
	КонецЦикла; 
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Движения.НачислениеЗП.Записывать = Истина;
	Движения.НачислениеЗП.Загрузить(Таблица);
	
КонецПроцедуры

Процедура ОтразитьОстаткиПроизводства(ДополнительныеСвойства, Движения, Отказ) Экспорт

	Таблица= ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаНоменклатураПроизводства;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Движения.ОстаткиПроизводство.Записывать = Истина;
	Движения.ОстаткиПроизводство.Загрузить(Таблица);
	
КонецПроцедуры

Процедура ОтразитьУчетПроизводства(ДополнительныеСвойства, Движения, Отказ) Экспорт

	Таблица= ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаНоменклатураПроизводства;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Движения.УчетПроизводство.Записывать = Истина;
	Движения.УчетПроизводство.Загрузить(Таблица);
	
КонецПроцедуры

Процедура ОтразитьУчетСмет(ДополнительныеСвойства, Движения, Отказ) Экспорт

	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаСмет;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Движения.Сметы.Записывать = Истина;
	
	ВидДвижения = ВидДвиженияНакопления.Расход;
	
	Для Каждого Стр Из Таблица Цикл
		Если Не ЗначениеЗаполнено(Стр.ВидДвижения) Тогда
			ЭтоНачалоОбъекта = Истина;
			Продолжить;
		КонецЕсли; 
		Если ЭтоНачалоОбъекта Тогда
			// регистр Сметы Приход НДС по смете
			Движение = Движения.Сметы.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, Стр);
			Движение.СтадияРабот = Неопределено;
			Движение.Сумма = 0;
		
			ЭтоНачалоОбъекта = Ложь;
		КонецЕсли; 
		
		Движение = Движения.Сметы.Добавить();
		Движение.ВидДвижения = ВидДвижения;
		ЗаполнитьЗначенияСвойств(Движение, Стр);
		Движение.НДС = 0;
	КонецЦикла;
КонецПроцедуры

Процедура ОтразитьИзменениеСведенийОСотрудниках(ДополнительныеСвойства, Движения, Отказ) Экспорт

	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.Таблица;
	//Таблица= ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаСведенияОСотрудниках;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Движения.мСведенияОСотрудниках.Записывать = Истина;
	Движения.мСведенияОСотрудниках.Загрузить(Таблица);
	
КонецПроцедуры

// ПРОЦЕДУРА вызывается мз внешней обработки УдалениеПроизошедшихБизнесСобытийМногопоточная
Процедура УдалитьПроизошедшиеБизнесСобытия(ТаблицаСобытия, ИндексНачала, РазмерПорции) Экспорт
    Для Сч = 1 По РазмерПорции Цикл
    
    	Индекс = ?(Сч=1, ИндексНачала, Индекс+1);
        Событие = ТаблицаСобытия[Индекс].Ссылка.ПолучитьОбъект();
        Событие.Удалить();
    КонецЦикла; 
КонецПроцедуры
 