
// Находит максимальный порядок среди томов
Функция НайтиМаксимальныйПорядок(Родитель) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МАКСИМУМ(Тома.ПорядокЗаполнения) КАК МаксимальныйНомер
	               |ИЗ
	               |	Справочник.ТомаХраненияФайлов КАК Тома
	               |ГДЕ
	               |	Тома.Родитель = &Родитель";
	Запрос.Параметры.Вставить("Родитель", Родитель); // только в своей группе проверяем уникальность
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.МаксимальныйНомер = Null Тогда
			Возврат 0;
		Иначе
			Возврат Число(Выборка.МаксимальныйНомер);
		КонецЕсли;		
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции // НайтиМаксимальныйПорядок
