////////////////////////////////////////////////////////////////////////////////
// Подсистема "Пользователи".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// По номеру возвращает нужное число ****
Функция ПолучитьСтрокуРанга(Ранг) Экспорт
	
	СтрокаРанга = "";
	
	Если ТипЗнч(Ранг) = Тип("Число") И Ранг <> 0 Тогда
		
		Для Пер = 0 По Ранг-1 Цикл
			СтрокаРанга = СтрокаРанга + "*";
		КонецЦикла;	
		
	КонецЕсли;	
	
	Возврат СтрокаРанга;
	
КонецФункции

#КонецОбласти
