// Инициализирует таблицы значений, содержащие данные документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст ="ВЫБРАТЬ
	|	ДанныеДокумента.Дата                            КАК Период,
	|	ДанныеДокумента.Ссылка                          КАК Ссылка,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)          КАК ВидДвижения,
	|	ДанныеДокумента.Корреспондент                   КАК Корреспондент,
	|	ДанныеДокумента.Договор                         КАК Договор,
	|	ДанныеДокумента.ЭтапДоговора              КАК ЭтапДоговора,
	|	ДанныеДокумента.НомерПлатежногоДокумента        КАК НомерДокумента,
	|	-ДанныеДокумента.Сумма 		КАК Сумма
	|ИЗ
	|	Документ.ВозвратОплаты                          КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка";
	Результат = Запрос.Выполнить();
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПокупателями", Результат.Выгрузить());
		
КонецПроцедуры // ИнициализироватьДанныеДокумента()
