
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//1С-Минск +
	Если НЕ ПравоДоступа("Изменение", Метаданные.РегистрыСведений.АдресныйКлассификатор) Тогда
		//
		Элементы.ЗагрузитьКлассификатор.Видимость = Ложь;
	КонецЕсли;
	Элементы.ОчиститьКлассификатор.Видимость = Ложь;
	Элементы.ПроверитьОбновление.Видимость = Ложь;
//1С-Минск -	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКлассификатор(Команда)
//1С-Минск
	ОткрытьФорму("Обработка.мЗагрузкаАдресногоКлассификатора.Форма.Форма");
	//АдресныйКлассификаторКлиент.ЗагрузитьАдресныйКлассификатор();
//1С-Минск
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКлассификаторВыполнить(Команда)
	
//1С-Минск
	АдресныйКлассификаторКлиент.ОчиститьКлассификатор();
	//АдресныйКлассификаторКлиентРБ.ОчиститьКлассификатор();
//1С-Минск
	ОбновитьОтображениеДанных();
	
КонецПроцедуры
	
&НаКлиенте
Процедура ПроверитьОбновление(Команда)
	
	АдресныйКлассификаторКлиент.ОпределитьНеобходимостьОбновленияАдресныхОбъектов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_АдресныйКлассификатор" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

