
Функция ПолучитьИнструменты() Экспорт
	
	Возврат Вычислить("КипВнешнийКомпонент.ПолучитьИнструменты()");
	
КонецФункции

Функция ЗначениеТаймера(Инструменты) Экспорт
	
	Возврат ВыполнитьМетод(Инструменты, "ЗначениеТаймера");
	
КонецФункции

Процедура Пауза(Инструменты, Длительность) Экспорт
	
	Структура = Новый Структура("Длительность", Длительность);
	ВыполнитьМетод(Инструменты, "Пауза", Структура);
	
КонецПроцедуры

Функция ВыполнитьМетод(Объект, Имя, Параметры = Неопределено)
	
	ИменаПараметров = "";
	
	Если Параметры <> Неопределено Тогда
		Для каждого Параметр Из Параметры Цикл
			Если Не ПустаяСтрока(ИменаПараметров) Тогда
				ИменаПараметров = ИменаПараметров + ", ";
			КонецЕсли;
			
			ИменаПараметров = ИменаПараметров + "Параметры." + Параметр.Ключ;
		КонецЦикла;
	КонецЕсли;
	
	Попытка
		Возврат Вычислить("Объект." + Имя + "(" + ИменаПараметров + ")");
	Исключение
		Если Объект <> Неопределено И Объект.ЕстьОшибка() Тогда
			ВызватьИсключение Объект.ОписаниеОшибки();
		Иначе
			ВызватьИсключение;
		КонецЕсли;
	КонецПопытки;
	
КонецФункции
