
//// УправлениеДоступом

//// Пояснения см. в комментарии к процедуре УправлениеДоступом.ДобавитьПоле()
//Процедура ЗаполнитьСвойстваОграниченияДоступа(Поля, ВидыДоступа) Экспорт
//	
//	// Правообразующие поля
//	УправлениеДоступом.УстановитьРегистрКомбинаций(Поля, "БезРегистраКомбинаций");
//	УправлениеДоступом.ДобавитьПоле(Поля, "Документ", "");
//	
//	// Виды доступа
//	УправлениеДоступом.ДобавитьВидДоступа(ВидыДоступа, "Объект", "Чтение", , "Документ");
//	
//КонецПроцедуры

//// Конец УправлениеДоступом
