
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура;
	ВидДокумента = мРаботаСДоговорами.ПолучитьВидДокумента(ПараметрКоманды);
	Если ВидДокумента = ПредопределенноеЗначение("Справочник.ВидыВнутреннихДокументов.АктВыполненныхРабот") Тогда
	    Договор = мРаботаСДоговорами.ПолучитьДоговорСвязанногоДокумента(ПараметрКоманды);
		ПараметрыФормы.Вставить("Договор", Договор);
		ПараметрыФормы.Вставить("АктВыполненныхРабот", ПараметрКоманды);
	Иначе
		ПараметрыФормы.Вставить("Договор", ПараметрКоманды);
	КонецЕсли; 
	
	Если мРазное.ПолучитьГородБазы() = "Гродно" Тогда 
		ОткрытьФорму("Обработка.Гр_СозданиеПечатьАктовВыполненныхРабот.Форма.Форма", ПараметрыФормы, ПараметрКоманды, Новый УникальныйИдентификатор);
	Иначе
		
		Если мРаботаСДоговорами.ПолучитьВидДокумента(ПараметрыФормы.Договор) = ПредопределенноеЗначение("Справочник.ВидыВнутреннихДокументов.ДоговорГКИ") Тогда
			ОткрытьФорму("Обработка.мСозданиеПечатьАктовВыполненныхРабот.Форма.ФормаГКИ", ПараметрыФормы, ПараметрКоманды, Новый УникальныйИдентификатор);
		Иначе
			ОткрытьФорму("Обработка.мСозданиеПечатьАктовВыполненныхРабот.Форма", ПараметрыФормы, ПараметрКоманды, Новый УникальныйИдентификатор);
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

 