
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
        |   УчетДоговоровОбороты.Договор КАК Договор,
        |   УчетДоговоровОбороты.ЭтапДоговора КАК ЭтапДоговора,
        |   УчетДоговоровОбороты.СуммаПриход КАК СуммаПриход
        |ПОМЕСТИТЬ Новые
        |ИЗ
        |   РегистрНакопления.УчетДоговоров.Обороты(&Дата3, &Дата4, Период, ) КАК УчетДоговоровОбороты
        |ГДЕ
        |   УчетДоговоровОбороты.СуммаПриход > 0
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |   УчетДоговоровОстатки.Договор КАК Договор,
        |   УчетДоговоровОстатки.ЭтапДоговора КАК ЭтапДоговора,
        |   УчетДоговоровОстатки.СтавкаНДС КАК СтавкаНДС,
        |   УчетДоговоровОстатки.ОсвобождениеОтНДС КАК ОсвобождениеОтНДС,
        |   УчетДоговоровОстатки.СуммаОстаток КАК СуммаОстаток,
        |   УчетДоговоровОстатки.НДСОстаток КАК НДСОстаток,
        |   УчетДоговоровОстатки.ЭтапДоговора.СтоимостьСНДС КАК СтоимостьСНДС
        |ПОМЕСТИТЬ ОстаткиДо
        |ИЗ
        |   РегистрНакопления.УчетДоговоров.Остатки(
        |           &Дата1,
        |           НЕ ЭтапДоговора В
        |                       (ВЫБРАТЬ
        |                           Новые.ЭтапДоговора
        |                       ИЗ
        |                           Новые КАК Новые)
        |               И НЕ Договор.РегистрационныйНомер ПОДОБНО ""%Гео%"") КАК УчетДоговоровОстатки
        |ГДЕ
        |   УчетДоговоровОстатки.СуммаОстаток <> 0
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        //|ВЫБРАТЬ
        //|   УчетДоговоровОстатки.Договор КАК Договор,
        //|   УчетДоговоровОстатки.ЭтапДоговора КАК ЭтапДоговора,
        //|   УчетДоговоровОстатки.СтавкаНДС КАК СтавкаНДС,
        //|   УчетДоговоровОстатки.ОсвобождениеОтНДС КАК ОсвобождениеОтНДС,
        //|   УчетДоговоровОстатки.СуммаОстаток КАК СуммаОстаток,
        //|   УчетДоговоровОстатки.НДСОстаток КАК НДСОстаток
        //|ПОМЕСТИТЬ ОстаткиПосле
        //|ИЗ
        //|   РегистрНакопления.УчетДоговоров.Остатки(
        //|           &Дата2,
        //|           НЕ ЭтапДоговора В
        //|                   (ВЫБРАТЬ
        //|                       Новые.ЭтапДоговора
        //|                   ИЗ
        //|                       Новые КАК Новые)) КАК УчетДоговоровОстатки
        //|ГДЕ
        //|   УчетДоговоровОстатки.СуммаОстаток <> 0
        //|;
        //|
        //|////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |   УчетДоговоровОбороты.Договор КАК Договор,
        |   УчетДоговоровОбороты.ЭтапДоговора КАК ЭтапДоговора,
        |   УчетДоговоровОбороты.СтавкаНДС КАК СтавкаНДС,
        |   УчетДоговоровОбороты.ОсвобождениеОтНДС КАК ОсвобождениеОтНДС,
        |   УчетДоговоровОбороты.СуммаПриход КАК СуммаПриход
        |ПОМЕСТИТЬ СтоимостьДо
        |ИЗ
        |   РегистрНакопления.УчетДоговоров.Обороты(
        |           ,
        |           &ДатаСтоимостьДо,
        |           Период,
        |           ЭтапДоговора В
        |               (ВЫБРАТЬ
        |                   ОстаткиДо.ЭтапДоговора
        |               ИЗ
        |                   ОстаткиДо КАК ОстаткиДо)) КАК УчетДоговоровОбороты
        |ГДЕ
        |   УчетДоговоровОбороты.СуммаПриход <> 0
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |   УчетДоговоровОбороты.Договор КАК Договор,
        |   УчетДоговоровОбороты.ЭтапДоговора КАК ЭтапДоговора,
        |   УчетДоговоровОбороты.СтавкаНДС КАК СтавкаНДС,
        |   УчетДоговоровОбороты.ОсвобождениеОтНДС КАК ОсвобождениеОтНДС,
        |   УчетДоговоровОбороты.СуммаПриход КАК СуммаПриход
        |ПОМЕСТИТЬ СтоимостьПосле
        |ИЗ
        |   РегистрНакопления.УчетДоговоров.Обороты(
        |           ,
        |           &ДатаСтоимостьПосле,
        |           Период,
        |           ЭтапДоговора В
        |               (ВЫБРАТЬ
        |                   ОстаткиДо.ЭтапДоговора
        |               ИЗ
        |                   ОстаткиДо КАК ОстаткиДо)) КАК УчетДоговоровОбороты
        |ГДЕ
        |   УчетДоговоровОбороты.СуммаПриход <> 0
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ Первые 1000
        |   ОстаткиДо.Договор КАК Договор,
        |   ОстаткиДо.ЭтапДоговора КАК ЭтапДоговора,
        |   ОстаткиДо.СтавкаНДС КАК СтавкаНДС,
        |   ОстаткиДо.ОсвобождениеОтНДС КАК ОсвобождениеОтНДС,
        //|   ОстаткиДо.СуммаОстаток КАК СуммаДо,
        //|   ОстаткиДо.НДСОстаток КАК НДСДо,
        //|   ОстаткиДо.СуммаОстаток / 10000 КАК СуммаПосле,
        //|   ОстаткиДо.НДСОстаток / 10000 КАК НДСПосле,
        //|   ОстаткиПосле.СуммаОстаток КАК СуммаОстаток,
        //|   ОстаткиДо.СтоимостьСНДС КАК СтоимостьСНДС,
        |   СтоимостьДо.СуммаПриход КАК СуммаДо,
        //|   СтоимостьПосле.СуммаПриход КАК СтоимостьПослеФакт,
        |   ВЫРАЗИТЬ(СтоимостьДо.СуммаПриход / 10000 КАК ЧИСЛО(19, 2)) КАК СуммаПосле
        |ИЗ
        |   ОстаткиДо КАК ОстаткиДо
        //|       ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиПосле КАК ОстаткиПосле
        //|       ПО ОстаткиДо.ЭтапДоговора = ОстаткиПосле.ЭтапДоговора
        //|           И ОстаткиДо.Договор = ОстаткиПосле.Договор
        |       ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьДо КАК СтоимостьДо
        |       ПО ОстаткиДо.ЭтапДоговора = СтоимостьДо.ЭтапДоговора
        |       ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьПосле КАК СтоимостьПосле
        |       ПО ОстаткиДо.ЭтапДоговора = СтоимостьПосле.ЭтапДоговора
        |ГДЕ
        |   (ВЫРАЗИТЬ(СтоимостьДо.СуммаПриход / 10000 КАК ЧИСЛО(19, 2))) <> (ВЫРАЗИТЬ(СтоимостьПосле.СуммаПриход КАК ЧИСЛО(19, 2)))
        |   И НЕ ОстаткиДо.Договор.ПометкаУдаления
        |   И НЕ ОстаткиДо.ЭтапДоговора.ПометкаУдаления
        |
        |УПОРЯДОЧИТЬ ПО
        |   ОстаткиДо.Договор.ДатаРегистрации,
        |   ОстаткиДо.Договор.ЧисловойНомер";
	
	Запрос.УстановитьПараметр("Дата1", НачалоДня(Объект.Дата));
	Запрос.УстановитьПараметр("Дата2", КонецДня(Объект.Дата)+1);
	Запрос.УстановитьПараметр("Дата3", КонецДня(Объект.Дата)+1); // со 02.07
	Запрос.УстановитьПараметр("Дата4", ТекущаяДата());
	Запрос.УстановитьПараметр("ДатаСтоимостьДо", НачалоДня(Объект.Дата)-1); // до 01.07
	Запрос.УстановитьПараметр("ДатаСтоимостьПосле", КонецДня(Объект.Дата)); // до 02.07
	
	Результат = Запрос.Выполнить().Выгрузить();
    Результат.Колонки.Добавить("НДСДо", Новый ОписаниеТипов("Число"));
    Результат.Колонки.Добавить("НДСПосле", Новый ОписаниеТипов("Число"));
    
    Для каждого Стр Из Результат Цикл
    
        Если Стр.СтавкаНДС = Справочники.мСтавкиНДС.НДС_20 Тогда
            Стр.НДСДо = Стр.СуммаДо/120*20;
            Стр.НДСПосле = Стр.СуммаПосле/120*20;
         КонецЕсли; 	
    КонецЦикла; 
	
	Объект.УчетДоговоров.Загрузить(Результат);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере_стар()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
        |   УчетДоговоровОбороты.Договор,
        |   УчетДоговоровОбороты.ЭтапДоговора,
        |   УчетДоговоровОбороты.СуммаПриход
        |ПОМЕСТИТЬ Новые
        |ИЗ
        |   РегистрНакопления.УчетДоговоров.Обороты(&Дата3, &Дата4, Период, ) КАК УчетДоговоровОбороты
        |ГДЕ
        |   УчетДоговоровОбороты.СуммаПриход > 0
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |   УчетДоговоровОстатки.Договор КАК Договор,
        |   УчетДоговоровОстатки.ЭтапДоговора КАК ЭтапДоговора,
        |   УчетДоговоровОстатки.СтавкаНДС КАК СтавкаНДС,
        |   УчетДоговоровОстатки.ОсвобождениеОтНДС КАК ОсвобождениеОтНДС,
        |   УчетДоговоровОстатки.СуммаОстаток КАК СуммаОстаток,
        |   УчетДоговоровОстатки.НДСОстаток КАК НДСОстаток,
        |   УчетДоговоровОстатки.ЭтапДоговора.СтоимостьСНДС КАК СтоимостьСНДС
        |ПОМЕСТИТЬ ОстаткиДо
        |ИЗ
        |   РегистрНакопления.УчетДоговоров.Остатки(
        |           &Дата1,
        |          НЕ ЭтапДоговора В
        |                       (ВЫБРАТЬ
        |                           Новые.ЭтапДоговора
        |                       ИЗ
        |                           Новые КАК Новые)) КАК УчетДоговоровОстатки
        |ГДЕ
        |   УчетДоговоровОстатки.СуммаОстаток > 0
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |   УчетДоговоровОстатки.Договор КАК Договор,
        |   УчетДоговоровОстатки.ЭтапДоговора КАК ЭтапДоговора,
        |   УчетДоговоровОстатки.СтавкаНДС КАК СтавкаНДС,
        |   УчетДоговоровОстатки.ОсвобождениеОтНДС КАК ОсвобождениеОтНДС,
        |   УчетДоговоровОстатки.СуммаОстаток КАК СуммаОстаток,
        |   УчетДоговоровОстатки.НДСОстаток КАК НДСОстаток
        |ПОМЕСТИТЬ ОстаткиПосле
        |ИЗ
        |   РегистрНакопления.УчетДоговоров.Остатки(&Дата2, ) КАК УчетДоговоровОстатки
        |ГДЕ
        |   УчетДоговоровОстатки.СуммаОстаток > 0
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |   ОстаткиДо.Договор КАК Договор,
        |   ОстаткиДо.ЭтапДоговора КАК ЭтапДоговора,
        |   ОстаткиДо.СтавкаНДС КАК СтавкаНДС,
        |   ОстаткиДо.ОсвобождениеОтНДС КАК ОсвобождениеОтНДС,
        |   ОстаткиДо.СуммаОстаток КАК СуммаДо,
        |   ОстаткиДо.НДСОстаток КАК НДСДо,
        |   ОстаткиДо.СуммаОстаток / 10000 КАК СуммаПосле,
        |   ОстаткиДо.НДСОстаток / 10000 КАК НДСПосле,
        |   ОстаткиПосле.СуммаОстаток КАК СуммаОстаток,
        |   ОстаткиДо.СтоимостьСНДС КАК СтоимостьСНДС
        |ИЗ
        |   ОстаткиДо КАК ОстаткиДо
        |       ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиПосле КАК ОстаткиПосле
        |       ПО ОстаткиДо.ЭтапДоговора = ОстаткиПосле.ЭтапДоговора
        |           И ОстаткиДо.Договор = ОстаткиПосле.Договор
        |ГДЕ
        |   (ВЫРАЗИТЬ(ОстаткиДо.СуммаОстаток / 10000 КАК ЧИСЛО(19, 2))) <> ВЫРАЗИТЬ(ОстаткиПосле.СуммаОстаток КАК ЧИСЛО(19, 2))
        |   И НЕ ОстаткиДо.Договор.ПометкаУдаления
        |   И НЕ ОстаткиДо.ЭтапДоговора.ПометкаУдаления
        |
        |УПОРЯДОЧИТЬ ПО
        |   ОстаткиДо.Договор.ДатаРегистрации,
        |   ОстаткиДо.Договор.ЧисловойНомер";
	
	Запрос.УстановитьПараметр("Дата1", НачалоДня(Объект.Дата));
	Запрос.УстановитьПараметр("Дата2", КонецДня(Объект.Дата)+1);
	Запрос.УстановитьПараметр("Дата3", КонецДня(Объект.Дата)+1); // со 02.07
	Запрос.УстановитьПараметр("Дата4", ТекущаяДата());
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Объект.УчетДоговоров.Загрузить(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
    
    // проверка корректных
    й = Объект.УчетДоговоров.Количество()-1;
    Пока й >= 0 Цикл
        ТекСтрока = Объект.УчетДоговоров[й];
        Если Не ЗначениеЗаполнено(ТекСтрока.Договор) Тогда
            Сообщить("Проблемный этап код="+ПолучитьКодЭтапа(ТекСтрока.ЭтапДоговора));
            Объект.УчетДоговоров.Удалить(й);
            й=й-1;
        	Продолжить;
        КонецЕсли; 
        Если Не ЗначениеЗаполнено(ТекСтрока.ЭтапДоговора) Тогда
            Объект.УчетДоговоров.Удалить(й);
            й=й-1;
        	Продолжить;
        КонецЕсли; 
    	
        й=й-1;
    КонецЦикла; 
	
	// контроль этапов
    //Для каждого Стр Из Объект.УчетДоговоров Цикл
    //	Если Стр.СтоимостьСНДС <> Стр.СуммаДо Тогда
    //		Сообщить("Строка = "+ Стр.НомерСтроки); 
    //        //Элементы.УчетДоговоров.ТекущаяСтрока = Стр.ПолучитьИдентификатор();
    //        //Элементы.УчетДоговоров.ПодчиненныеЭлементы.УчетДоговоровДоговор.ЦветФона = WebЦвета.Розовый;
    //		
    //	КонецЕсли; 
    //КонецЦикла; 
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКодЭтапа(ЭтапДоговора)
    Возврат ЭтапДоговора.Код;
КонецФункции // ПолучитьКодЭтапа(ТекСтрока.ЭтапДоговора)()

&НаСервере
Функция ЗаполнитьВедомостьНаСервере() 
	ТабДок = Новый ТабличныйДокумент;
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	Макет = ДокОбъект.ПолучитьМакет("ВедомостьПересчета");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ТабДок.Вывести(ОбластьЗаголовок);
	
	ТабДок.Вывести(ОбластьШапка);
	
	НомерПП = 0;
	ИтогДоД = 0;
	ИтогПослеРасчД = 0;
	ИтогПослеФактД = 0;
	ИтогРазницаД = 0;
	ИтогДоК = 0;
	ИтогПослеРасчК = 0;
	ИтогПослеФактК = 0;
	ИтогРазницаК = 0;
	
	Для каждого стр из Объект.РасчетыСПокупателями Цикл
		НомерПП = НомерПП+1;
		ОбластьСтрока.Параметры.НомерПП = НомерПП;
		ОбластьСтрока.Параметры.Контрагент = Стр.Корреспондент;
		ОбластьСтрока.Параметры.Договор = Стр.Договор.РегистрационныйНомер;
		ОбластьСтрока.Параметры.Этап = Стр.ЭтапДоговора.НомерЭтапа;
		Если Стр.СуммаДо > 0 Тогда
			// Предоплата
			ОбластьСтрока.Параметры.ДоД = 0;
			ОбластьСтрока.Параметры.ПослеРасчД = 0;
			ОбластьСтрока.Параметры.ПослеФактД = 0;
			ОбластьСтрока.Параметры.РазницаД = 0;
			ОбластьСтрока.Параметры.ДоК = Стр.СуммаДо;
			ПослеРасчК = Окр(Стр.СуммаДо/10000, 2, РежимОкругления.Окр15как20);
			ОбластьСтрока.Параметры.ПослеРасчК = ПослеРасчК;
			ОбластьСтрока.Параметры.ПослеФактК = Стр.СуммаПосле;
			ОбластьСтрока.Параметры.РазницаК = Стр.СуммаПосле - ПослеРасчК;
		Иначе
			ОбластьСтрока.Параметры.ДоД = -Стр.СуммаДо;
			ПослеРасчД = Окр(-Стр.СуммаДо/10000, 2, РежимОкругления.Окр15как20);
			ОбластьСтрока.Параметры.ПослеРасчД = ПослеРасчД;
			ОбластьСтрока.Параметры.ПослеФактД = -Стр.СуммаПосле;
			ОбластьСтрока.Параметры.РазницаД = -Стр.СуммаПосле - ПослеРасчД;
			ОбластьСтрока.Параметры.ДоК = 0;
			ОбластьСтрока.Параметры.ПослеРасчК = 0;
			ОбластьСтрока.Параметры.ПослеФактК = 0;
			ОбластьСтрока.Параметры.РазницаК = 0;
		КонецЕсли; 
		
		ТабДок.Вывести(ОбластьСтрока);
		
		ИтогДоД = ИтогДоД + ОбластьСтрока.Параметры.ДоД;
		ИтогПослеРасчД = ИтогПослеРасчД + ОбластьСтрока.Параметры.ПослеРасчД;
		ИтогПослеФактД = ИтогПослеФактД + ОбластьСтрока.Параметры.ПослеФактД;
		ИтогРазницаД = ИтогРазницаД + ОбластьСтрока.Параметры.РазницаД;
		ИтогДоК = ИтогДоК + ОбластьСтрока.Параметры.ДоК;
		ИтогПослеРасчК = ИтогПослеРасчК + ОбластьСтрока.Параметры.ПослеРасчК;
		ИтогПослеФактК = ИтогПослеФактК + ОбластьСтрока.Параметры.ПослеФактК;
		ИтогРазницаК = ИтогРазницаК + ОбластьСтрока.Параметры.РазницаК;
	КонецЦикла;
	
	ОбластьПодвал.Параметры.ИтогДоД = ИтогДоД;
	ОбластьПодвал.Параметры.ИтогПослеРасчД = ИтогПослеРасчД;
	ОбластьПодвал.Параметры.ИтогПослеФактД = ИтогПослеФактД;
	ОбластьПодвал.Параметры.ИтогРазницаД = ИтогРазницаД;
	ОбластьПодвал.Параметры.ИтогДоК = ИтогДоК;
	ОбластьПодвал.Параметры.ИтогПослеРасчК = ИтогПослеРасчК;
	ОбластьПодвал.Параметры.ИтогПослеФактК = ИтогПослеФактК;
	ОбластьПодвал.Параметры.ИтогРазницаК = ИтогРазницаК;
		
	ТабДок.Вывести(ОбластьПодвал);
	
	Возврат ТабДок;
КонецФункции
 
&НаКлиенте
Процедура ПечатьВедомости(Команда)
	ТабДок = ЗаполнитьВедомостьНаСервере();
	
	ТабДок.Автомасштаб = Истина;
	ТабДок.Показать();
КонецПроцедуры
