#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПоказаныОтветыНаСообщение = Ложь;
	ОтображатьТолькоНовыеСообщения = Ложь;
	
	Список.Параметры.УстановитьЗначениеПараметра("Пользователь", Пользователи.ТекущийПользователь());
	СписокТем.Параметры.УстановитьЗначениеПараметра("Пользователь", Пользователи.ТекущийПользователь());
	
	ОтображаемыеСообщения = НСтр("ru = 'Все'");
	Элементы.ВидПросмотра.СписокВыбора.Очистить();
	Элементы.ВидПросмотра.СписокВыбора.Добавить(
		НСтр("ru = 'Списком'"), 
		НСтр("ru = 'Списком'"));
	Элементы.ВидПросмотра.СписокВыбора.Добавить(
		НСтр("ru = 'По разделам'"),
		НСтр("ru = 'По разделам'"));	
	ВидПросмотра = НСтр("ru = 'Списком'");
	
	Элементы.ОтображаемыеТемы.СписокВыбора.Очистить();
	Элементы.ОтображаемыеТемы.СписокВыбора.Добавить(
		НСтр("ru = 'Все'"), 
		НСтр("ru = 'Все'"));
	Элементы.ОтображаемыеТемы.СписокВыбора.Добавить(
		НСтр("ru = 'Прочтенные'"),
		НСтр("ru = 'Прочтенные'"));
	Элементы.ОтображаемыеТемы.СписокВыбора.Добавить(
		НСтр("ru = 'Непрочтенные'"),
		НСтр("ru = 'Непрочтенные'"));
	ОтображаемыеТемы = НСтр("ru = 'Все'");
	
	// Прочтение
	ТекущееСообщениеПрочтено = Истина;
		
	ИспользоватьАвтоматическоеПрочтение =
		ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			"НастройкиПрочтения",
			"ПомечатьСообщенияФорумаКакПрочтенныеПриПрочтенныеПриПросмотреВОбластиЧтения",
			Ложь);

	ПоложениеОбластиЧтения = 
		ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			ЭтаФорма.ИмяФормы,
			"ПоложениеОбластиЧтения",
			"Снизу");
	ПоложениеОбластиЧтенияТем = 
		ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			ЭтаФорма.ИмяФормы,
			"ПоложениеОбластиЧтенияТем",
			"Отключена");
	ОбновитьПоложениеОбластиЧтенияСервер();
	ОбновитьПоложениеОбластиЧтенияТемСервер();
	
	ПоказатьПомеченныеНаУдаление = 
			ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			ЭтаФорма.ИмяФормы,
			"ПоказатьПомеченныеНаУдаление",
			Ложь);
	
	РежимОтображенияСообщенийДеревом = 
		ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			ЭтаФорма.ИмяФормы, 
			"РежимОтображенияСообщенийДеревом", 
			Ложь);
			
	РазделПриОткрытии = 
		ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			ЭтаФорма.ИмяФормы, 
			"ТекущийРаздел", 
			Справочники.ТемыОбсуждений.ПустаяСсылка());
	Если ЗначениеЗаполнено(РазделПриОткрытии) Тогда
		СписокТем.Параметры.УстановитьЗначениеПараметра("Группа", РазделПриОткрытии);
		Элементы.Дерево.ТекущаяСтрока = РазделПриОткрытии;
		ТекущийРаздел = РазделПриОткрытии;
	КонецЕсли;
	
	ТекущаяТемаПриОткрытии = 
		ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			ЭтаФорма.ИмяФормы, 
			"ТекущаяТема", 
			Справочники.ТемыОбсуждений.ПустаяСсылка());
	Если ЗначениеЗаполнено(ТекущаяТемаПриОткрытии) Тогда
		Элементы.СписокТем.ТекущаяСтрока = ТекущаяТемаПриОткрытии;
	КонецЕсли;
	
	// Новое для формы просмотра
	Список.Параметры.УстановитьЗначениеПараметра("Тема", "");
		
	РеквизитыТемы = Новый Структура;
	РеквизитыТемы.Вставить("Ссылка", Тема);
	
	Если Параметры.Свойство("ТекущееСообщение") Тогда
		ТекущееСообщение = Параметры.ТекущееСообщение;
	Иначе
		ТекущееСообщение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			Тема.УникальныйИдентификатор(), 
			"ТекущееСообщение", 
			"");
	КонецЕсли;
	
	ОбновитьСервер();
	ПереключитьВидПросмотра();
	
	Если ОбщегоНазначенияДокументооборот.ПриложениеЯвляетсяВебКлиентом() Тогда
		Элементы.СписокТемКонтекстноеМенюНастроитьАвтообновлениеСпискаТем.Видимость = Ложь;
		Элементы.СписокКонтекстноеМенюНастроитьАвтообновлениеСпискаСообщений.Видимость = Ложь;
	Иначе
		Автообновление.ЗагрузитьНастройкиАвтообновленияСписка(ЭтаФорма, "СписокТем");
		Элементы.СписокТемКонтекстноеМенюНастроитьАвтообновлениеСпискаТем.Видимость = Истина;
		Автообновление.ЗагрузитьНастройкиАвтообновленияСписка(ЭтаФорма, "Список");
		Элементы.СписокКонтекстноеМенюНастроитьАвтообновлениеСпискаСообщений.Видимость = Истина;
	КонецЕсли;
	
	ШрифтОбластиЧтения = РаботаСОбсуждениями.ПолучитьПерсональнуюНастройку("ШрифтОбластиЧтения");
	УстановитьШрифтОбластиЧтения(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьТекущуюСтроку(ТекущееСообщение);
	УстановитьДоступностьКоманд();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	ПриЗакрытииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если РаботаСПрочтениямиКлиент.ПроверитьНеобходимостьОбновления(ИмяСобытия, Параметр, "Обсуждения") Тогда
		РаботаСОбсуждениямиКлиент.ОбновитьПрочтенностьЭлементовДерева(
			Элементы.ДеревоСообщений,
			ДеревоСообщений,
			РежимОтображенияСообщенийДеревом,
			Параметр);
		ОбновитьСписки();
	КонецЕсли;
	
	Если ИмяСобытия = "ПервоеСообщениеТемыОбсужденияИзменено" Тогда
		Обновить(Неопределено);
	КонецЕсли;
	
	Если ИмяСобытия = "СообщениеОбсужденияИзменено" Тогда
		Обновить(Неопределено);
	КонецЕсли;
	
	Если ИмяСобытия = "СозданаТемаПоПредмету" Тогда
		Если Параметр.Свойство("Тема") И Параметр.Свойство("Предмет") И Параметр.Предмет = Предмет Тогда
			ЗадатьТему(Параметр.Тема);
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяСобытия = "ВыбраноСообщениеДляПросмотра" Тогда
		Если Параметр.Свойство("Тема") И Параметр.Тема = Тема Тогда
			УстановитьТекущуюСтроку(Параметр.Сообщение);
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяСобытия = "Создание_ТемыОбсуждений" Тогда
		Если Параметр.Свойство("Тема") Тогда
			Элементы.СписокТем.ТекущаяСтрока = Параметр.Тема;
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяСобытия = "Запись_Файл" И Параметр.Событие = "ДанныеФайлаИзменены" Тогда
		Если ТипЗнч(Параметр) = Тип("Структура") И Параметр.Свойство("Владелец") Тогда
			Если Элементы.Список.ТекущаяСтрока = Параметр.Владелец Тогда
				Обновить(Неопределено);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	Если ТипЗнч(НовыйОбъект) = Тип("СправочникСсылка.СообщенияОбсуждений") Тогда
		УстановитьТекущуюСтроку(НовыйОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)

	УстановитьОтборСписка(СписокТем, Настройки);
	ВидПросмотра = Настройки["ВидПросмотра"];
	ПереключитьВидПросмотра();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РазделыОбсужденийПриИзменении(Элемент)
	
	ПараметрыОтбора = Новый Соответствие();
	Параметрыотбора.Вставить("РазделыОбсуждений", РазделыОбсуждений);
	
	УстановитьОтборСписка(СписокТем, ПараметрыОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ГолосованиеПриИзменении(Элемент)
	
	Элементы.Проголосовать.Доступность = ЗначениеЗаполнено(Голосование) И Не ЗакрытаяТема;
	Элементы.ПроголосоватьСФайлами.Доступность = ЗначениеЗаполнено(Голосование) И Не ЗакрытаяТема;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПросмотраПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(ВидПросмотра) 
		Или Не (ВидПросмотра = НСтр("ru = 'Списком'") 
		Или ВидПросмотра = НСтр("ru = 'По разделам'")) Тогда
		ВидПросмотра = НСтр("ru = 'Списком'");
	КонецЕсли;
	
	ПереключитьВидПросмотра();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.СтраницаСписокТем Тогда
		
		ТекущийЭлемент = Элементы.СписокТем;
		
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаСообщенияТемы Тогда
		
		Если РежимОтображенияСообщенийДеревом Тогда
			ТекущийЭлемент = Элементы.ДеревоСообщений;
		Иначе
			ТекущийЭлемент = Элементы.Список;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображаемыеТемыПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(ОтображаемыеТемы) 
		Или Не (ОтображаемыеТемы = НСтр("ru = 'Все'")
		Или ОтображаемыеТемы = НСтр("ru = 'Прочтенные'")
		Или ОтображаемыеТемы = НСтр("ru = 'Непрочтенные'")) Тогда
		ОтображаемыеТемы = НСтр("ru = 'Все'");
	КонецЕсли;
	
	ПараметрыОтбора = Новый Соответствие();
	Параметрыотбора.Вставить("ОтображаемыеТемы", ОтображаемыеТемы);
	
	УстановитьОтборСписка(СписокТем, ПараметрыОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущееСообщениеТекстОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущееСообщениеТекстСФайламиОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущееСообщениеТекстСГолосованиемОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущееСообщениеТекстСФайламиИГолосованиемОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "Родитель" Тогда
		Если Элементы.Список.ДанныеСтроки(Элементы.Список.ТекущиеДанные.Родитель) = Неопределено 
			И ЗначениеЗаполнено(ВОтветНа) Тогда
			
			ПоказаныОтветыНаСообщение = Ложь;
			Элементы.СписокПоказатьОтветыНаСообщение.Пометка = Ложь;

			ВОтветНа = "";
			ПараметрыОтбора = Новый Соответствие();
			Параметрыотбора.Вставить("Родитель", ВОтветНа);
			
			УстановитьОтборСписка(Список, ПараметрыОтбора);
			
		КонецЕсли;
		
		СтандартнаяОбработка = Ложь;
		Элементы.Список.ТекущаяСтрока = Элементы.Список.ТекущиеДанные.Родитель;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Список.ТекущаяСтрока <> Неопределено Тогда
		ПодключитьОбработчикОжидания("ОбработкаОжиданияПрочтения", 0.2, Истина);
	Иначе
		ОчиститьТекущееСообщение();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокТем

&НаКлиенте
Процедура СписокТемВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Тема <> Элемент.ТекущиеДанные.Ссылка Тогда
		ЗадатьТему(Элемент.ТекущиеДанные.Ссылка);
		УстановитьДоступностьКоманд();
	КонецЕсли;
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаСообщенияТемы;
	
	Если РежимОтображенияСообщенийДеревом Тогда
		ТекущийЭлемент = Элементы.ДеревоСообщений;
	Иначе
		ТекущийЭлемент = Элементы.Список;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТемПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	Если Копирование Тогда
		РаботаСОбсуждениямиКлиент.СкопироватьТему(ТекущаяТема);
		Возврат;
	КонецЕсли;
	
	СоздатьНовуюТемуКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТемПриАктивизацииСтроки(Элемент)
	
	Если Элементы.СписокТем.ТекущаяСтрока <> Неопределено Тогда
		ПодключитьОбработчикОжидания("ОбработкаОжиданияПрочтенияТемы", 0.2, Истина);
	Иначе
		ОбработатьФормированиеПредпросмотраТемы(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДерево

&НаКлиенте
Процедура ДеревоПриАктивизацииСтроки(Элемент)
	
	Если ВидПросмотра = НСтр("ru = 'По разделам'") Тогда
		ТекущийРаздел = Элементы.Дерево.ТекущаяСтрока;
		ПодключитьОбработчикОжидания("ОбработкаОжидания", 0.2, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоСообщений

&НаКлиенте
Процедура ДеревоСообщенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(, Элемент.ТекущиеДанные.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСообщенийПриАктивизацииСтроки(Элемент)
	
	Если Элементы.ДеревоСообщений.ТекущаяСтрока <> Неопределено Тогда
		ПодключитьОбработчикОжидания("ОбработкаОжиданияПрочтения", 0.2, Истина);
	Иначе
		ОчиститьТекущееСообщение();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСообщенийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	Сообщение = ПолучитьТекущееСообщение(Ложь);
	ОткрытьФорму("Справочник.СообщенияОбсуждений.Форма.ФормаЭлемента", 
		Новый Структура("Тема", Тема));
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСообщенийПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	Если Элемент.ТекущаяСтрока <> Неопределено Тогда
		ПоказатьЗначение(, Элемент.ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСообщенийПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	Сообщения = ПолучитьВыбранныеСообщения(Истина);
	Если Сообщения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Сообщения.Количество() = 1 Тогда
		
		ПометкаУдаления = Не Элементы.ДеревоСообщений.ТекущиеДанные.ПометкаУдаления;
		Если ПометкаУдаления Тогда 
			ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Пометить ""%1"" на удаление?'"),
				Строка(Элементы.ДеревоСообщений.ТекущиеДанные.Ссылка));
		Иначе
			ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Снять с ""%1"" пометку удаления?'"),
				Строка(Элементы.ДеревоСообщений.ТекущиеДанные.Ссылка));
		КонецЕсли;
		
	Иначе
		
		ПометкаУдаления = Истина;
		Для Каждого СтрокаТаблицы Из Элемент.ВыделенныеСтроки Цикл
			СтрокаТаблицыСообщения = ДеревоСообщений.НайтиПоИдентификатору(СтрокаТаблицы);
			Если СтрокаТаблицыСообщения.ПометкаУдаления = Истина Тогда
				ПометкаУдаления = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ПометкаУдаления Тогда
			ТекстВопроса = НСтр("ru = 'Пометить выделенные элементы на удаление?'");
		Иначе
			ТекстВопроса = НСтр("ru = 'Снять с выделенных элементов пометку на удаление?'");
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыОбработчика = Новый Структура;
	ПараметрыОбработчика.Вставить("Сообщения", Сообщения);
	ПараметрыОбработчика.Вставить("ПометкаУдаления", ПометкаУдаления);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДеревоСообщенийПередУдалениемЗавершение", ЭтотОбъект, ПараметрыОбработчика);
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСообщенийПередУдалениемЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	СписокРаскрытыхСообщений.Очистить();
	РаботаСОбсуждениямиКлиент.ПолучитьМассивРаскрытыхСообщений(Элементы.ДеревоСообщений, ДеревоСообщений.ПолучитьЭлементы(), СписокРаскрытыхСообщений);
	ВременноеТекущееСообщение = ТекущееСообщение;
	ПометитьНаУдалениеСообщения(ДополнительныеПараметры.Сообщения, ДополнительныеПараметры.ПометкаУдаления);
	РаботаСОбсуждениямиКлиент.УстановитьРазвернутостьЭлементовДерева(Элементы.ДеревоСообщений, ДеревоСообщений, СписокРаскрытыхСообщений);
	РаботаСОбсуждениямиКлиент.УстановитьТекущееСообщениеВДеревеПоСсылке(Элементы.ДеревоСообщений, ДеревоСообщений, ВременноеТекущееСообщение);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСообщенийПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
	СписокРаскрытыхСообщений.Очистить();
	РаботаСОбсуждениямиКлиент.ПолучитьМассивРаскрытыхСообщений(Элементы.ДеревоСообщений, ДеревоСообщений.ПолучитьЭлементы(), СписокРаскрытыхСообщений);
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив") 
		И ПараметрыПеретаскивания.Значение.Количество() <> 0 
		И ТипЗнч(ПараметрыПеретаскивания.Значение[0]) = Тип("СправочникСсылка.СообщенияОбсуждений") Тогда
		
		Если Строка <> Неопределено Тогда
			СтрокаПриемник = Строка;
			СтрокаДерева = ДеревоСообщений.НайтиПоИдентификатору(СтрокаПриемник);
			СсылкаНовыйРодитель = СтрокаДерева.Ссылка;
		Иначе
			СсылкаНовыйРодитель = "";
		КонецЕсли;
		
		КодПереноса = ДеревоСообщенийПеретаскиваниеСервер(ПараметрыПеретаскивания.Значение, СсылкаНовыйРодитель, Тема);
		Если КодПереноса = 1 Тогда
			Возврат;
		ИначеЕсли КодПереноса = 2 Тогда
			ТекстПредупреждения = НСтр("ru = 'Невозможно перетаскивать сообщения между темами.'");
			ПоказатьПредупреждение(, ТекстПредупреждения);
			Возврат;
		ИначеЕсли КодПереноса = 3 Тогда
			ТекстПредупреждения = НСтр("ru = 'Невозможно перетаскивать первое сообщение темы.'");
			ПоказатьПредупреждение(, ТекстПредупреждения);
			Возврат;
		КонецЕсли;
		
	Иначе
		Возврат;
	КонецЕсли;
	
	РаботаСОбсуждениямиКлиент.УстановитьРазвернутостьЭлементовДерева(Элементы.ДеревоСообщений, ДеревоСообщений, СписокРаскрытыхСообщений);		
	РаботаСОбсуждениямиКлиент.УстановитьТекущееСообщениеВДеревеПоСсылке(Элементы.ДеревоСообщений, ДеревоСообщений, ТекущееСообщение);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСообщенийНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	Если Элемент.ТекущаяСтрока = Неопределено Тогда
		Выполнение = Ложь;
		Возврат;
	КонецЕсли;
	
	МассивПеретаскиваемыхЗначений = Новый Массив;

	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив") Тогда
		Для Каждого ЭлементМассива Из ПараметрыПеретаскивания.Значение Цикл
			Если ТипЗнч(ЭлементМассива) = Тип("Число") Тогда
				ПеретаскиваемоеЗначение = Элемент.ДанныеСтроки(ЭлементМассива);
				МассивПеретаскиваемыхЗначений.Добавить(ПеретаскиваемоеЗначение.Ссылка);
				ЗаполненМассивПеретаскиваемыхЗначений = Истина;				
			КонецЕсли;
		КонецЦикла;	
	ИначеЕсли ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("СправочникСсылка.СообщенияОбсуждений") Тогда
		ПеретаскиваемоеЗначение = Элемент.ДанныеСтроки(ЭлементМассива.Значение);
		МассивПеретаскиваемыхЗначений.Добавить(ПеретаскиваемоеЗначение.Ссылка);
		ЗаполненМассивПеретаскиваемыхЗначений = Истина;
		Возврат;
	Иначе
		ЗаполненМассивПеретаскиваемыхЗначений = Ложь;
	КонецЕсли;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	ПеретаскиваемоеЗначение = ТекущиеДанные.Ссылка;
	
	Если ЗаполненМассивПеретаскиваемыхЗначений Тогда
		ПараметрыПеретаскивания.Значение = МассивПеретаскиваемыхЗначений;
		Возврат;
	КонецЕсли;
	
	Выполнение = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСообщенийПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
	Если (Строка = Неопределено) Или (ПараметрыПеретаскивания.Значение = Неопределено) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВложения

&НаКлиенте
Процедура ВложенияСообщенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
			
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		ВстроеннаяПочтаКлиент.ОткрытьВложение(Элемент.ТекущиеДанные.Ссылка, УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВложенияСообщенияПриАктивизацииСтроки(Элемент)
	
	УстановитьДоступностьКомандРаботыСВложением();
	
КонецПроцедуры

&НаКлиенте
Процедура ВложенияСообщенияНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	Если Элемент.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивФайлов = Новый Массив;
	Для каждого ВыделеннаяСтрока Из Элемент.ВыделенныеСтроки Цикл
		ДанныеСтроки = ВложенияСообщения.НайтиПоИдентификатору(ВыделеннаяСтрока);
		МассивФайлов.Добавить(ДанныеСтроки.Ссылка);
	КонецЦикла;
	Если МассивФайлов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПеретаскивания.Значение = МассивФайлов;

КонецПроцедуры

&НаКлиенте
Процедура ВложенияСообщенияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВложенияСообщенияПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		ПоказатьЗначение(, Элемент.ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВложенияСообщенияПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТекущиеДанные.ПометкаУдаления Тогда
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Пометить ""%1"" на удаление?'"),
			ТекущиеДанные.Представление);
	Иначе
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Снять с ""%1"" пометку на удаление?'"),
			ТекущиеДанные.Представление);
		КонецЕсли;
	
	ПараметрыОбработчика = Новый Структура;
	ПараметрыОбработчика.Вставить("Вложение", ТекущиеДанные.Ссылка);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВложенияСообщенияПередУдалениемЗавершение", ЭтотОбъект, ПараметрыОбработчика);
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ВложенияСообщенияПередУдалениемЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ВложениеСообщенияПометитьНаУдалениеСервер(ДополнительныеПараметры.Вложение);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТекущаяТемаВложения

&НаКлиенте
Процедура ТекущаяТемаВложенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
			
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		ВстроеннаяПочтаКлиент.ОткрытьВложение(Элемент.ТекущиеДанные.Ссылка, УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяТемаВложенияПриАктивизацииСтроки(Элемент)
	
	УстановитьДоступностьКомандРаботыСВложениемТемы();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяТемаВложенияНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	Если Элементы.ТекущаяТемаВложения.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивФайлов = Новый Массив;
	Для каждого ВыделеннаяСтрока Из Элементы.ТекущаяТемаВложения.ВыделенныеСтроки Цикл
		ДанныеСтроки = ТекущаяТемаВложения.НайтиПоИдентификатору(ВыделеннаяСтрока);
		МассивФайлов.Добавить(ДанныеСтроки.Ссылка);
	КонецЦикла;
	Если МассивФайлов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПеретаскивания.Значение = МассивФайлов;

КонецПроцедуры

&НаКлиенте
Процедура ТекущаяТемаВложенияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяТемаВложенияПередНачаломИзменения(Элемент, Отказ)

	Отказ = Истина;
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		ПоказатьЗначение(, Элементы.ТекущаяТемаВложения.ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяТемаВложенияПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТекущиеДанные.ПометкаУдаления Тогда
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Пометить ""%1"" на удаление?'"),
			ТекущиеДанные.Представление);
	Иначе
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Снять с ""%1"" пометку на удаление?'"),
			ТекущиеДанные.Представление);
	КонецЕсли;
	
	ПараметрыОбработчика = Новый Структура;
	ПараметрыОбработчика.Вставить("Вложение", ТекущиеДанные.Ссылка);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ТекущаяТемаВложенияПередУдалениемЗавершение", ЭтотОбъект, ПараметрыОбработчика);
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяТемаВложенияПередУдалениемЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяТемаВложенияПометитьНаУдалениеСервер(ДополнительныеПараметры.Вложение);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область Файлы

&НаКлиенте
Процедура СохранитьВложениеСообщенияКак(Команда)
	
	Если Элементы.СтраницыПросмотр.ТекущаяСтраница = Элементы.СтраницаПросмотрСФайлами Тогда
		Элемент = Элементы.ВложенияСообщения;
	ИначеЕсли Элементы.СтраницыПросмотр.ТекущаяСтраница = Элементы.СтраницаПросмотрСФайламиИГолосованием Тогда
		Элемент = Элементы.ВложенияСообщенияСГолосованием;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если Элемент.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент.ВыделенныеСтроки.Количество() > 1 Тогда
		СписокФайловДляВыгрузки = Новый СписокЗначений;
		Для каждого ВыбраннаяСтрока Из Элемент.ВыделенныеСтроки Цикл
			ДанныеСтроки = Элемент.ДанныеСтроки(ВыбраннаяСтрока);
			Если ЗначениеЗаполнено(ДанныеСтроки.Ссылка) Тогда
				СписокФайловДляВыгрузки.Добавить(ДанныеСтроки.Ссылка);
			КонецЕсли;
		КонецЦикла;
		Если СписокФайловДляВыгрузки.Количество() > 0 Тогда
			ВстроеннаяПочтаКлиент.СохранитьВложенияКак(СписокФайловДляВыгрузки, УникальныйИдентификатор);
		КонецЕсли;
	Иначе
		ДанныеФайла = РаботаСФайламиВызовСервера.ПолучитьДанныеФайлаДляСохранения(
			Элемент.ТекущиеДанные.Ссылка,
			Неопределено,
			ЭтаФорма.УникальныйИдентификатор);
		КомандыРаботыСФайламиКлиент.СохранитьКак(ДанныеФайла, УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотретьВложениеСообщения(Команда)
	
	Если Элементы.СтраницыПросмотр.ТекущаяСтраница = Элементы.СтраницаПросмотрСФайлами Тогда
		Элемент = Элементы.ВложенияСообщения;
	ИначеЕсли Элементы.СтраницыПросмотр.ТекущаяСтраница = Элементы.СтраницаПросмотрСФайламиИГолосованием Тогда
		Элемент = Элементы.ВложенияСообщенияСГолосованием;
	Иначе
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВстроеннаяПочтаКлиент.ОткрытьВложение(ТекущиеДанные.Ссылка, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьВложениеСообщения(Команда)
	
	Если Элементы.СтраницыПросмотр.ТекущаяСтраница = Элементы.СтраницаПросмотрСФайлами Тогда
		Элемент = Элементы.ВложенияСообщения;
	ИначеЕсли Элементы.СтраницыПросмотр.ТекущаяСтраница = Элементы.СтраницаПросмотрСФайламиИГолосованием Тогда
		Элемент = Элементы.ВложенияСообщенияСГолосованием;
	Иначе
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Обработчик = Новый ОписаниеОповещения("УстановитьДоступностьФайловыхКомандСообщения", ЭтотОбъект);
	РаботаСФайламиКлиент.РедактироватьСОповещением(Обработчик, 
		ТекущиеДанные.Ссылка, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакончитьРедактированиеВложенияСообщения(Команда)
	
	Если Элементы.СтраницыПросмотр.ТекущаяСтраница = Элементы.СтраницаПросмотрСФайлами Тогда
		Элемент = Элементы.ВложенияСообщения;
	ИначеЕсли Элементы.СтраницыПросмотр.ТекущаяСтраница = Элементы.СтраницаПросмотрСФайламиИГолосованием Тогда
		Элемент = Элементы.ВложенияСообщенияСГолосованием;
	Иначе
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Обработчик = Новый ОписаниеОповещения("УстановитьДоступностьФайловыхКомандСообщения", ЭтотОбъект);
	
	РаботаСФайламиКлиент.ЗакончитьРедактированиеСОповещением(
		Обработчик,
		ТекущиеДанные.Ссылка, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьФайловыхКомандСообщения(Результат = Неопределено, ПараметрыВыполнения = Неопределено) Экспорт
	
	ОбновитьФайлыСообщенияКлиент();
	УстановитьДоступностьКомандРаботыСВложением();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВложениеТемыКак(Команда)
	
	Если Элементы.ТекущаяТемаВложения.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.ТекущаяТемаВложения.ВыделенныеСтроки.Количество() > 1 Тогда
		СписокФайловДляВыгрузки = Новый СписокЗначений;
		Для каждого ВыбраннаяСтрока Из Элементы.ТекущаяТемаВложения.ВыделенныеСтроки Цикл
			ДанныеСтроки = Элементы.ТекущаяТемаВложения.ДанныеСтроки(ВыбраннаяСтрока);
			Если ЗначениеЗаполнено(ДанныеСтроки.Ссылка) Тогда
				СписокФайловДляВыгрузки.Добавить(ДанныеСтроки.Ссылка);
			КонецЕсли;
		КонецЦикла;
		Если СписокФайловДляВыгрузки.Количество() > 0 Тогда
			ВстроеннаяПочтаКлиент.СохранитьВложенияКак(СписокФайловДляВыгрузки, УникальныйИдентификатор);
		КонецЕсли;
	Иначе
		ДанныеФайла = РаботаСФайламиВызовСервера.ПолучитьДанныеФайлаДляСохранения(
			Элементы.ТекущаяТемаВложения.ТекущиеДанные.Ссылка,
			Неопределено,
			ЭтаФорма.УникальныйИдентификатор);
		КомандыРаботыСФайламиКлиент.СохранитьКак(ДанныеФайла, УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотретьВложениеТемы(Команда)
	
	ТекущиеДанные = Элементы.ТекущаяТемаВложения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВстроеннаяПочтаКлиент.ОткрытьВложение(ТекущиеДанные.Ссылка, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьВложениеТемы(Команда)
	
	ТекущиеДанные = Элементы.ТекущаяТемаВложения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Обработчик = Новый ОписаниеОповещения("УстановитьДоступностьФайловыхКомандТемы", ЭтотОбъект);
	РаботаСФайламиКлиент.РедактироватьСОповещением(Обработчик, 
		ТекущиеДанные.Ссылка, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьФайловыхКомандТемы(Результат = Неопределено, ПараметрыВыполнения = Неопределено) Экспорт
	
	ОбработатьФормированиеПредпросмотраТемы(ТекущаяТема);
	УстановитьДоступностьКомандРаботыСВложениемТемы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакончитьРедактированиеВложенияТемы(Команда)
	
	ТекущиеДанные = Элементы.ТекущаяТемаВложения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Обработчик = Новый ОписаниеОповещения("УстановитьДоступностьФайловыхКомандТемы", ЭтотОбъект);
	
	РаботаСФайламиКлиент.ЗакончитьРедактированиеСОповещением(
		Обработчик,
		ТекущиеДанные.Ссылка, УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область СписокТем

&НаКлиенте
Процедура СоздатьНовуюТему(Команда)
	
	СоздатьНовуюТемуКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ВсеСообщения(Команда)
	
	ОткрытьФорму("Справочник.СообщенияОбсуждений.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьАвтообновлениеСпискаТем(Команда)
	
	АвтообновлениеКлиент.УстановитьПараметрыАвтообновленияСписка(ЭтаФорма, "СписокТем");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбластьЧтенияТемОтключена(Команда)
	
	ПоложениеОбластиЧтенияТем = "Отключена";
	ОбновитьПоложениеОбластиЧтенияТемКлиент();
	ОбработатьФормированиеПредпросмотраТемы(ТекущаяТема);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбластьЧтенияТемСнизу(Команда)
	
	ПоложениеОбластиЧтенияТем = "Снизу";
	ОбновитьПоложениеОбластиЧтенияТемКлиент();
	ОбработатьФормированиеПредпросмотраТемы(ТекущаяТема);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбластьЧтенияТемСправа(Команда)
	
	ПоложениеОбластиЧтенияТем = "Справа";
	ОбновитьПоложениеОбластиЧтенияТемКлиент();
	ОбработатьФормированиеПредпросмотраТемы(ТекущаяТема);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКарточкуТемы(Команда)
	
	Если Не ЗначениеЗаполнено(Тема) Тогда
		ТекстПредупреждения = НСтр("ru = 'Не выбрана тема обсуждения.'");
		ПоказатьПредупреждение(, ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", Тема);
	
	ОткрытьФорму("Справочник.ТемыОбсуждений.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьВсеВГруппеКакПрочтенные(Команда)
	
	Темы = ПолучитьВыбранныеТемы(Истина);
	КоличествоТем = Темы.Количество();
	Если Темы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЧислоПрочтенных = 0;
	ВыделенныеСтроки = Элементы.СписокТем.ВыделенныеСтроки;
	Для каждого Ссылка Из ВыделенныеСтроки Цикл
		
		Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.ТемыОбсуждений") Тогда
			
			Прочтен = Элементы.СписокТем.ДанныеСтроки(Ссылка).Прочтен;
			
			Если Прочтен Тогда
				
				ЧислоПрочтенных = ЧислоПрочтенных + 1;
				
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЦикла;
	
	ПоставитьПометкуПрочтения = Истина;
	
	Если КоличествоТем = ЧислоПрочтенных Тогда
		ПоставитьПометкуПрочтения = Ложь;
	Иначе
		ПоставитьПометкуПрочтения = Истина;
	КонецЕсли;	
	
	Если КоличествоТем > 1 Тогда
		Если ПоставитьПометкуПрочтения Тогда
			Состояние(НСтр("ru = 'Темы помечаются как прочтенные. Пожалуйста подождите...'"));
		Иначе
			Состояние(НСтр("ru = 'Снимается пометка прочтенности. Пожалуйста подождите...'"));
		КонецЕсли;	
	КонецЕсли;
	
	УстановитьПрочтение(Темы, ПоставитьПометкуПрочтения);
	
	Если КоличествоТем > 1 Тогда
		
		Если ПоставитьПометкуПрочтения Тогда
			ТекстСостояния = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Темы помечены как прочтенные (%1)'"),
				КоличествоТем);
		Иначе
			ТекстСостояния = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Сняты пометки прочтенности тем (%1)'"),
				КоличествоТем);
		КонецЕсли;
			
		Состояние(ТекстСостояния);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СписокСообщений

&НаКлиенте
Процедура Написать(Команда)
	
	Если Тема = Неопределено ИЛИ Тема.Пустая() Тогда
		ОткрытьФорму("Справочник.СообщенияОбсуждений.Форма.ФормаЭлемента", 
	 		Новый Структура("Предмет", Предмет));
		Возврат;
	КонецЕсли;

	ОткрытьФорму("Справочник.СообщенияОбсуждений.Форма.ФормаЭлемента", 
		Новый Структура("Тема", Тема),
		ЭтаФорма);
		
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВидОтображения(Команда)
	
	РежимОтображенияСообщенийДеревом = Не РежимОтображенияСообщенийДеревом;
	
	ОбновитьОтображение();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьАвтообновлениеСпискаСообщений(Команда)
	
	АвтообновлениеКлиент.УстановитьПараметрыАвтообновленияСписка(ЭтаФорма, "Список");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбластьЧтенияОтключена(Команда)
	
	ПоложениеОбластиЧтения = "Отключена";
	ОбновитьПоложениеОбластиЧтенияСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбластьЧтенияСнизу(Команда)
	
	ПоложениеОбластиЧтения = "Снизу";
	ОбновитьПоложениеОбластиЧтенияСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбластьЧтенияСправа(Команда)
	
	ПоложениеОбластиЧтения = "Справа";
	ОбновитьПоложениеОбластиЧтенияСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветитьНаСообщение(Команда)
	
	Если Тема = Неопределено ИЛИ Тема.Пустая() Тогда
		ОткрытьФорму("Справочник.СообщенияОбсуждений.Форма.ФормаЭлемента", 
	 		Новый Структура("Предмет", Предмет));
		Возврат;
	КонецЕсли;

	Сообщение = ПолучитьТекущееСообщение(Истина);
	Если Сообщение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.СообщенияОбсуждений.Форма.ФормаЭлемента", 
		Новый Структура("Сообщение", Сообщение),
		ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьТолькоНовыеСообщения(Команда)
	
	Если Не ЗначениеЗаполнено(ОтображаемыеСообщения) 
		Или Не (ОтображаемыеСообщения = НСтр("ru = 'Все'")
		Или ОтображаемыеСообщения = НСтр("ru = 'Прочтенные'")
		Или ОтображаемыеСообщения = НСтр("ru = 'Непрочтенные'")) Тогда
		ОтображаемыеСообщения = НСтр("ru = 'Все'");
	КонецЕсли;
	
	Если ОтображатьТолькоНовыеСообщения Тогда
		ОтображатьТолькоНовыеСообщения = Ложь;
		Элементы.СписокОтображатьТолькоНовыеСообщения.Пометка = Ложь;
		ОтображаемыеСообщения = НСтр("ru = 'Все'"); 	
	Иначе
		ОтображатьТолькоНовыеСообщения = Истина;
		Элементы.СписокОтображатьТолькоНовыеСообщения.Пометка = Истина;
		ОтображаемыеСообщения = НСтр("ru = 'Непрочтенные'");	
	КонецЕсли;
	
	ПараметрыОтбора = Новый Соответствие();
	Параметрыотбора.Вставить("ОтображаемыеСообщения", ОтображаемыеСообщения);
	
	УстановитьОтборСписка(Список, ПараметрыОтбора);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКарточку(Команда)

	Сообщение = ПолучитьТекущееСообщение(Ложь);
	Если Сообщение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", Сообщение);
	
	ОткрытьФорму("Справочник.СообщенияОбсуждений.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьКакПрочтенные(Команда)
	
	Сообщения = ПолучитьВыбранныеСообщения(Истина);
	КоличествоСообщений = Сообщения.Количество();
	Если Сообщения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЧислоПрочтенных = 0;
	Если РежимОтображенияСообщенийДеревом Тогда
		
		ВыделенныеСтроки = Элементы.ДеревоСообщений.ВыделенныеСтроки;
		Для каждого Строка Из ВыделенныеСтроки Цикл
			
			Ссылка = Элементы.ДеревоСообщений.ДанныеСтроки(Строка).Ссылка;
			
			Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.СообщенияОбсуждений") Тогда
				
				Прочтен = Элементы.ДеревоСообщений.ДанныеСтроки(Строка).Прочтен;
				
				Если Прочтен Тогда
					
					ЧислоПрочтенных = ЧислоПрочтенных + 1;
					
				КонецЕсли;	
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
		Для каждого Ссылка Из ВыделенныеСтроки Цикл
			
			Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.СообщенияОбсуждений") Тогда
				
				Прочтен = Элементы.Список.ДанныеСтроки(Ссылка).Прочтен;
				
				Если Прочтен Тогда
					
					ЧислоПрочтенных = ЧислоПрочтенных + 1;
					
				КонецЕсли;	
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ПоставитьПометкуПрочтения = Истина;
	
	Если КоличествоСообщений = ЧислоПрочтенных Тогда
		ПоставитьПометкуПрочтения = Ложь;
	Иначе
		ПоставитьПометкуПрочтения = Истина;
	КонецЕсли;	
	
	Если КоличествоСообщений > 1 Тогда
		Если ПоставитьПометкуПрочтения Тогда
			Состояние(НСтр("ru = 'Сообщения помечаются как прочтенные. Пожалуйста подождите...'"));
		Иначе
			Состояние(НСтр("ru = 'Снимается пометка прочтенности. Пожалуйста подождите...'"));
		КонецЕсли;	
	КонецЕсли;
	
	УстановитьПрочтение(Сообщения, ПоставитьПометкуПрочтения);
	
	Если КоличествоСообщений > 1 Тогда
		
		Если ПоставитьПометкуПрочтения Тогда
			ТекстСостояния = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Сообщения помечены как прочтенные (%1)'"),
				КоличествоСообщений);
		Иначе
			ТекстСостояния = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Сняты пометки прочтенности сообщений (%1)'"),
				КоличествоСообщений);
		КонецЕсли;
			
		Состояние(ТекстСостояния);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОтветыНаСообщение(Команда)
	
	Если Не ПоказаныОтветыНаСообщение Тогда
		
		Если (Элементы.Список.ТекущаяСтрока = Неопределено
			Или ТипЗнч(Элементы.Список.ТекущаяСтрока) 
			<> Тип("СправочникСсылка.СообщенияОбсуждений"))Тогда
			Возврат;
		КонецЕсли;

		ПоказаныОтветыНаСообщение = Истина;
		Элементы.СписокПоказатьОтветыНаСообщение.Пометка = Истина;
		
		ВОтветНа = Элементы.Список.ТекущиеДанные.Ссылка;
		ПараметрыОтбора = Новый Соответствие();
		Параметрыотбора.Вставить("Родитель", ВОтветНа);
		УстановитьОтборСписка(Список, ПараметрыОтбора);
		
	Иначе
		
		ПоказаныОтветыНаСообщение = Ложь;
		Элементы.СписокПоказатьОтветыНаСообщение.Пометка = Ложь;
		
		ВОтветНа = "";
		ПараметрыОтбора = Новый Соответствие();
		Параметрыотбора.Вставить("Родитель", ВОтветНа);
		УстановитьОтборСписка(Список, ПараметрыОтбора);

	КонецЕсли;
	
КонецПроцедуры

#Область ДеревоСообщений

&НаКлиенте
Процедура РазвернутьНовыеСообщения(Команда)
	
	СписокНеразвернутыхСообщений = ПолучитьСписокНеразвернутыхСообщений();
	
	Если ЗначениеЗаполнено(СписокНеразвернутыхСообщений) Тогда
		
		РаботаСОбсуждениямиКлиент.УстановитьРазвернутостьЭлементовДерева(
			Элементы.ДеревоСообщений,
			ДеревоСообщений,
			СписокНеразвернутыхСообщений);
		
		Индекс = -1;
		РаботаСОбсуждениямиКлиентСервер.НайтиСообщениеВДеревеПоСсылке(
			ДеревоСообщений.ПолучитьЭлементы(),
			СписокНеразвернутыхСообщений[0].Значение,
			Индекс);
		Если Индекс > -1 Тогда
			Элементы.ДеревоСообщений.ТекущаяСтрока = Индекс;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьРазвернутьДеревоСообщений(Команда)
	
	СвернутьДерево = Ложь;
	
	Для Каждого ЭлементДерева Из ДеревоСообщений.ПолучитьЭлементы() Цикл
		
		Если Элементы.ДеревоСообщений.Развернут(ЭлементДерева.ПолучитьИдентификатор()) Тогда
			
			СвернутьДерево = Истина;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ЭлементДерева Из ДеревоСообщений.ПолучитьЭлементы() Цикл
		
		Если СвернутьДерево Тогда
			Элементы.ДеревоСообщений.Свернуть(ЭлементДерева.ПолучитьИдентификатор());
		Иначе
			Элементы.ДеревоСообщений.Развернуть(ЭлементДерева.ПолучитьИдентификатор(), Истина);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьРазвернутьВеткуСообщений(Команда)
	
	РазворачиваемаяСтрока = Число(Элементы.ДеревоСообщений.ТекущаяСтрока);
	
	Если Элементы.ДеревоСообщений.Развернут(РазворачиваемаяСтрока) Тогда
		
		Элементы.ДеревоСообщений.Свернуть(РазворачиваемаяСтрока);
		
	Иначе
		
		Элементы.ДеревоСообщений.Развернуть(РазворачиваемаяСтрока, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбластьЧтения

&НаКлиенте
Процедура ОбластьЧтенияВыбратьШрифт(Команда)
	
	ДиалогВыбораШрифтаОбластиЧтения = Новый ДиалогВыбораШрифта;
	ДиалогВыбораШрифтаОбластиЧтения.Шрифт = ШрифтОбластиЧтения;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбластьЧтенияВыбратьШрифтЗавершение", ЭтотОбъект);
	
	ДиалогВыбораШрифтаОбластиЧтения.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбластьЧтенияВыбратьШрифтЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ШрифтОбластиЧтения = Результат;
	УстановитьШрифтОбластиЧтения(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Проголосовать(Команда)
	
	Если Не ЗначениеЗаполнено(ТекущееСообщение) Тогда
		Возврат;
	КонецЕсли;
	
	ПроголосоватьСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура Прокомментировать(Команда)
	
	ОткрытьФорму("Справочник.СообщенияОбсуждений.Форма.ФормаЭлемента", 
		Новый Структура("Сообщение, ТекстНовогоСообщения",
			ТекущееСообщение,
			ГолосПользователя));
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура Обновить(Команда)
	
	Если РежимОтображенияСообщенийДеревом Тогда
		ОбновитьДеревоСообщений();
	Иначе
		ОбновитьСервер();
	КонецЕсли;
	УстановитьДоступностьКоманд();
	УстановитьСтраницуПредпросмотра();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПомеченныеНаУдаление(Команда)
	
	ПоказатьПомеченныеНаУдаление = Не ПоказатьПомеченныеНаУдаление;
	
	Обновить(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура Подписаться(Команда)
	
	Если ЗначениеЗаполнено(Тема) Тогда
		ПараметрыФормы = Новый Структура("ОбъектПодписки", Тема);
		ОткрытьФорму("ОбщаяФорма.ПодпискаНаУведомленияПоОбъекту", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Файлы

&НаСервере
Процедура ВложениеСообщенияПометитьНаУдалениеСервер(ФайлСсылка)
	
	ФайлОбъект = ФайлСсылка.ПолучитьОбъект();
	ЗаблокироватьДанныеДляРедактирования(ФайлСсылка);
	ФайлОбъект.УстановитьПометкуУдаления(Не ФайлОбъект.ПометкаУдаления);
	ОбновитьФайлыСообщения();
	
КонецПроцедуры

&НаСервере
Процедура ТекущаяТемаВложенияПометитьНаУдалениеСервер(ФайлСсылка)
	
	ФайлОбъект = ФайлСсылка.ПолучитьОбъект();
	ЗаблокироватьДанныеДляРедактирования(ФайлСсылка);
	ФайлОбъект.УстановитьПометкуУдаления(Не ФайлОбъект.ПометкаУдаления);
	ОбновитьФайлыТемы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФайлыСообщенияКлиент()
	
	Если РежимОтображенияСообщенийДеревом Тогда
		
		ТекущиеДанные = Элементы.ДеревоСообщений.ТекущиеДанные;
		
	Иначе
		
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		
	КонецЕсли;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Файлы И ОбластьЧтенияВключена Тогда
		ОбновитьФайлыСообщения();
	Иначе
		ВложенияСообщения.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьФайлыСообщения()
	
	Если Элементы.СтраницыПросмотр.ТекущаяСтраница = Элементы.СтраницаПросмотрСФайламиИГолосованием Тогда
		Элемент = Элементы.ВложенияСообщенияСГолосованием;
	Иначе
		Элемент = Элементы.ВложенияСообщения;
	КонецЕсли;
	
	// Сохранение текущей строки
	ТекПозиция = Неопределено;
	Если Элемент.ТекущаяСтрока <> Неопределено Тогда
		ТекДанные = ВложенияСообщения.НайтиПоИдентификатору(Элемент.ТекущаяСтрока);
		Если ТекДанные <> Неопределено Тогда
			Если ТекДанные.Свойство("Ссылка")
				И ЗначениеЗаполнено(ТекДанные.Ссылка) Тогда
				ТекПозиция = Новый Структура("Ссылка", ТекДанные.Ссылка);
			ИначеЕсли ТекДанные.Свойство("Представление")
				И ТекДанные.Свойство("Размер") Тогда
				ТекПозиция = Новый Структура("Представление, Размер", ТекДанные.Представление, ТекДанные.Размер);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Заполнение списка файлов
	Если ЗначениеЗаполнено(ТекущееСообщение) Тогда
		ЗаполнитьВложения(ВложенияСообщения, ТекущееСообщение);
	КонецЕсли;
	
	// Восстановление текущей строки
	Если ЗначениеЗаполнено(ТекПозиция) Тогда
		Если ТипЗнч(ТекПозиция) = Тип("Структура") Тогда
			Строки = ВложенияСообщения.НайтиСтроки(ТекПозиция);
			Если Строки.Количество() > 0 Тогда
				Элемент.ТекущаяСтрока = Строки[0].ПолучитьИдентификатор();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтраницуПредпросмотра()
	
	Если РежимОтображенияСообщенийДеревом Тогда
		
		ТекущиеДанные = Элементы.ДеревоСообщений.ТекущиеДанные;
		
	Иначе
		
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		
	КонецЕсли;
	
	Если ТекущиеДанные = Неопределено Тогда
		Элементы.СтраницыПросмотр.ТекущаяСтраница = Элементы.СтраницаПросмотр;
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Файлы И ТекущиеДанные.ДобавленоГолосование Тогда
		Элементы.СтраницыПросмотр.ТекущаяСтраница = Элементы.СтраницаПросмотрСФайламиИГолосованием;
	ИначеЕсли ТекущиеДанные.Файлы Тогда
		Элементы.СтраницыПросмотр.ТекущаяСтраница = Элементы.СтраницаПросмотрСФайлами;
	ИначеЕсли ТекущиеДанные.ДобавленоГолосование Тогда
		Элементы.СтраницыПросмотр.ТекущаяСтраница = Элементы.СтраницаПросмотрСГолосованием;
	Иначе
		Элементы.СтраницыПросмотр.ТекущаяСтраница = Элементы.СтраницаПросмотр;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьКомандРаботыСВложением()
	
	Если Элементы.СтраницыПросмотр.ТекущаяСтраница = Элементы.СтраницаПросмотрСФайлами Тогда
		Элемент = Элементы.ВложенияСообщения;
	ИначеЕсли Элементы.СтраницыПросмотр.ТекущаяСтраница = Элементы.СтраницаПросмотрСФайламиИГолосованием Тогда
		Элемент = Элементы.ВложенияСообщенияСГолосованием;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		
		Элементы.ПросмотретьВложениеСообщения.Доступность = Ложь;
		Элементы.РедактироватьВложениеСообщения.Доступность = Ложь;
		Элементы.ЗакончитьРедактированиеВложенияСообщения.Доступность = Ложь;
		Элементы.СохранитьВложениеСообщенияКак.Доступность = Ложь;
		
		Элементы.ПросмотретьВложениеСообщенияСГолосованием.Доступность = Ложь;
		Элементы.РедактироватьВложениеСообщенияСГолосованием.Доступность = Ложь;
		Элементы.ЗакончитьРедактированиеВложенияСообщенияСГолосованием.Доступность = Ложь;
		Элементы.СохранитьВложениеСообщенияКакСГолосованием.Доступность = Ложь;
		
	Иначе
		ТекущиеДанные = Элемент.ТекущиеДанные;
		
		Элементы.ПросмотретьВложениеСообщения.Доступность = Истина;
		Элементы.РедактироватьВложениеСообщения.Доступность = Истина;
		Элементы.ЗакончитьРедактированиеВложенияСообщения.Доступность = ТекущиеДанные.РедактируетТекущийПользователь;
		Элементы.СохранитьВложениеСообщенияКак.Доступность = Истина;
		
		Элементы.ПросмотретьВложениеСообщенияСГолосованием.Доступность = Истина;
		Элементы.РедактироватьВложениеСообщенияСГолосованием.Доступность = Истина;
		Элементы.ЗакончитьРедактированиеВложенияСообщенияСГолосованием.Доступность = ТекущиеДанные.РедактируетТекущийПользователь;
		Элементы.СохранитьВложениеСообщенияКак.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВложения(Вложения, Сообщение)
	
	ФайлыСообщения = РаботаСОбсуждениями.ПолучитьФайлыСообщения(
		Сообщение, // Сообщение
		Истина, // ФормироватьРазмерПредставление
		Ложь); // ВключатьПомеченныеНаУдаление
	
	Вложения.Очистить();
	Для каждого ФайлыСообщенияСтрока Из ФайлыСообщения Цикл
		ВложенияСтрока = Вложения.Добавить();
		ЗаполнитьЗначенияСвойств(ВложенияСтрока, ФайлыСообщенияСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьФайлыТемы()
	
	// Сохранение текущей строки
	ТекПозиция = Неопределено;
	Если Элементы.ТекущаяТемаВложения.ТекущаяСтрока <> Неопределено Тогда
		ТекДанные = ТекущаяТемаВложения.НайтиПоИдентификатору(Элементы.ТекущаяТемаВложения.ТекущаяСтрока);
		Если ТекДанные <> Неопределено Тогда
			Если ТекДанные.Свойство("Ссылка")
				И ЗначениеЗаполнено(ТекДанные.Ссылка) Тогда
				ТекПозиция = Новый Структура("Ссылка", ТекДанные.Ссылка);
			ИначеЕсли ТекДанные.Свойство("Представление")
				И ТекДанные.Свойство("Размер") Тогда
				ТекПозиция = Новый Структура("Представление, Размер", ТекДанные.Представление, ТекДанные.Размер);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Заполнение списка файлов
	Если ЗначениеЗаполнено(ТекущаяТема) Тогда
		ЗаполнитьВложенияТемы(ТекущаяТемаВложения, ТекущаяТема);
	КонецЕсли;
	
	// Восстановление текущей строки
	Если ЗначениеЗаполнено(ТекПозиция) Тогда
		Если ТипЗнч(ТекПозиция) = Тип("Структура") Тогда
			Строки = ТекущаяТемаВложения.НайтиСтроки(ТекПозиция);
			Если Строки.Количество() > 0 Тогда
				Элементы.ТекущаяТемаВложения.ТекущаяСтрока = Строки[0].ПолучитьИдентификатор();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтраницуПредпросмотраТемы()
	
	ТекущиеДанные = Элементы.СписокТем.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Элементы.СтраницыПросмотрТем.ТекущаяСтраница = Элементы.СтраницаПросмотрТем;
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущаяТемаВложения) Тогда
		Элементы.СтраницыПросмотрТем.ТекущаяСтраница = Элементы.СтраницаПросмотрТемСФайлами;
	Иначе
		Элементы.СтраницыПросмотрТем.ТекущаяСтраница = Элементы.СтраницаПросмотрТем;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьКомандРаботыСВложениемТемы()
	Элемент = Элементы.ТекущаяТемаВложения;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		Элементы.ПросмотретьВложениеТемы.Доступность = Ложь;
		Элементы.РедактироватьВложениеТемы.Доступность = Ложь;
		Элементы.ЗакончитьРедактированиеВложенияТемы.Доступность = Ложь;
		Элементы.СохранитьВложениеТемыКак.Доступность = Ложь;
		
	Иначе
		
		Элементы.ПросмотретьВложениеТемы.Доступность = Истина;
		Элементы.РедактироватьВложениеТемы.Доступность = Истина;
		Элементы.ЗакончитьРедактированиеВложенияТемы.Доступность = ТекущиеДанные.РедактируетТекущийПользователь;
		Элементы.СохранитьВложениеТемыКак.Доступность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВложенияТемы(Вложения, ТемаДляПредпросмотра)
	
	ПервоеСообщениеТемы = РаботаСОбсуждениями.НайтиПервоеСообщениеТемы(ТемаДляПредпросмотра);
	
	ФайлыСообщения = РаботаСОбсуждениями.ПолучитьФайлыСообщения(
		ПервоеСообщениеТемы, // Сообщение
		Истина, // ФормироватьРазмерПредставление
		Ложь); // ВключатьПомеченныеНаУдаление
	
	Вложения.Очистить();
	Для каждого ФайлыСообщенияСтрока Из ФайлыСообщения Цикл
		ВложенияСтрока = Вложения.Добавить();
		ЗаполнитьЗначенияСвойств(ВложенияСтрока, ФайлыСообщенияСтрока);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ОбновитьСписки()
	
	Элементы.Список.Обновить();
	Элементы.СписокТем.Обновить();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокНеразвернутыхСообщений()
	
	НепрочтенныеСообщения = Новый СписокЗначений();
	
	ДеревоСообщенийЗначение = РеквизитФормыВЗначение("ДеревоСообщений");
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Прочтен", Ложь);
	НепрочтенныеСтроки = ДеревоСообщенийЗначение.Строки.НайтиСтроки(ПараметрыОтбора, Истина);
	
	Для Каждого НепрочтеннаяСтрока Из НепрочтенныеСтроки Цикл
		
		НепрочтенныеСообщения.Добавить(НепрочтеннаяСтрока.Ссылка);
		
		Родитель = НепрочтеннаяСтрока.Ссылка.Родитель;
		Пока ЗначениеЗаполнено(Родитель) Цикл
			
			НепрочтенныеСообщения.Добавить(Родитель);
			Родитель = Родитель.Родитель;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат НепрочтенныеСообщения;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСписка(Список, ПараметрыОтбора)
	
	// Ответы на сообщение
	Родитель = ПараметрыОтбора.Получить("Родитель");
	Если Родитель <> Неопределено Тогда
		ЭлементыОтбора = Список.Отбор.Элементы;
		
		ЭлементОтбораДанных = Неопределено;
		Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
			Если ЭлементОтбора.Представление = "ОтборРодителя" Тогда
				ЭлементОтбораДанных = ЭлементОтбора;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ЭлементОтбораДанных = Неопределено Тогда
			ГруппаОтборРодителя = ЭлементыОтбора.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаОтборРодителя.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли; 
			ГруппаОтборРодителя.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный; 
			ГруппаОтборРодителя.Использование = Истина;
			ГруппаОтборРодителя.Представление = "ОтборРодителя";
		Иначе
			ГруппаОтборРодителя = ЭлементОтбораДанных;
			ГруппаОтборРодителя.Элементы.Очистить();
			ГруппаОтборРодителя.Использование = Истина;
		КонецЕсли;	
					
		Если ЗначениеЗаполнено(Родитель) Тогда 
			ЭлементОтбораДанных = ГруппаОтборРодителя.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбораДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
			ЭлементОтбораДанных.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбораДанных.ПравоеЗначение = Родитель;
			ЭлементОтбораДанных.Использование = Истина;

			ЭлементОтбораДанных = ГруппаОтборРодителя.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбораДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Родитель");
			ЭлементОтбораДанных.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии;
			ЭлементОтбораДанных.ПравоеЗначение = Родитель;
			ЭлементОтбораДанных.Использование = Истина;
		КонецЕсли;						
		
		Если ГруппаОтборРодителя.Элементы.Количество() = 0 Тогда 
			ЭлементыОтбора.Удалить(ГруппаОтборРодителя);
		КонецЕсли;
	КонецЕсли;
	
	// Прочтение тем
	ОтображаемыеТемы = ПараметрыОтбора.Получить("ОтображаемыеТемы");
	Если ОтображаемыеТемы <> Неопределено Тогда 
		Если Не ЗначениеЗаполнено(ОтображаемыеТемы) Тогда
			ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор,
				"Прочтен");
		Иначе
			Если ОтображаемыеТемы = НСтр("ru = 'Прочтенные'") Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,
					"Прочтен",
					Истина);
			ИначеЕсли ОтображаемыеТемы = НСтр("ru = 'Непрочтенные'") Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,
					"Прочтен",
					Ложь);
			Иначе 
				ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор,
					"Прочтен");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
	// Прочтение сообщений
	ОтображаемыеСообщения = ПараметрыОтбора.Получить("ОтображаемыеСообщения");
	Если ОтображаемыеСообщения <> Неопределено Тогда 
		Если Не ЗначениеЗаполнено(ОтображаемыеСообщения) Тогда
			ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор,
				"Прочтен");
		Иначе
			Если ОтображаемыеСообщения = НСтр("ru = 'Прочтенные'") Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,
					"Прочтен",
					Истина);
			ИначеЕсли ОтображаемыеСообщения = НСтр("ru = 'Непрочтенные'") Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,
					"Прочтен",
					Ложь);
			Иначе 
				ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор,
					"Прочтен");				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Пометка удаления
	ПоказатьПомеченныеНаУдалениеТемы = ПараметрыОтбора.Получить("ПоказатьПомеченныеНаУдалениеТемы");
	Если ПоказатьПомеченныеНаУдалениеТемы <> Неопределено Тогда 
		
		ЭлементыОтбора = Список.Отбор.Элементы;
		
		ЭлементОтбораДанных = Неопределено;
		Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
			Если ЭлементОтбора.Представление = "ОтборПометкиУдаления" Тогда
				ЭлементОтбораДанных = ЭлементОтбора;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ЭлементОтбораДанных = Неопределено Тогда
			ГруппаОтборПометкиУдаления = ЭлементыОтбора.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаОтборПометкиУдаления.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли; 
			ГруппаОтборПометкиУдаления.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный; 
			ГруппаОтборПометкиУдаления.Использование = Истина;
			ГруппаОтборПометкиУдаления.Представление = "ОтборПометкиУдаления";
		Иначе
			ГруппаОтборПометкиУдаления = ЭлементОтбораДанных;
			ГруппаОтборПометкиУдаления.Элементы.Очистить();
			ГруппаОтборПометкиУдаления.Использование = Истина;
		КонецЕсли;
		
		ГруппаОтборПометкиУдаленияИКоличестваСообщений = ГруппаОтборПометкиУдаления.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтборПометкиУдаленияИКоличестваСообщений.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ; 
		ГруппаОтборПометкиУдаленияИКоличестваСообщений.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный; 
		ГруппаОтборПометкиУдаленияИКоличестваСообщений.Использование = Истина;
		ГруппаОтборПометкиУдаленияИКоличестваСообщений.Представление = "ОтборПометкиУдаленияИКоличестваСообщений";
		
		ЭлементОтбораДанных = ГруппаОтборПометкиУдаленияИКоличестваСообщений.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбораДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
		ЭлементОтбораДанных.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбораДанных.ПравоеЗначение = Ложь;
		ЭлементОтбораДанных.Использование = Истина;
		
		ЭлементОтбораДанных = ГруппаОтборПометкиУдаленияИКоличестваСообщений.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбораДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КоличествоСообщений");
		ЭлементОтбораДанных.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
		ЭлементОтбораДанных.ПравоеЗначение = 1;
		ЭлементОтбораДанных.Использование = Истина;
		
		ЭлементОтбораДанных = ГруппаОтборПометкиУдаления.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбораДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
		ЭлементОтбораДанных.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбораДанных.ПравоеЗначение = Истина;
		ЭлементОтбораДанных.Использование = ПоказатьПомеченныеНаУдалениеТемы;
		
	КонецЕсли;
	
	ПоказатьПомеченныеНаУдалениеСообщения = ПараметрыОтбора.Получить("ПоказатьПомеченныеНаУдалениеСообщения");
	Если ПоказатьПомеченныеНаУдалениеСообщения <> Неопределено Тогда 
		
		Если ПоказатьПомеченныеНаУдалениеСообщения Тогда
			ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор,
				"ПометкаУдаления");
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,
				"ПометкаУдаления",
				Ложь);
		КонецЕсли;
		
	КонецЕсли;
	
	// РазделыОбсуждений 
	РазделыОбсуждений = ПараметрыОтбора.Получить("РазделыОбсуждений");
	Если РазделыОбсуждений <> Неопределено Тогда 
		
		ВидПросмотра = ПараметрыОтбора.Получить("ВидПросмотра");
		Если ВидПросмотра <> Неопределено Тогда
			Если Не ЗначениеЗаполнено(ВидПросмотра) Тогда
				ИспользоватьОтборПоРазделам = Истина;	
			Иначе	
				Если ВидПросмотра = НСтр("ru = 'Списком'") Тогда
					ИспользоватьОтборПоРазделам = Истина;	
				Иначе
					ИспользоватьОтборПоРазделам = Ложь;
				КонецЕсли;	
			КонецЕсли;
		Иначе
			ИспользоватьОтборПоРазделам = Истина;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(РазделыОбсуждений) 
			Или Не ИспользоватьОтборПоРазделам Тогда
			
			ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор,
				"Родитель");
		Иначе			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,
				"Родитель",
				РазделыОбсуждений,
				ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии);
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОжиданияПрочтения()
	
	Сообщение = ПолучитьТекущееСообщение(Ложь);
	Если Сообщение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Сообщение = ТекущееСообщение Тогда
		Возврат;
	КонецЕсли;
	
	ПредыдущееСообщение = ТекущееСообщение;
	ПредыдущееСообщениеПрочтено = ТекущееСообщениеПрочтено;
	ТекущееСообщение = Сообщение;
	ТекущиеДанныеСообщения = ПолучитьТекущиеДанные();
	
	Если Не ПредыдущееСообщениеПрочтено 
		И ИспользоватьАвтоматическоеПрочтение 
		И ОбластьЧтенияВключена Тогда
		
		УстановитьПрочтение(ПредыдущееСообщение);
		
	КонецЕсли;
	
	Если ТекущиеДанныеСообщения <> Неопределено Тогда
		
		Если ТекущиеДанныеСообщения.Свойство("ТекстСообщения")
			И ТекущиеДанныеСообщения.Свойство("Автор")
			И ТекущиеДанныеСообщения.Свойство("ДатаСообщения") Тогда
			
			ТекущееСообщениеТекст =
				РаботаСОбсуждениямиКлиентСервер.СформироватьТекстовоеПредставлениеСообщения(
					ТекущиеДанныеСообщения.ТекстСообщения,
					ТекущиеДанныеСообщения.Автор,
					ТекущиеДанныеСообщения.ДатаСообщения);
			ОбработатьФормированиеПредпросмотраСообщения();
			
		Иначе
			ОчиститьТекущееСообщение();
		КонецЕсли;
		
		Если ТекущиеДанныеСообщения.Свойство("Прочтен") Тогда
			ТекущееСообщениеПрочтено = ТекущиеДанныеСообщения.Прочтен;
		Иначе
			ТекущееСообщениеПрочтено = Ложь;	
		КонецЕсли;
		
	Иначе
		ОчиститьТекущееСообщение();
		ТекущееСообщениеПрочтено = Ложь;
	КонецЕсли;
	
	УстановитьСтраницуПредпросмотра();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьФормированиеПредпросмотраСообщения()
	
	Если ОбластьЧтенияВключена Тогда
		
		Если РежимОтображенияСообщенийДеревом Тогда
			
			ТекущиеДанные = Элементы.ДеревоСообщений.ТекущиеДанные;
			
		Иначе
			
			ТекущиеДанные = Элементы.Список.ТекущиеДанные;
			
		КонецЕсли;
		
		Если ТекущиеДанные<> Неопределено Тогда
			
			Если ТекущиеДанные.Файлы ИЛИ ТекущиеДанные.ДобавленоГолосование Тогда
				
				ОбработатьФормированиеПредпросмотраСообщенияСервер(ТекущиеДанные.ДобавленоГолосование, ТекущиеДанные.Файлы);
				
			КонецЕсли;
			
		Иначе
			
			ВложенияСообщения.Очистить();
			ВопросГолосования = "";
			Голосование = 0;
			ВсегоГолосов = "";
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьФормированиеПредпросмотраСообщенияСервер(ДобавленоГолосование, Файлы)
	
	Если ДобавленоГолосование И ОбластьЧтенияВключена Тогда
		ОбновитьГолосованиеСервер();
	Иначе
		ВопросГолосования = "";
		Голосование = 0;
		ВсегоГолосов = "";
	КонецЕсли;
	
	Если Файлы И ОбластьЧтенияВключена Тогда
		ОбновитьФайлыСообщения();
	Иначе
		ВложенияСообщения.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОжиданияПрочтенияТемы()
	
	ТемаВСписке = ПолучитьТекущуюТему(Ложь);
	
	Если ТемаВСписке = ТекущаяТема Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяТема = ТемаВСписке;
	
	ОбработатьФормированиеПредпросмотраТемы(ТемаВСписке);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьФормированиеПредпросмотраТемы(ТемаДляПредпросмотра = Неопределено)
	
	Если ОбластьЧтенияТемВключена Тогда
		
		Если ЗначениеЗаполнено(ТемаДляПредпросмотра) Тогда
			
			РезультатОбработки = ОбработатьФормированиеПредпросмотраТемыСервер(
				ТемаДляПредпросмотра,
				ИспользоватьАвтоматическоеПрочтение,
				ОбластьЧтенияТемВключена);
			
			ТекущаяТемаТекст = РезультатОбработки.ТекстовоеПредставлениеТемы;
			
			// Сохранение текущей строки
			ТекПозиция = Неопределено;
			Если Элементы.ТекущаяТемаВложения.ТекущаяСтрока <> Неопределено Тогда
				ТекДанные = ТекущаяТемаВложения.НайтиПоИдентификатору(Элементы.ТекущаяТемаВложения.ТекущаяСтрока);
				Если ТекДанные <> Неопределено Тогда
					Если ТекДанные.Свойство("Ссылка")
						И ЗначениеЗаполнено(ТекДанные.Ссылка) Тогда
						ТекПозиция = Новый Структура("Ссылка", ТекДанные.Ссылка);
					ИначеЕсли ТекДанные.Свойство("Представление")
						И ТекДанные.Свойство("Размер") Тогда
						ТекПозиция = Новый Структура("Представление, Размер", ТекДанные.Представление, ТекДанные.Размер);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			ТекущаяТемаВложения.Очистить();
			Для каждого Вложение Из РезультатОбработки.Вложения Цикл
				ЗаполнитьЗначенияСвойств(ТекущаяТемаВложения.Добавить(), Вложение);
			КонецЦикла;
			
			// Восстановление текущей строки
			Если ЗначениеЗаполнено(ТекПозиция) Тогда
				Если ТипЗнч(ТекПозиция) = Тип("Структура") Тогда
					Строки = ТекущаяТемаВложения.НайтиСтроки(ТекПозиция);
					Если Строки.Количество() > 0 Тогда
						Элементы.ТекущаяТемаВложения.ТекущаяСтрока = Строки[0].ПолучитьИдентификатор();
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			РаботаСПрочтениямиКлиент.ОповеститьОПрочтении(РезультатОбработки.ПервоеСообщениеТемы, РезультатОбработки.ОповеститьОПрочтении);
			
		Иначе
			
			ТекущаяТемаТекст = "";
			ТекущаяТемаВложения.Очистить();
			
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьСтраницуПредпросмотраТемы();
	УстановитьДоступностьКомандРаботыСВложениемТемы();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбработатьФормированиеПредпросмотраТемыСервер(
	ТемаДляПредпросмотра,
	ИспользоватьАвтоматическоеПрочтение,
	ОбластьЧтенияТемВключена)
	
	Результат = Новый Структура;
	
	ПервоеСообщениеТемы = РаботаСОбсуждениями.НайтиПервоеСообщениеТемы(ТемаДляПредпросмотра);
	Результат.Вставить("ПервоеСообщениеТемы", ПервоеСообщениеТемы);
	
	ТекстовоеПредставлениеТемы =
		РаботаСОбсуждениями.СформироватьТекстовоеПредставлениеТемы(ТемаДляПредпросмотра, ПервоеСообщениеТемы);
	Результат.Вставить("ТекстовоеПредставлениеТемы", ТекстовоеПредставлениеТемы);
	
	Результат.Вставить("ОповеститьОПрочтении", Ложь);
	Если ИспользоватьАвтоматическоеПрочтение
		И ОбластьЧтенияТемВключена Тогда
		
		Результат.ОповеститьОПрочтении = РаботаСПрочтениями.УстановитьСвойствоПрочтен(ПервоеСообщениеТемы);
		
	КонецЕсли;
	
	Вложения = Новый Массив;
	
	ФайлыПервогоСообщения = РаботаСОбсуждениями.ПолучитьФайлыСообщения(
		ПервоеСообщениеТемы, // Сообщение
		Истина, // ФормироватьРазмерПредставление
		Ложь); // ВключатьПомеченныеНаУдаление
		
	Для каждого ФайлыПервогоСообщенияСтрока Из ФайлыПервогоСообщения Цикл
		
		Вложение = Новый Структура(
			"ИмяФайла,
			|ИндексКартинки,
			|ПометкаУдаления,
			|Представление,
			|Размер,
			|РазмерПредставление,
			|Редактирует,
			|РедактируетТекущийПользователь,
			|Ссылка");
		
		ЗаполнитьЗначенияСвойств(Вложение, ФайлыПервогоСообщенияСтрока);
		Вложения.Добавить(Вложение);
		
	КонецЦикла;
	
	Результат.Вставить("Вложения", Вложения);
	
	Результат.Вставить("УведомитьОПрочтении", Ложь);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПриЗакрытииНаСервере()
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(ЭтаФорма.ИмяФормы, "РежимОтображенияСообщенийДеревом", РежимОтображенияСообщенийДеревом);
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(ЭтаФорма.ИмяФормы, "ПоказатьПомеченныеНаУдаление", ПоказатьПомеченныеНаУдаление);
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(ЭтаФорма.ИмяФормы, "ПоложениеОбластиЧтения", ПоложениеОбластиЧтения);
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(ЭтаФорма.ИмяФормы, "ПоложениеОбластиЧтенияТем", ПоложениеОбластиЧтенияТем);
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(ЭтаФорма.ИмяФормы, "ТекущийРаздел", Элементы.Дерево.ТекущаяСтрока);
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(ЭтаФорма.ИмяФормы, "ТекущаяТема", Элементы.СписокТем.ТекущаяСтрока);
	
	Если ЗначениеЗаполнено(Тема) Тогда
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(Тема.УникальныйИдентификатор(), "ТекущееСообщение", ТекущееСообщение);	
	КонецЕсли;
	
	Если Не ТекущееСообщениеПрочтено 
		И ИспользоватьАвтоматическоеПрочтение 
		И ОбластьЧтенияВключена Тогда 
		УстановитьПрочтениеСервер(ТекущееСообщение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьВыбранныеСообщения(ВыводитьПредупреждение = Ложь)
	
	Результат = Новый Массив;
	
	Если РежимОтображенияСообщенийДеревом Тогда
		ВыделенныеСтроки = Элементы.ДеревоСообщений.ВыделенныеСтроки;
	Иначе
		ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	КонецЕсли;

	Для каждого Строка Из ВыделенныеСтроки Цикл
		
		Если РежимОтображенияСообщенийДеревом Тогда
			ДанныеСтроки = Элементы.ДеревоСообщений.ДанныеСтроки(Строка);
			Ссылка = ДанныеСтроки.Ссылка;
		Иначе
			Ссылка = Строка;
		КонецЕсли;
		
		Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.СообщенияОбсуждений") Тогда
			Результат.Добавить(Ссылка);
		КонецЕсли;
	КонецЦикла;
		
	Сообщение = ПолучитьТекущееСообщение(Ложь);
	
	Если ЗначениеЗаполнено(Сообщение)
		И Результат.Найти(Сообщение) = Неопределено Тогда
		Результат.Добавить(Сообщение);
	КонецЕсли;
	
	Если Результат.Количество() = 0 И ВыводитьПредупреждение Тогда
		ТекстПредупреждения = НСтр("ru = 'Не выбрано сообщение.'");
		ПоказатьПредупреждение(, ТекстПредупреждения);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПолучитьТекущееСообщение(ВыводитьПредупреждение = Ложь)
	
	ТекущаяСтрока = ПолучитьТекущуюСтроку();
	Если ТекущаяСтрока = Неопределено Тогда
		Если ВыводитьПредупреждение Тогда
			ТекстПредупреждения = НСтр("ru = 'Не выбрано сообщение.'");
			ПоказатьПредупреждение(, ТекстПредупреждения);
		КонецЕсли;
		Возврат Неопределено;
	КонецЕсли;
	
	ТекущиеДанныеСообщения = ПолучитьТекущиеДанные();
	Если ТекущиеДанныеСообщения = Неопределено Тогда
		Если ВыводитьПредупреждение Тогда
			ТекстПредупреждения = НСтр("ru = 'Не выбрано сообщение.'");
			ПоказатьПредупреждение(, ТекстПредупреждения);
		КонецЕсли;
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТекущиеДанныеСообщения <> Неопределено И Не ТекущиеДанныеСообщения.Свойство("Ссылка") Тогда
		Если ВыводитьПредупреждение Тогда
			ТекстПредупреждения = НСтр("ru = 'Не выбрано сообщение.'");
			ПоказатьПредупреждение(, ТекстПредупреждения);
		КонецЕсли;
		Возврат Неопределено;
	КонецЕсли;
	
	Сообщение = ТекущиеДанныеСообщения.Ссылка;
	Если Не ТипЗнч(Сообщение) = Тип("СправочникСсылка.СообщенияОбсуждений") Тогда
		Если ВыводитьПредупреждение Тогда
			ТекстПредупреждения = НСтр("ru = 'Не выбрано сообщение.'");
			ПоказатьПредупреждение(, ТекстПредупреждения);
		КонецЕсли;
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Сообщение;
	
КонецФункции

&НаКлиенте
Процедура УстановитьПрочтение(ОбъектПрочтения, Прочтен = Истина)
	
	ПрочтениеУстановлено = УстановитьПрочтениеСервер(ОбъектПрочтения, Прочтен);
	РаботаСПрочтениямиКлиент.ОповеститьОПрочтении(ОбъектПрочтения, ПрочтениеУстановлено);
	
КонецПроцедуры

&НаСервере 
Функция УстановитьПрочтениеСервер(ОбъектПрочтения, Прочтен = Истина)
	
	ПрочтениеУстановлено = РаботаСПрочтениями.УстановитьСвойствоПрочтен(ОбъектПрочтения, Прочтен);
	
	// Не устанавливать прочтенность сообщения автоматически в случае ручной установки прочтения.
	ТекущееСообщениеПрочтено = Истина;
	
	Возврат ПрочтениеУстановлено; 

КонецФункции

&НаСервере
Процедура ОбновитьПоложениеОбластиЧтенияСервер()
	
	Если ПоложениеОбластиЧтения = "Снизу" Тогда
		
		Элементы.СтраницаПросмотрСФайлами.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		Элементы.СтраницаПросмотрСГолосованием.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		Элементы.СтраницаПросмотрСФайламиИГолосованием.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		Элементы.ГруппаСписок.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		Элементы.СтраницыПросмотр.Видимость = Истина;
		Элементы.СписокОбластьЧтенияСнизу.Пометка = Истина;
		Элементы.СписокОбластьЧтенияСправа.Пометка = Ложь;
		Элементы.СписокОбластьЧтенияОтключена.Пометка = Ложь;
		Элементы.ДеревоСообщенийОбластьЧтенияСнизу.Пометка = Истина;
		Элементы.ДеревоСообщенийОбластьЧтенияСправа.Пометка = Ложь;
		Элементы.ДеревоСообщенийОбластьЧтенияОтключена.Пометка = Ложь;
		ОбластьЧтенияВключена = Истина;
		
		ОбновитьФайлыСообщения();
		ОбновитьГолосованиеСервер();
		
	ИначеЕсли ПоложениеОбластиЧтения = "Справа" Тогда
		
		Элементы.СтраницаПросмотрСФайлами.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		Элементы.СтраницаПросмотрСГолосованием.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		Элементы.СтраницаПросмотрСФайламиИГолосованием.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		Элементы.ГруппаСписок.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		Элементы.СтраницыПросмотр.Видимость = Истина;
		Элементы.СписокОбластьЧтенияСнизу.Пометка = Ложь;
		Элементы.СписокОбластьЧтенияСправа.Пометка = Истина;
		Элементы.СписокОбластьЧтенияОтключена.Пометка = Ложь;
		Элементы.ДеревоСообщенийОбластьЧтенияСнизу.Пометка = Ложь;
		Элементы.ДеревоСообщенийОбластьЧтенияСправа.Пометка = Истина;
		Элементы.ДеревоСообщенийОбластьЧтенияОтключена.Пометка = Ложь;
		ОбластьЧтенияВключена = Истина;
		
		ОбновитьФайлыСообщения();
		ОбновитьГолосованиеСервер();
		
	ИначеЕсли ПоложениеОбластиЧтения = "Отключена" Тогда
		
		Элементы.СтраницыПросмотр.Видимость = Ложь;
		Элементы.СписокОбластьЧтенияСнизу.Пометка = Ложь;
		Элементы.СписокОбластьЧтенияСправа.Пометка = Ложь;
		Элементы.СписокОбластьЧтенияОтключена.Пометка = Истина;
		Элементы.ДеревоСообщенийОбластьЧтенияСнизу.Пометка = Ложь;
		Элементы.ДеревоСообщенийОбластьЧтенияСправа.Пометка = Ложь;
		Элементы.ДеревоСообщенийОбластьЧтенияОтключена.Пометка = Истина;
		ОбластьЧтенияВключена = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПоложениеОбластиЧтенияТемСервер()
	
	Если ПоложениеОбластиЧтенияТем = "Снизу" Тогда
		
		Элементы.ТекущаяТемаВложения.Видимость = Истина;
		Элементы.ТекущаяТемаВложения.РастягиватьПоВертикали = Истина;
		Элементы.ТекущаяТемаВложения.РастягиватьПоГоризонтали = Ложь;
		Элементы.СтраницаПросмотрТемСФайлами.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		Элементы.ГруппаСписокТем.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		Элементы.СтраницыПросмотрТем.Видимость = Истина;
		Элементы.СписокТемОбластьЧтенияСнизу.Пометка = Истина;
		Элементы.СписокТемОбластьЧтенияСправа.Пометка = Ложь;
		Элементы.СписокТемОбластьЧтенияОтключена.Пометка = Ложь;
		ОбластьЧтенияТемВключена = Истина;
		
		ОбновитьФайлыТемы();
		
	ИначеЕсли ПоложениеОбластиЧтенияТем = "Справа" Тогда
		
		Элементы.ТекущаяТемаВложения.Видимость = Истина;
		Элементы.ТекущаяТемаВложения.РастягиватьПоВертикали = Ложь;
		Элементы.ТекущаяТемаВложения.РастягиватьПоГоризонтали = Истина;
		Элементы.СтраницаПросмотрТемСФайлами.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		Элементы.ГруппаСписокТем.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		Элементы.СтраницыПросмотрТем.Видимость = Истина;
		Элементы.СписокТемОбластьЧтенияСнизу.Пометка = Ложь;
		Элементы.СписокТемОбластьЧтенияСправа.Пометка = Истина;
		Элементы.СписокТемОбластьЧтенияОтключена.Пометка = Ложь;
		ОбластьЧтенияТемВключена = Истина;
		
		ОбновитьФайлыТемы();
		
	ИначеЕсли ПоложениеОбластиЧтенияТем = "Отключена" Тогда
		
		Элементы.ТекущаяТемаВложения.Видимость = Ложь;
		Элементы.СтраницыПросмотрТем.Видимость = Ложь;
		Элементы.СписокТемОбластьЧтенияСнизу.Пометка = Ложь;
		Элементы.СписокТемОбластьЧтенияСправа.Пометка = Ложь;
		Элементы.СписокТемОбластьЧтенияОтключена.Пометка = Истина;
		ОбластьЧтенияТемВключена = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПоложениеОбластиЧтенияТемКлиент()
	
	Если ПоложениеОбластиЧтенияТем = "Снизу" Тогда
		
		Элементы.ТекущаяТемаВложения.Видимость = Истина;
		Элементы.ТекущаяТемаВложения.РастягиватьПоВертикали = Истина;
		Элементы.ТекущаяТемаВложения.РастягиватьПоГоризонтали = Ложь;
		Элементы.СтраницаПросмотрТемСФайлами.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		Элементы.ГруппаСписокТем.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		Элементы.СтраницыПросмотрТем.Видимость = Истина;
		Элементы.СписокТемОбластьЧтенияСнизу.Пометка = Истина;
		Элементы.СписокТемОбластьЧтенияСправа.Пометка = Ложь;
		Элементы.СписокТемОбластьЧтенияОтключена.Пометка = Ложь;
		ОбластьЧтенияТемВключена = Истина;

		
	ИначеЕсли ПоложениеОбластиЧтенияТем = "Справа" Тогда
		
		Элементы.ТекущаяТемаВложения.Видимость = Истина;
		Элементы.ТекущаяТемаВложения.РастягиватьПоВертикали = Ложь;
		Элементы.ТекущаяТемаВложения.РастягиватьПоГоризонтали = Истина;
		Элементы.СтраницаПросмотрТемСФайлами.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		Элементы.ГруппаСписокТем.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		Элементы.СтраницыПросмотрТем.Видимость = Истина;
		Элементы.СписокТемОбластьЧтенияСнизу.Пометка = Ложь;
		Элементы.СписокТемОбластьЧтенияСправа.Пометка = Истина;
		Элементы.СписокТемОбластьЧтенияОтключена.Пометка = Ложь;
		ОбластьЧтенияТемВключена = Истина;

		
	ИначеЕсли ПоложениеОбластиЧтенияТем = "Отключена" Тогда
		
		Элементы.ТекущаяТемаВложения.Видимость = Ложь;
		Элементы.СтраницыПросмотрТем.Видимость = Ложь;
		Элементы.СписокТемОбластьЧтенияСнизу.Пометка = Ложь;
		Элементы.СписокТемОбластьЧтенияСправа.Пометка = Ложь;
		Элементы.СписокТемОбластьЧтенияОтключена.Пометка = Истина;
		ОбластьЧтенияТемВключена = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТемуПоПредмету()
	
	ЗадатьТему(РаботаСОбсуждениями.НайтиТемуПоПредмету(Предмет));

КонецПроцедуры

&НаСервере
Процедура ЗадатьТему(НоваяТема)
	
	Тема = НоваяТема;
	Если Тема <> Неопределено Тогда
		
		// Обновление списка сообщений
		Список.Параметры.УстановитьЗначениеПараметра("Тема", Тема);
		Если ЗначениеЗаполнено(Тема) Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,
				"Тема",
				Тема);
		КонецЕсли;
		
		// Обновление дерева сообщений
		РеквизитыТемы = Новый Структура;
		РеквизитыТемы.Вставить("Ссылка", Тема);
		ЗаполнитьДеревоСообщений();
		
	КонецЕсли;
	
	ОбновитьРеквизитыТемы();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСервер()
	
	Если Не ЗначениеЗаполнено(Тема) И ЗначениеЗаполнено(Предмет) Тогда
		ОбновитьТемуПоПредмету();
		Возврат;	
	КонецЕсли;
	
	Если РежимОтображенияСообщенийДеревом Тогда
		Элементы.СтраницаСписок.Видимость = Ложь;
		Элементы.СтраницаКоманднаяПанельСписок.Видимость = Ложь;
		Элементы.СтраницаДерево.Видимость = Истина;
		Элементы.СтраницаКоманднаяПанельДерево.Видимость = Истина;
		ЗаполнитьДеревоСообщений();
	Иначе
		Элементы.СтраницаСписок.Видимость = Истина;
		Элементы.СтраницаКоманднаяПанельСписок.Видимость = Истина;
		Элементы.СтраницаДерево.Видимость = Ложь;
		Элементы.СтраницаКоманднаяПанельДерево.Видимость = Ложь;
		Элементы.Список.Обновить();
	КонецЕсли;
	
	ПараметрыОтбора = Новый Соответствие();
	Параметрыотбора.Вставить("ПоказатьПомеченныеНаУдалениеСообщения", ПоказатьПомеченныеНаУдаление);
	УстановитьОтборСписка(Список, ПараметрыОтбора);
	
	ПараметрыОтбора = Новый Соответствие();
	Параметрыотбора.Вставить("ПоказатьПомеченныеНаУдалениеТемы", ПоказатьПомеченныеНаУдаление);
	УстановитьОтборСписка(СписокТем, ПараметрыОтбора);
	
	Элементы.ДеревоСообщенийПоказатьПомеченныеНаУдаление.Пометка = ПоказатьПомеченныеНаУдаление;
	Элементы.СписокПоказатьПомеченныеНаУдаление.Пометка = ПоказатьПомеченныеНаУдаление;
	Элементы.ПоказатьПомеченныеНаУдаление.Пометка = ПоказатьПомеченныеНаУдаление;
	
	ОбновитьРеквизитыТемы();
	ОбновитьФайлыСообщения();
	ОбновитьГолосованиеСервер();
	
КонецПроцедуры

&НаСервере
Функция ПометитьНаУдалениеСообщения(Сообщения, ПометкаУдаления)
	
	Для Каждого СообщениеСсылка Из Сообщения Цикл
		
		Если СообщениеСсылка.Пустая() Тогда
			Продолжить;
		КонецЕсли;	
		
		СообщениеОбъект = СообщениеСсылка.ПолучитьОбъект();
		СообщениеОбъект.УстановитьПометкуУдаления(ПометкаУдаления);
	КонецЦикла;
	
	ЗаполнитьДеревоСообщений();
	
КонецФункции

&НаСервере
Функция ДеревоСообщенийПеретаскиваниеСервер(ПараметрыПеретаскиванияЗначение, Строка, Тема)
	
	КодПереноса = РаботаСОбсуждениями.ПереносСообщения(ПараметрыПеретаскиванияЗначение, Строка, Тема);
		
	ЗаполнитьДеревоСообщений();
	
	Возврат КодПереноса;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДеревоСообщений()
	
	ДеревоСообщенийЗначение = РеквизитФормыВЗначение("ДеревоСообщений");
	ДеревоСообщенийЗначение.Строки.Очистить();
	
	Если ЗначениеЗаполнено(Тема) Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СправочникСообщенияОбсуждений.ПометкаУдаления,
		|	СправочникСообщенияОбсуждений.Родитель,
		|	СправочникСообщенияОбсуждений.Ссылка КАК Ссылка,
		|	СправочникСообщенияОбсуждений.Автор,
		|	ВЫБОР
		|		КОГДА СправочникСообщенияОбсуждений.ДатаСоздания > СправочникСообщенияОбсуждений.ДатаИзменения
		|			ТОГДА СправочникСообщенияОбсуждений.ДатаСоздания
		|		ИНАЧЕ СправочникСообщенияОбсуждений.ДатаИзменения
		|	КОНЕЦ КАК ДатаСообщения,
		|	СправочникСообщенияОбсуждений.ДобавленоГолосование,
		|	ВЫБОР
		|		КОГДА КешИнформацииОбОбъектах.ЕстьЗадачи ЕСТЬ NULL 
		|			ТОГДА ЛОЖЬ
		|		КОГДА КешИнформацииОбОбъектах.ЕстьЗадачи
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Задачи,
		|	СправочникСообщенияОбсуждений.НомерСообщения КАК НомерСообщения,
		|	ЕСТЬNULL(СведенияОПрочтении.Прочтен, ЛОЖЬ) КАК Прочтен,
		|	СправочникСообщенияОбсуждений.ТекстСообщения,
		|	СправочникСообщенияОбсуждений.ТекстСообщенияСписок,
		|	СправочникСообщенияОбсуждений.ВладелецСообщения КАК Тема,
		|	ВЫБОР
		|		КОГДА КешИнформацииОбОбъектах.ЕстьФайлы ЕСТЬ NULL 
		|			ТОГДА ЛОЖЬ
		|		КОГДА КешИнформацииОбОбъектах.ЕстьФайлы
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Файлы
		|ИЗ
		|	Справочник.СообщенияОбсуждений КАК СправочникСообщенияОбсуждений
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КешИнформацииОбОбъектах КАК КешИнформацииОбОбъектах
		|		ПО СправочникСообщенияОбсуждений.Ссылка = КешИнформацииОбОбъектах.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОПрочтении КАК СведенияОПрочтении
		|		ПО СправочникСообщенияОбсуждений.Ссылка = СведенияОПрочтении.Объект
		|			И (СведенияОПрочтении.Пользователь = &Пользователь)
		|ГДЕ
		|	СправочникСообщенияОбсуждений.ВладелецСообщения = &Тема
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСообщения ИЕРАРХИЯ";
		
		Запрос.УстановитьПараметр("Тема", Тема);
        Запрос.УстановитьПараметр("Пользователь", ПользователиКлиентСервер.ТекущийПользователь());
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.ПометкаУдаления И Не ПоказатьПомеченныеНаУдаление Тогда 
				Продолжить;
			КонецЕсли;	
			
			Родитель = Выборка.Родитель;
			Если Не ЗначениеЗаполнено(Родитель) Тогда 
				НоваяСтрока = ДеревоСообщенийЗначение.Строки.Добавить();
			Иначе	
				НайденнаяСтрока = ДеревоСообщенийЗначение.Строки.Найти(Родитель, "Ссылка", Истина);	
				Если НайденнаяСтрока <> Неопределено Тогда
					НоваяСтрока = НайденнаяСтрока.Строки.Добавить();	
				Иначе
					НоваяСтрока = ДеревоСообщенийЗначение.Строки.Добавить();	
				КонецЕсли;
			КонецЕсли;
									
			ЗаполнитьСтрокуДереваИзСообщения(НоваяСтрока, Выборка);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ДеревоСообщенийЗначение, "ДеревоСообщений");
	
	Индекс = -1;
	РаботаСОбсуждениямиКлиентСервер.НайтиСообщениеВДеревеПоСсылке(ДеревоСообщений.ПолучитьЭлементы(), ТекущееСообщение, Индекс);
	Если Индекс > -1 Тогда
		Элементы.ДеревоСообщений.ТекущаяСтрока = Индекс;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокуДереваИзСообщения(ЭлементДерева, Сообщение)
	
	Если ТипЗнч(ЭлементДерева) = Тип("Число") Тогда 
		ЭлементДерева = ДеревоСообщений.НайтиПоИдентификатору(ЭлементДерева);
	КонецЕсли;	
	
	СписокРеквизитов = 
	"ПометкаУдаления,
	|Родитель,
	|Ссылка,
	|Автор,
	|ДатаСообщения,
	|ДобавленоГолосование,
	|Задачи,
	|НомерСообщения,
	|Прочтен,
	|ТекстСообщения,
	|ТекстСообщенияСписок,
	|Тема,
	|Файлы";
	
	Реквизиты = Сообщение;
	
	СписокРеквизитов = СтрЗаменить(СписокРеквизитов, "Родитель,", "");
	
	ЗаполнитьЗначенияСвойств(ЭлементДерева, Реквизиты, СписокРеквизитов); 
	
	ЭлементДерева.РодительскоеСообщение = Реквизиты.Родитель;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДеревоСообщений()
	
	Сообщение = ПолучитьТекущееСообщение(Ложь);
	
	СписокРаскрытыхСообщений.Очистить();
	РаботаСОбсуждениямиКлиент.ПолучитьМассивРаскрытыхСообщений(Элементы.ДеревоСообщений, ДеревоСообщений.ПолучитьЭлементы(), СписокРаскрытыхСообщений);
		
	ОбновитьСервер();
	
	РаботаСОбсуждениямиКлиент.УстановитьРазвернутостьЭлементовДерева(Элементы.ДеревоСообщений, ДеревоСообщений, СписокРаскрытыхСообщений);
	РаботаСОбсуждениямиКлиент.УстановитьТекущееСообщениеВДеревеПоСсылке(Элементы.ДеревоСообщений, ДеревоСообщений, Сообщение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображение()
	
	ОбновитьСервер();
	УстановитьДоступностьКоманд();
	
	УстановитьТекущуюСтроку(ТекущееСообщение);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьТекущуюСтроку()
	
	Если РежимОтображенияСообщенийДеревом Тогда
		Возврат Элементы.ДеревоСообщений.ТекущаяСтрока;
	Иначе
		Возврат Элементы.Список.ТекущаяСтрока;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция УстановитьТекущуюСтроку(ЗначениеТекущейСтроки)
	
	Если РежимОтображенияСообщенийДеревом Тогда
		РаботаСОбсуждениямиКлиент.УстановитьТекущееСообщениеВДеревеПоСсылке(Элементы.ДеревоСообщений, ДеревоСообщений, ЗначениеТекущейСтроки);
	Иначе
		Элементы.Список.ТекущаяСтрока = ЗначениеТекущейСтроки;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ПолучитьТекущиеДанные()
	
	Если РежимОтображенияСообщенийДеревом Тогда
		Возврат Элементы.ДеревоСообщений.ТекущиеДанные;
	Иначе
		Возврат Элементы.Список.ТекущиеДанные;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура УстановитьДоступностьКоманд()
	
	Элементы.СписокНаписать.Доступность = Не ЗакрытаяТема;
	Элементы.СписокОтветить.Доступность = Не ЗакрытаяТема;
	Элементы.СписокУстановитьПометкуУдаления.Доступность = Не ЗакрытаяТема;
	Элементы.СписокКонтекстноеМенюСоздать.Доступность = Не ЗакрытаяТема;
	Элементы.СписокКонтекстноеМенюОтветить.Доступность = Не ЗакрытаяТема;
	Элементы.СписокКонтекстноеМенюУстановитьПометкуУдаления.Доступность = Не ЗакрытаяТема;
	
КонецПроцедуры

&НаСервере
Процедура ПереключитьВидПросмотра()
	
	ПараметрыОтбора = Новый Соответствие();
	ПараметрыОтбора.Вставить("РазделыОбсуждений", РазделыОбсуждений);
	ПараметрыОтбора.Вставить("ВидПросмотра", ВидПросмотра);
	
	УстановитьОтборСписка(СписокТем, ПараметрыОтбора);	
	
	Параметр = СписокТем.Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Группа"));
	Параметр.Использование = Ложь;
		
	Если ВидПросмотра = НСтр("ru = 'Списком'") Тогда
		
		Элементы.Дерево.Видимость = Ложь;
		Элементы.Раздел.Видимость = Истина;
		Элементы.РазделыОбсуждений.Видимость = Истина;
		
	ИначеЕсли ВидПросмотра = НСтр("ru = 'По разделам'") Тогда
		
		Элементы.Дерево.Видимость = Истина;
		Если Элементы.Дерево.ТекущаяСтрока <> Неопределено Тогда 
			СписокТем.Параметры.УстановитьЗначениеПараметра("Группа", ТекущийРаздел);
		КонецЕсли;
		Элементы.Раздел.Видимость = Ложь;
		Элементы.РазделыОбсуждений.Видимость = Ложь;
		
	Иначе
		ВидПросмотра = НСтр("ru = 'Списком'");
		ПереключитьВидПросмотра();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОжидания()
	
	Если Элементы.Дерево.ТекущаяСтрока <> Неопределено Тогда 
		СписокТем.Параметры.УстановитьЗначениеПараметра("Группа", ТекущийРаздел);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьТекущуюТему(ВыводитьПредупреждение = Ложь)
	
	ТекущаяСтрока = Элементы.СписокТем.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Если ВыводитьПредупреждение Тогда
			ТекстПредупреждения = НСтр("ru = 'Не выбрана тема.'");
			ПоказатьПредупреждение(, ТекстПредупреждения);
		КонецЕсли;
		Возврат Неопределено;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.СписокТем.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Или Не ТекущиеДанные.Свойство("Ссылка") Тогда
		Если ВыводитьПредупреждение Тогда
			ТекстПредупреждения = НСтр("ru = 'Не выбрана тема.'");
			ПоказатьПредупреждение(, ТекстПредупреждения);
		КонецЕсли;
		Возврат Неопределено;
	КонецЕсли;
	
	ТемаСсылка = ТекущиеДанные.Ссылка;
	Если Не ТипЗнч(ТемаСсылка) = Тип("СправочникСсылка.ТемыОбсуждений") Тогда
		Если ВыводитьПредупреждение Тогда
			ТекстПредупреждения = НСтр("ru = 'Не выбрана тема.'");
			ПоказатьПредупреждение(, ТекстПредупреждения);
		КонецЕсли;
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ТемаСсылка;
	
КонецФункции

&НаКлиенте
Функция ПолучитьВыбранныеТемы(ВыводитьПредупреждение = Ложь)
	
	Результат = Новый Массив;
	
	ВыделенныеСтроки = Элементы.СписокТем.ВыделенныеСтроки;
	
	Для Каждого Ссылка Из ВыделенныеСтроки Цикл
		
		Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.ТемыОбсуждений") Тогда
			Результат.Добавить(Ссылка);
		КонецЕсли;
		
	КонецЦикла;
	
	ТемаПолученная = ПолучитьТекущуюТему(Ложь);
	
	Если ЗначениеЗаполнено(ТемаПолученная)
		И Результат.Найти(ТемаПолученная) = Неопределено Тогда
		Результат.Добавить(ТемаПолученная);
	КонецЕсли;
	
	Если Результат.Количество() = 0 И ВыводитьПредупреждение Тогда
		ТекстПредупреждения = НСтр("ru = 'Не выбрана тема.'");
		ПоказатьПредупреждение(, ТекстПредупреждения);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура УстановитьШрифтОбластиЧтения(УстановитьПерсональнуюНастройку)
	
	Элементы.ТекущееСообщениеТекст.Шрифт = ШрифтОбластиЧтения;
	Элементы.ТекущееСообщениеТекстСФайлами.Шрифт = ШрифтОбластиЧтения;
	Элементы.ТекущееСообщениеТекстСГолосованием.Шрифт = ШрифтОбластиЧтения;
	Элементы.ТекущееСообщениеТекстСФайламиИГолосованием.Шрифт = ШрифтОбластиЧтения;
	Элементы.ТекущаяТемаТекст.Шрифт = ШрифтОбластиЧтения;
	Элементы.ТекущаяТемаТекстСФайлами.Шрифт = ШрифтОбластиЧтения;
	
	Если УстановитьПерсональнуюНастройку Тогда
		РаботаСОбсуждениями.УстановитьПерсональнуюНастройку("ШрифтОбластиЧтения", ШрифтОбластиЧтения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьГолосованиеСервер()
	
	Элементы.Голосование.СписокВыбора.Очистить();
	Элементы.ГолосованиеСФайлами.СписокВыбора.Очистить();
	
	Если Не ЗначениеЗаполнено(ТекущееСообщение) Тогда
		
		ВопросГолосования = "";
		Голосование = 0;
		ВсегоГолосов = "";
		Элементы.Проголосовать.Доступность = Ложь;
		ПользовательПроголосовал = Ложь;
		
		Возврат;
		
	КонецЕсли;
	
	Для каждого РезультатГолосования Из РаботаСОбсуждениями.ПолучитьРезультатГолосования(ТекущееСообщение) Цикл
		
		Если РезультатГолосования.Значение = 0 Тогда
			ВсегоГолосов = РезультатГолосования.Представление;
			Продолжить;
		КонецЕсли;
		
		Элементы.Голосование.СписокВыбора.Добавить(
			РезультатГолосования.Значение,
			РезультатГолосования.Представление);
		
		Элементы.ГолосованиеСФайлами.СписокВыбора.Добавить(
			РезультатГолосования.Значение,
			РезультатГолосования.Представление);
		
	КонецЦикла;
	
	ВопросГолосования = ТекущееСообщение.ВопросГолосования;
	Голосование = РаботаСОбсуждениями.ПолучитьРезультатГолосованияТекущегоПользователя(ТекущееСообщение);
	ГолосПользователя = РаботаСОбсуждениями.ПолучитьПредставлениеГолосаПользователя(ТекущееСообщение);
	Если Голосование <> 0 Тогда
		ПользовательПроголосовал = Истина;
	Иначе
		ПользовательПроголосовал = Ложь;
	КонецЕсли;
	
	Элементы.Проголосовать.Доступность = ЗначениеЗаполнено(Голосование) И Не ЗакрытаяТема;
	Элементы.ПроголосоватьСФайлами.Доступность = ЗначениеЗаполнено(Голосование) И Не ЗакрытаяТема;
	Элементы.Прокомментировать.Доступность = ПользовательПроголосовал И Не ЗакрытаяТема;
	Элементы.ПрокомментироватьСФайлами.Доступность = ПользовательПроголосовал И Не ЗакрытаяТема;
	Элементы.Голосование.Доступность = Не ЗакрытаяТема;
	Элементы.ГолосованиеСФайлами.Доступность = Не ЗакрытаяТема;
	
КонецПроцедуры

&НаСервере
Процедура ПроголосоватьСервер()
	
	РаботаСОбсуждениями.Проголосовать(ТекущееСообщение, Голосование);
	ОбновитьГолосованиеСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовуюТемуКлиент()
	
	ПараметрыФормы = Новый Структура("ТемаРаздел");
	Если ВидПросмотра = НСтр("ru = 'По разделам'") Тогда
		ПараметрыФормы.ТемаРаздел = ТекущийРаздел;
	КонецЕсли;
	ОткрытьФорму("Справочник.СообщенияОбсуждений.ФормаОбъекта", ПараметрыФормы, Элементы.СписокТем);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьРеквизитыТемы()
	
	ЗакрытаяТема = Тема.Закрытая;
	Предмет = Тема.Документ;
	
	ВидимостьПредмета = ЗначениеЗаполнено(Предмет);
	Элементы.Предмет.Видимость = ВидимостьПредмета;
	
	Если ЗначениеЗаполнено(Тема) Тогда
		КоличествоСообщенийТемы = РаботаСОбсуждениями.ПосчитатьКоличествоСообщений(Тема);
		Элементы.СтраницаСообщенияТемы.Заголовок = 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Тема: %1 (%2)'"),
				Тема.Наименование,
				КоличествоСообщенийТемы);
		Элементы.СтраницаСообщенияТемы.Доступность = Истина;
	Иначе
		Элементы.СтраницаСообщенияТемы.Заголовок = НСтр("ru = 'Тема обсуждения'");
		Элементы.СтраницаСообщенияТемы.Доступность = Ложь;
	КонецЕсли;
	
	НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(Тема);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТекущееСообщение()
	
	ТекущееСообщение = Неопределено;
	ТекущееСообщениеТекст = "";
	ВложенияСообщения.Очистить();
	Элементы.СтраницыПросмотр.ТекущаяСтраница = Элементы.СтраницаПросмотр;
	
КонецПроцедуры

#КонецОбласти