
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийЭлемент = Элементы.НадписьПоискИУстановкаОбновлений; 
	ДетализироватьОбновлениеВЖурналеРегистрации = 
		Константы.ДетализироватьОбновлениеИБВЖурналеРегистрации.Получить();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ПоискИУстановкаОбновленийНажатие(Команда)
	
	ОткрытьФорму("Обработка.ОбновлениеКонфигурации.Форма", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатыОбновленияНажатие(Команда)
	
	ПараметрыФормы = Новый Структура("ОткрытиеИзПанелиАдминистрирования", Истина);
	ОткрытьФорму("Обработка.ОбновлениеИнформационнойБазы.Форма.ИндикацияХодаОтложенногоОбновленияИБ",
		ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДетализироватьОбновлениеВЖурналеРегистрацииПриИзменении(Элемент)
	
	ДетализироватьОбновлениеВЖурналеРегистрацииПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ДетализироватьОбновлениеВЖурналеРегистрацииПриИзмененииНаСервере()
	
	Константы.ДетализироватьОбновлениеИБВЖурналеРегистрации.Установить(
		ДетализироватьОбновлениеВЖурналеРегистрации);
	
КонецПроцедуры
