//Получает реквизит данных файла
//Параметры:Файл - ссылка на объект файл
//			НазваниеПоля - наименование реквизита, которое необходимо получить
//			ФактическийВладелецФайла - ссылка на владельца файла, на основании которого следует производить подстановку данных
//Возвращает:значение поля, если оно существует
Функция ПолучитьЗначениеРеквизитаДляАвтозаполнения(Файл, НазваниеПоля, ФактическийВладелецФайла) Экспорт
	
	Результат = "";
	НазваниеПоля = СтрЗаменить(НазваниеПоля, "Файл|", "");
	НазваниеПоля = СтрЗаменить(НазваниеПоля, "Файл.", "");	
	Попытка
		Если Найти(НазваниеПоля, "|") > 0 Тогда
			МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(НазваниеПоля, "|");
			НазваниеПоля = СтрЗаменить(НазваниеПоля, "|", ".");
		Иначе
			МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(НазваниеПоля, ".");
		КонецЕсли;
		
		Выражение = "Если НЕ Файл.Пустая()";
		ВыражениеРеквизита = "Файл";
		Счетчик = 0;
		Для Каждого Реквизит Из МассивСтрок Цикл
			Счетчик = Счетчик + 1;
			ВыражениеРеквизита = ВыражениеРеквизита + "." + Реквизит;
			Если Счетчик < МассивСтрок.Количество() Тогда
				Выражение = Выражение + Символы.ВК + "И НЕ " + ВыражениеРеквизита + " = Неопределено"
					+ " И НЕ " + ВыражениеРеквизита + ".Пустая()";
			КонецЕсли;
		КонецЦикла;
		Выражение = Выражение + Символы.ВК + "И ЗначениеЗаполнено(Файл." + НазваниеПоля + ")";
		Выражение = Выражение + " Тогда " + Символы.ВК + "Результат = Файл." + НазваниеПоля + ";" + Символы.ВК + "КонецЕсли;";
		Выражение = СтрЗаменить(Выражение, "Файл.ВладелецФайла", "ФактическийВладелецФайла");
		УстановитьПривилегированныйРежим(Истина);
		Выполнить(Выражение);
		УстановитьПривилегированныйРежим(Ложь);
	Исключение
		Инфо = ИнформацияОбОшибке();
		ВызватьИсключение("ОшибкаДоступаКРеквизиту");
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьЗначениеДопРеквизитаДляЗамены(Файл, НазваниеПоля, ФактическийВладелецФайла) Экспорт 
	
	Результат = "";
	
	Если Найти(НазваниеПоля, "|") > 0 Тогда
		МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(НазваниеПоля, "|");
	Иначе
		МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(НазваниеПоля, ".");
	КонецЕсли;
	Если МассивСтрок.Количество() = 1
		ИЛИ НЕ ЗначениеЗаполнено(ФактическийВладелецФайла) Тогда
		Возврат Результат;
	КонецЕсли;
	ИмяДопРеквизита = МассивСтрок[МассивСтрок.Количество() - 1];
	
	Счетчик = 0;
	Пока Счетчик < 2 Цикл
		Счетчик = Счетчик + 1;
		Для Каждого Строка Из МассивСтрок Цикл
			Если Найти(Строка, "ДопСвойства") > 0
				ИЛИ Найти(Строка, "ДопРеквизиты") > 0 Тогда
				МассивСтрок.Удалить(МассивСтрок.Найти(Строка));
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Выражение = "Если НЕ Файл.Пустая()";
	ВыражениеРеквизита = "Файл";
	Счетчик = 0;
	Для Каждого Реквизит Из МассивСтрок Цикл
		Счетчик = Счетчик + 1;
		
		Если Найти(Реквизит, " ") > 0
			Или Реквизит = Строка(ФактическийВладелецФайла.ВидДокумента) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Счетчик < МассивСтрок.Количество() Тогда
			ВыражениеРеквизита = ВыражениеРеквизита + "." + Реквизит;
			Выражение = Выражение + Символы.ВК + "И НЕ " + ВыражениеРеквизита + " = Неопределено"
				+ " И НЕ " + ВыражениеРеквизита + ".Пустая()";
		КонецЕсли;
	КонецЦикла;	
	
	ВыражениеЦикла = 
		"Для Каждого ДопРеквизит Из " + ВыражениеРеквизита + ".ДополнительныеРеквизиты Цикл
			|Если Строка(ДопРеквизит.Свойство) = ИмяДопРеквизита Тогда
			|	Результат = ДопРеквизит.Значение;
			|КонецЕсли;
		|КонецЦикла;";
	
	Выражение = Выражение + " Тогда " + ВыражениеЦикла + "КонецЕсли;";
	Выражение = СтрЗаменить(Выражение, "Файл.ВладелецФайла", "ФактическийВладелецФайла");
	УстановитьПривилегированныйРежим(Истина);
		Выполнить(Выражение);
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Результат;
	
КонецФункции

Функция ПолучитьЗначениеКонтактнойИнформацииДляЗамены(Файл, НазваниеПоля, ФактическийВладелецФайла) Экспорт
	
	Результат = "";
	Если Найти(НазваниеПоля, "|") > 0 Тогда
		МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(НазваниеПоля, "|");
	Иначе
		МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(НазваниеПоля, ".");
	КонецЕсли;
	
	Если МассивСтрок.Количество() = 1
		ИЛИ НЕ ЗначениеЗаполнено(ФактическийВладелецФайла) Тогда
		Возврат Результат;
	КонецЕсли;
	ИмяКонтИнформации = МассивСтрок[МассивСтрок.Количество() - 1];
	
	Счетчик = 0;
	Пока Счетчик < 2 Цикл
		Счетчик = Счетчик + 1;
		Для Каждого Строка Из МассивСтрок Цикл
			Если Найти(Строка, НСтр("ru = 'КонтактнаяИнформация'")) Тогда
				МассивСтрок.Удалить(МассивСтрок.Найти(Строка));
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Выражение = "Если НЕ Файл.Пустая()";
	ВыражениеРеквизита = "Файл";
	Счетчик = 0;
	Для Каждого Реквизит Из МассивСтрок Цикл
		Счетчик = Счетчик + 1;
		
		Если Найти(Реквизит, " ") > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если Счетчик < МассивСтрок.Количество() Тогда
			ВыражениеРеквизита = ВыражениеРеквизита + "." + Реквизит;
			Выражение = Выражение + Символы.ВК + "И НЕ " + ВыражениеРеквизита + " = Неопределено"
				+ " И НЕ " + ВыражениеРеквизита + ".Пустая()";
		КонецЕсли;
	КонецЦикла;	
	
	ВыражениеЦикла = 
		"Для Каждого КонтИнформация Из " + ВыражениеРеквизита + ".КонтактнаяИнформация Цикл
			|Если Строка(КонтИнформация.Вид.Наименование) = ИмяКонтИнформации Тогда
			|	Результат = КонтИнформация.Представление;
			|КонецЕсли;
		|КонецЦикла;";
	
	Выражение = Выражение + " Тогда " + ВыражениеЦикла + "КонецЕсли;";
	Выражение = СтрЗаменить(Выражение, "Файл.ВладелецФайла", "ФактическийВладелецФайла");
	УстановитьПривилегированныйРежим(Истина);
		Выполнить(Выражение);
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Результат;
	
КонецФункции
