// Инициализирует таблицы значений, содержащие данные документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	мПродлениеСроковСроки.Ссылка.Дата КАК Дата,
		|	мПродлениеСроковСроки.Договор,
		|	мПродлениеСроковСроки.ЭтапДоговора,
		|	мПродлениеСроковСроки.НомерДС,
		|	мПродлениеСроковСроки.ДатаДС,
		|	мПродлениеСроковСроки.ПродлитьДо,
		|	мПродлениеСроковСроки.ВидДокумента,
		|	мПродлениеСроковСроки.Ссылка.Ответственный КАК Ответственный,
		|	мПродлениеСроковСроки.ЭтапДоговора.ЗапретИзмененияПлановогоСрока КАК ЗапретИзмененияПлановогоСрока
		|ИЗ
		|	Документ.мПродлениеСроков.Сроки КАК мПродлениеСроковСроки
		|ГДЕ
		|	мПродлениеСроковСроки.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Результат = Запрос.Выполнить();
  
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаСроки", Результат.Выгрузить());
	
КонецПроцедуры 