
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(Запись.ШаблонБизнесПроцесса) Тогда
	
		ШаблонОбъект = Запись.ШаблонБизнесПроцесса.ПолучитьОбъект();
		
		МассивПолей = ШаблонОбъект.ПолучитьСписокНезаполненныхПолейНеобходимыхДляСтарта();
		Если МассивПолей.Количество() <> 0 Тогда
			
			СтрокаПолей = БизнесСобытияВызовСервера.МассивПолейВСтроку(МассивПолей);
			
			ТекстСообщения = 
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Шаблон ""%1"" нельзя использовать для автоматического запуска процессов, т.к. не заполнены поля шаблона: %2'"),
				Строка(Запись.ШаблонБизнесПроцесса), СтрокаПолей);
				
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Запись.ШаблонБизнесПроцесса", , Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
