
&НаКлиенте
Процедура ОбъектыПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.ОбъектыРабот.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	ПоказатьДоговоры(ТекДанные.ОбъектРабот);
КонецПроцедуры

&НаСервере
Процедура ПоказатьДоговоры(ОбъектРабот)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	мЭтапыДоговоров.Владелец КАК Договор,
		|	ГОД(мЭтапыДоговоров.Владелец.ДатаРегистрации) КАК ГодДоговора
		|ИЗ
		|	Справочник.мЭтапыДоговоров КАК мЭтапыДоговоров
		|ГДЕ
		|	мЭтапыДоговоров.ОбъектРабот = &ОбъектРабот
		|	И НЕ мЭтапыДоговоров.ПометкаУдаления
		|	И НЕ мЭтапыДоговоров.ИсключенИзДоговора
		|
		|УПОРЯДОЧИТЬ ПО
		|	ГодДоговора,
		|	мЭтапыДоговоров.Владелец.ЧисловойНомер";
	
	Запрос.УстановитьПараметр("ОбъектРабот", ОбъектРабот);
	
	Результат = Запрос.Выполнить().Выгрузить();
	МассивДоговоров = Результат.ВыгрузитьКолонку("Договор");
	
	Договоры.ЗагрузитьЗначения(МассивДоговоров);		
КонецПроцедуры
 

&НаСервере
Процедура НайтиОбъекты()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	мОбъектыРабот.Ссылка КАК ОбъектРабот
		|ИЗ
		|	Справочник.мОбъектыРабот КАК мОбъектыРабот
		|ГДЕ
		|	мОбъектыРабот.Владелец = &Владелец
		|	И НЕ мОбъектыРабот.ПометкаУдаления
		|	И мОбъектыРабот.Наименование ПОДОБНО &СтрокаПоиска
		|
		|УПОРЯДОЧИТЬ ПО
		|	мОбъектыРабот.Наименование";
	
	Если ЗначениеЗаполнено(СтрокаПоиска) Тогда
		Запрос.УстановитьПараметр("СтрокаПоиска", "%"+СтрокаПоиска+"%");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И мОбъектыРабот.Наименование ПОДОБНО &СтрокаПоиска", "");
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("Владелец", Заказчик);
	
	_ОбъектыРабот = РеквизитФормыВЗначение("ОбъектыРабот", Тип("ТаблицаЗначений"));
	
	_ОбъектыРабот = Запрос.Выполнить().Выгрузить();
	
	ЗначениеВРеквизитФормы(_ОбъектыРабот, "ОбъектыРабот");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказчикПриИзменении(Элемент)
	НайтиОбъекты();
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаПриИзменении(Элемент)
	НайтиОбъекты();	
КонецПроцедуры
