
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("ТекстВопроса", ТекстВопроса);

КонецПроцедуры

&НаКлиенте
Процедура Вернуться(Команда)
	ОповеститьОВыборе("Вернуться");
КонецПроцедуры

&НаКлиенте
Процедура НеСохранять(Команда)
	ОповеститьОВыборе("НеСохранять");
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакончитьРедактирование(Команда)
	ОповеститьОВыборе("СохранитьИЗакончитьРедактирование");
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзменения(Команда)
	ОповеститьОВыборе("СохранитьИзменения");
КонецПроцедуры
