
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("Заказчик", Заказчик);
	Параметры.Свойство("Поручение", Поручение);
	Параметры.Свойство("ВидРабот", ВидРабот);
	Отбор = "";
	Параметры.Свойство("Отбор", Отбор);
	Отбор.Свойство("Владелец", ОбъектРабот);	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Владелец", ОбъектРабот));
	ЗначенияЗаполнения = Новый Структура();
	ЗначенияЗаполнения.Вставить("Заказчик", Заказчик);
	ЗначенияЗаполнения.Вставить("Поручение", Поручение);
	ЗначенияЗаполнения.Вставить("ВидРабот", ВидРабот);
	ЗначенияЗаполнения.Вставить("ОбъектРабот", ОбъектРабот);
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	//Если Копирование Тогда
	//	НаименованиеКопируемого = Элементы.Список.ТекущиеДанные.Наименование;
	//	СсылкаКопируемого = Элемент.ТекущиеДанные.Ссылка;
	//	ПараметрыФормы.Вставить("Копирование", Копирование);
	//	ПараметрыФормы.Вставить("НаименованиеОбъекта", НаименованиеКопируемого);
	//	ПараметрыФормы.Вставить("ПолноеНаименование", ПолучитьПолноеНаименованиеОбъектаРабот(СсылкаКопируемого));
	//	ПараметрыФормы.Вставить("СтруктураАдресаЗемельногоУчастка", ПолучитьСтруктуруАдресаЗемельногоУчастка(СсылкаКопируемого));
	//Иначе
	//	ПараметрыФормы.Вставить("Поручение", Поручение);
	//	ПараметрыФормы.Вставить("ВидРабот", ВидРабот);
	//КонецЕсли; 
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ОткрытьФормуМодально("Справочник.мКарточкиОбъектовРабот.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры
