
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьКнопок();
	//ЗаполнитьСубъектыРБ();
	//Элементы.ДекорацияОжидание.Заголовок = "Пожалуйста, подождите... " + Символы.ПС + "Очистка адресных сведений из программы."
КонецПроцедуры

&НаСервере
Функция ПолучитьЗагруженныеОбъекты();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	АдресныйКлассификатор.КодАдресногоОбъектаВКоде КАК КодСубъекта
	               |ИЗ
	               |	РегистрСведений.АдресныйКлассификатор КАК АдресныйКлассификатор";
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции


&НаКлиенте
Процедура ВыделитьВсе(Команда)
	Для Каждого СубъектРБ Из СубъектыРБ Цикл
		СубъектРБ.Пометка = Истина;
	КонецЦикла;
	КоличествоВыбранных = СубъектыРБ.Количество();
	УстановитьВидимостьКнопок();
КонецПроцедуры

Процедура УстановитьВидимостьКнопок()
	Если Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаВыбора Тогда
		Элементы.КнопкаОтмена.Видимость = Истина;
		Элементы.КнопкаОчистить.Видимость = Истина;
		Элементы.КнопкаОчистить.Доступность = (КоличествоВыбранных > 0);
		Элементы.КнопкаОчистить.КнопкаПоУмолчанию = Элементы.КнопкаОчистить.Доступность;
	Иначе
		Элементы.КнопкаОтмена.Видимость = Ложь;
		Элементы.КнопкаОчистить.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ОтменитьВыделитьВсе(Команда)
	Для Каждого СубъектРБ Из СубъектыРБ Цикл
		СубъектРБ.Пометка = Ложь;
	КонецЦикла;
	КоличествоВыбранных = 0;
	УстановитьВидимостьКнопок();
КонецПроцедуры


&НаКлиенте
Процедура СубъектыРБПриИзменении(Элемент)
	КоличествоВыбранных = СубъектыРБ.НайтиСтроки(Новый Структура("Пометка", Истина)).Количество();
	УстановитьВидимостьКнопок();
КонецПроцедуры


&НаКлиенте
Процедура Очистить(Команда)
	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаОжидания;
	УстановитьВидимостьКнопок();
	Помеченные = СубъектыРБ.НайтиСтроки(Новый Структура("Пометка", Истина));	
	Для Каждого Помеченный Из Помеченные Цикл
		Все = КоличествоОсталось(Помеченный.КодСубъекта);
		Осталось = КоличествоОсталось(Помеченный.КодСубъекта);
		Пока Осталось>0 Цикл
			Элементы.ДекорацияОжидание.Заголовок = "Пожалуйста, подождите... " + Символы.ПС + "Идет удаление адресных объектов по " + Помеченный.Представление + "." + Символы.ПС + "Удалено " + Строка(Все - Осталось) + " из " + Строка(Все) + ".";
			ОчиститьНаСервере();
			Осталось = КоличествоОсталось(Помеченный.КодСубъекта);
		КонецЦикла;
	КонецЦикла;
	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаРезультат;
	УстановитьВидимостьКнопок();
КонецПроцедуры

&НаСервере
Процедура ОчиститьНаСервере()
	Отбор = Новый Структура("Пометка", Истина);
	Помеченные = СубъектыРБ.НайтиСтроки(Отбор);
	Для Каждого Помеченный Из Помеченные Цикл
		НаборЗаписей = РегистрыСведений.АдресныйКлассификатор.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.КодАдресногоОбъектаВКоде.Установить(Помеченный.КодСубъекта);
		НаборЗаписей.Прочитать(); 
		Все = НаборЗаписей.Количество();
		Для Каждого Запись Из НаборЗаписей Цикл
			НаборЗаписей.Удалить(Запись);
		КонецЦикла;
		НаборЗаписей.Записать();
	КонецЦикла;
КонецПроцедуры

Функция КоличествоОсталось(КодСубъекта)
	НаборЗаписей = РегистрыСведений.АдресныйКлассификатор.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.КодАдресногоОбъектаВКоде.Установить(КодСубъекта);
	НаборЗаписей.Прочитать(); 
	Возврат НаборЗаписей.Количество();
КонецФункции