
&НаКлиенте
Процедура М_КаталогОбменЕРИПНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	ДиалогВыбораФайла.Заголовок = "Открыть каталог";
	Если ДиалогВыбораФайла.Выбрать() Тогда
		НаборКонстант.М_КаталогОбменЕРИП = ДиалогВыбораФайла.Каталог;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура М_ИспользоватьОбменЕРИППриИзменении(Элемент)
	Если НаборКонстант.М_ИспользоватьОбменЕРИП Тогда
		Элементы.М_КаталогОбменЕРИП.Доступность = Истина;
		Элементы.М_КодАбонентаДляЕРИП.Доступность = Истина;
		Элементы.М_НомерУслугиДляЕРИП.Доступность = Истина;
	Иначе	
		НаборКонстант.М_КаталогОбменЕРИП = "";
		НаборКонстант.М_КодАбонентаДляЕРИП = "";
		НаборКонстант.М_НомерУслугиДляЕРИП = "";
		Элементы.М_КаталогОбменЕРИП.Доступность = Ложь;
		Элементы.М_КодАбонентаДляЕРИП.Доступность = Ложь;
		Элементы.М_НомерУслугиДляЕРИП.Доступность = Ложь;
	КонецЕсли; 
КонецПроцедуры
