&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Смета = Параметры.Смета;
    СметаПриИзмененииНаСервере();
КонецПроцедуры

//&НаКлиенте
//Процедура СметаПриИзменении(Элемент)
//    СметаПриИзмененииНаСервере();
//КонецПроцедуры

&НаСервере
Процедура СметаПриИзмененииНаСервере()
    СметаТабДок = Справочники.мСметы.ПечатьСметы(Смета, Новый СписокЗначений); 
    
    КарточкаОбъектаРабот = Смета.КарточкаОбъектаРабот;
    
    КарточкаТабдок = Справочники.мКарточкиОбъектовРабот.ПечатьКарточкиОбъекта(КарточкаОбъектаРабот, Новый СписокЗначений); 
КонецПроцедуры

