
// УправлениеДоступом

// Заполняет структуру сведений о полях доступа 
Процедура ЗаполнитьСведенияОПоляхДоступа(СведенияОПолях) Экспорт 
	
	СведенияОПолях.ОбъектДоступа1 = "Пользователь"; 
	
КонецПроцедуры

// Заполняет параметр ПраваДоступа правами доступа, вычисляя их на 
// основании переданного дескриптора доступа.
// Если указан параметр ПротоколРасчетаПрав, то в него 
// заносится список данных, которые были использованы для расчета прав.
Процедура ЗаполнитьПраваДоступа(ДескрипторДоступа, ПраваДоступа, ПротоколРасчетаПрав) Экспорт
	
	ПраваПользователя = Новый Структура("Чтение, Добавление, Изменение, Удаление, УправлениеПравами",
									Истина, Истина, Истина, Истина, Ложь);
									
	ДокументооборотПраваДоступа.ДобавитьПользователяВСоответствиеПрав(
	ПраваДоступа,
	ДескрипторДоступа.ОбъектДоступа1,
	Неопределено,
	Неопределено,
	ПраваПользователя);
	
КонецПроцедуры

// Конец УправлениеДоступом
