// <Описание функции>
//
// Параметры
//  <ИсходныйДокумент>  - <Справочник.ПакетыДокументов> - элемент
//  <Владелец>  - <Справочник.мЭтапыДоговоров>
//
// Возвращаемое значение:
//   <Справочник.мДокументыЗаказчика> - ссылка на элемент
//
Функция СоздатьДокументЗаказчика(ИсходныйДокумент, Владелец) Экспорт
	
	НовыйЭл = Справочники.мДокументыЗаказчика.СоздатьЭлемент();
	НовыйЭл.Владелец = Владелец;
	НовыйЭл.ДокументЗаказчика = ИсходныйДокумент;
	НовыйЭл.Наименование = ИсходныйДокумент.Наименование;
	НовыйЭл.Обязательный = ИсходныйДокумент.Обязательный;
	Для каждого ПунктИсхДок Из ИсходныйДокумент.ПунктыДокумента Цикл
		НовПункт = НовыйЭл.ПунктыДокумента.Добавить();
		НовПункт.Пункт = ПунктИсхДок.Пункт;
	КонецЦикла; 
    НовыйЭл.Записать();
	
	Возврат НовыйЭл.Ссылка;
	
КонецФункции // СоздатьДокументЗаказчика(ИсходныйДокумент, Владелец)
