
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("ВидДокумента") Тогда
		Элементы.ВидДокумента.Видимость = Ложь;
		ВидДокумента = Параметры.Отбор.ВидДокумента;
	КонецЕсли;	
	
	Если Параметры.Свойство("Заголовок") Тогда
		Заголовок = Параметры.Заголовок;
	КонецЕсли;	
	
	Если Параметры.Свойство("ЭтоПредставлениеВСВД") Тогда
		ЭтоПредставлениеВСВД = Параметры.ЭтоПредставлениеВСВД;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если ЭтоПредставлениеВСВД Тогда
		
		Отказ = Истина;
		
		ЗначенияЗаполненияПараметр = Новый Структура("ВидДокумента", ВидДокумента);
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения, Заголовок, ЭтоПредставлениеВСВД", 
			ЗначенияЗаполненияПараметр, Заголовок, ЭтоПредставлениеВСВД);
		ОткрытьФорму("РегистрСведений.ВидыДокументовСВД.ФормаЗаписи", ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКлюч(ВидДокумента)
	
	ПараметрыКлюча = Новый Структура("ВидДокумента", 
		ВидДокумента);
	Ключ = РегистрыСведений.ВидыДокументовСВД.СоздатьКлючЗаписи(ПараметрыКлюча);
	Возврат Ключ;
	
КонецФункции

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ЭтоПредставлениеВСВД Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Ключ = ПолучитьКлюч(Элементы.Список.ТекущиеДанные.ВидДокумента);
		ПараметрыФормы = Новый Структура("Ключ, ЭтоПредставлениеВСВД", Ключ, ЭтоПредставлениеВСВД);
		
		ПараметрыФормы.Вставить("Заголовок", Заголовок);
		
		ОткрытьФорму("РегистрСведений.ВидыДокументовСВД.ФормаЗаписи", ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры


