&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Владелец) Тогда 
		Владелец = Параметры.Владелец;
		
		ОсновнойБанковскийСчет = ОбщегоНазначения.ПолучитьЗначениеРеквизита(
			Владелец, "ОсновнойБанковскийСчет");
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Список.Отбор, 
			"Владелец",
			Владелец);
			
		Элементы.Владелец.Видимость = Ложь;	
	Иначе	
		Элементы.ФормаСделатьОсновнымСчетом.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СделатьОсновнымСчетом(Команда)
	
	Если Элементы.Список.ТекущаяСтрока = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	
	ОсновнойБанковскийСчет = Элементы.Список.ТекущаяСтрока;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ОсновнойБанковскийСчет", ОсновнойБанковскийСчет);
	СтруктураПараметров.Вставить("Владелец", Владелец);
	
    Оповестить("ЗаписатьОсновнойБанковскийСчет", СтруктураПараметров, ЭтаФорма);		
	
КонецПроцедуры
