
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Параметр = Новый Структура("МассивПисем", ПараметрКоманды); 
	ПараметрыПечати = Неопределено;
 
	ОткрытьФорму("Обработка.Гр_ПечатьКонвертов.Форма", Параметр,,,,, Новый ОписаниеОповещения("ОбработкаКомандыЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    ПараметрыПечати = Результат;
    
КонецПроцедуры

