Процедура ПриСозданииНаСервере(Форма) Экспорт
	
	Имя = Форма.ИмяФормы;
	
	Если Имя = "РегистрСведений.АдресныйКлассификатор.Форма.ЗагрузкаАдресногоКлассификатора" Тогда
		ПриСозданииФормыЗагрузкаАдресногоКлассификатора(Форма);  
	ИначеЕсли Имя = "РегистрСведений.АдресныйКлассификатор.Форма.АдресныйКлассификатор" Тогда
		ПриСозданииФормыАдресныйКлассификатор(Форма);
	ИначеЕсли Имя = "РегистрСведений.АдресныйКлассификатор.Форма.ОчисткаАдресногоКлассификатора" Тогда
		ПриСозданииФормыОчисткаАдресногоКлассификатора(Форма);
	ИначеЕсли Имя = "Обработка.ВводКонтактнойИнформации.Форма.ВводАдреса" Тогда
		ПриСозданииФормыВводАдреса(Форма);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриСозданииФормыЗагрузкаАдресногоКлассификатора(Форма) 

	Элементы = Форма.Элементы;
	
    Элементы.СтатусЗагрузки.Заголовок ="Внимание: загрузка адресного классификатора может занять длительное время, которое зависит от количества загружаемой информации.";
	
КонецПроцедуры
	
Процедура ПриСозданииФормыОчисткаАдресногоКлассификатора(Форма) 

	Элементы = Форма.Элементы;

	
КонецПроцедуры

Процедура ПриСозданииФормыАдресныйКлассификатор(Форма)

	Элементы = Форма.Элементы;
	
	Элементы.ПроверитьОбновлениеАдресногоКлассификатора.Видимость = Ложь;
	Элементы.ПояснениеПроверитьОбновление.Видимость = Ложь;
    Элементы.ПояснениеЗагрузить.Заголовок = "Перейти к загрузке адресного классификатора из указанного каталога";
	
КонецПроцедуры

Процедура ПриСозданииФормыВводАдреса(Форма)
	Элементы = Форма.Элементы;
	Элементы.ПроверитьЗаполнениеАдреса.Видимость = Ложь;
	Элементы.ЗаполнитьПоПочтовомуИндексу.Видимость = Ложь;
КонецПроцедуры