#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Обработчик подсистемы "Дополнительные отчеты и обработки"
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ТекКорреспондент = Элементы.Список.ТекущаяСтрока;
	Если Не ЗначениеЗаполнено(ТекКорреспондент) Тогда
		Возврат;
	КонецЕсли; 
	Если Делопроизводство.КорреспондентЮрЛицо(ТекКорреспондент) Тогда
		Элементы.ЮрАдрес.Заголовок = "Юридический адрес";
		ЮрАдрес = М_ПравилаАвтозаполненияШаблонов.ПолучитьЮридическийАдрес(ТекКорреспондент);
	Иначе	
		Элементы.ЮрАдрес.Заголовок = "Домашний адрес";
	    ЮрАдрес = УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(ТекКорреспондент, ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ДомашнийАдресФизическогоЛица"));
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти
