#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает структуру полей папки мероприятий
//
// Возвращаемое значение:
//   Структура
//     Наименование
//     Родитель
//     Описание
//     Ответственный
//     ДатаСоздания
//
Функция ПолучитьСтруктуруПапки() Экспорт
	
	СтруктураПапкиМероприятий = Новый Структура;
	СтруктураПапкиМероприятий.Вставить("Наименование");
	СтруктураПапкиМероприятий.Вставить("Родитель");
	СтруктураПапкиМероприятий.Вставить("Описание");
	СтруктураПапкиМероприятий.Вставить("Ответственный");
	СтруктураПапкиМероприятий.Вставить("ДатаСоздания");
	
	Возврат СтруктураПапкиМероприятий;
	
КонецФункции

// Создает и записывает в БД папку мероприятий
//
// Параметры:
//   СтруктураПапкиМероприятий - Структура - структура полей папки мероприятия.
//
// Возвращаемое значение:
//   СправочникСсылка.ПапкиМероприятий
//
Функция СоздатьПапку(СтруктураПапкиМероприятий) Экспорт
	
	НоваяПапкаМероприятий = СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(НоваяПапкаМероприятий, СтруктураПапкиМероприятий);
	НоваяПапкаМероприятий.Записать();
	
	Возврат НоваяПапкаМероприятий.Ссылка;
	
КонецФункции

#Область ПраваДоступа

Функция ПолучитьПоляДоступа() Экспорт
	
	Возврат "Ссылка";
	
КонецФункции

// Заполняет переданный дескриптор доступа
Процедура ЗаполнитьДескрипторДоступа(ОбъектДоступа, ДескрипторДоступа) Экспорт
	
	ДокументооборотПраваДоступа.ЗаполнитьНастройкиДескриптора(ДескрипторДоступа, ОбъектДоступа);
	
КонецПроцедуры

Функция ЕстьМетодЗаполнитьПраваДоступа() Экспорт
	
	Возврат Истина;
	
КонецФункции

// Заполняет права по переданному дескриптору доступа 
Процедура ЗаполнитьПраваДоступа(ДескрипторДоступа, ПраваДоступа, ПротоколРасчетаПрав) Экспорт
	
	// Заполнение правил обработки настроек папки
	ПравилаОбработкиНастроек = Новый Соответствие;
	
	Настройка = "ЧтениеПапокИМероприятий";
	РазрешенныеДействия = Новый Массив;
	РазрешенныеДействия.Добавить("Чтение");
	ПравилаОбработкиНастроек.Вставить(Настройка, РазрешенныеДействия);
	
	Настройка = "ИзменениеПапокМероприятий";
	РазрешенныеДействия = Новый Массив;
	РазрешенныеДействия.Добавить("Добавление");
	РазрешенныеДействия.Добавить("Изменение");
	РазрешенныеДействия.Добавить("Удаление");
	ПравилаОбработкиНастроек.Вставить(Настройка, РазрешенныеДействия);
	
	Настройка = "УправлениеПравами";
	РазрешенныеДействия = Новый Массив;
	РазрешенныеДействия.Добавить("УправлениеПравами");
	ПравилаОбработкиНастроек.Вставить(Настройка, РазрешенныеДействия);
	
	// Получение прав по настройкам
	Справочники.ДескрипторыДоступаОбъектов.ЗаполнитьПраваПоНастройкамДескриптора(
		ДескрипторДоступа, ПраваДоступа, ПравилаОбработкиНастроек);
	
	// Добавление папки в протокол прав
	Если ПротоколРасчетаПрав <> Неопределено Тогда
		ПротоколРасчетаПрав.Добавить(НСтр("ru = 'Права на папку (см. Настройка прав папки)'"));
	КонецЕсли;
	
КонецПроцедуры

// Заполняет массив разрешенных прав на объекты, которые 
// хранятся в указанной папке.
Процедура ПолучитьПраваОтПапки(Папка, РазрешенныеПрава) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Поиск дескриптора папки
	ДескрипторДоступаПапки = РегистрыСведений.ДескрипторыДоступаДляОбъектов.НайтиДескрипторДляОбъекта(Папка);
	
	Если ДескрипторДоступаПапки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПолучитьРазрешенныеПраваОтВладельцаПоДескриптору(ДескрипторДоступаПапки, РазрешенныеПрава);
	
КонецПроцедуры	

// Заполняет массив разрешенных прав на объекты, которые 
// хранятся папке с указанным дескриптором
Процедура ПолучитьРазрешенныеПраваОтВладельцаПоДескриптору(ДескрипторДоступаПапки, РазрешенныеПрава) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(ДескрипторДоступаПапки) Тогда
		Возврат;
	КонецЕсли;
	
	// Заполнение правил обработки настроек дескриптора
	ПравилаОбработкиНастроек = Новый Соответствие;
	
	Настройка = "ЧтениеПапокИМероприятий";
	РазрешенныеДействия = Новый Массив;
	РазрешенныеДействия.Добавить("Чтение");
	ПравилаОбработкиНастроек.Вставить(Настройка, РазрешенныеДействия);
	
	Настройка = "ДобавлениеПапокИМероприятий";
	РазрешенныеДействия = Новый Массив;
	РазрешенныеДействия.Добавить("Добавление");
	ПравилаОбработкиНастроек.Вставить(Настройка, РазрешенныеДействия);
	
	Настройка = "ИзменениеПапокИМероприятий";
	РазрешенныеДействия = Новый Массив;
	РазрешенныеДействия.Добавить("Изменение");
	ПравилаОбработкиНастроек.Вставить(Настройка, РазрешенныеДействия);
	
	Настройка = "ПометкаУдаленияПапокИМероприятий";
	РазрешенныеДействия = Новый Массив;
	РазрешенныеДействия.Добавить("Удаление");
	ПравилаОбработкиНастроек.Вставить(Настройка, РазрешенныеДействия);
	
	// Заполнение прав по настройкам
	Справочники.ДескрипторыДоступаОбъектов.ЗаполнитьПраваПоНастройкамДескриптора(
		ДескрипторДоступаПапки,
		РазрешенныеПрава,
		ПравилаОбработкиНастроек);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
