&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ВыполнятьПроверкуЭПНаСервере") Тогда
		ВыполнятьПроверкуЭПНаСервере = Параметры.ВыполнятьПроверкуЭПНаСервере;
	Иначе
		ВыполнятьПроверкуЭПНаСервере = Константы.ВыполнятьПроверкуЭПНаСервере.Получить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВыполнятьПроверкуЭПНаСервере", ВыполнятьПроверкуЭПНаСервере);
	ОткрытьФорму("Справочник.ПрофилиНастроекКриптографии.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)

	Отказ = Истина;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", Элемент.ТекущаяСтрока);
	ПараметрыФормы.Вставить("ВыполнятьПроверкуЭПНаСервере", ВыполнятьПроверкуЭПНаСервере);
	ОткрытьФорму("Справочник.ПрофилиНастроекКриптографии.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

//МиСофт
&НаКлиенте
Процедура УстановитьКомпонентуКриптографии(Команда)
	//МиСофт+
	РаботаСЭПКлиент.УстановитьКомпонентуКриптографии();
	//МиСофт-
КонецПроцедуры

