////////////////////////////////////////////////////////////////////////////////
// Подсистема "Банки".
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Вызывается после запуска конфигурации, подключает обработчик ожидания.
//
Процедура ПослеНачалаРаботыСистемы() Экспорт
	
	//Мисофт удалено
	
КонецПроцедуры

// Возвращает навигационную ссылку для оповещений.
//
Функция НавигационнаяСсылкаФормыЗагрузки()
	//МиСофт удалено
КонецФункции

// Выводит соответствующее оповещение.
//
Процедура ОповеститьКлассификаторАктуален() Экспорт
	//МиСофт удалено
КонецПроцедуры

// Выводит соответствующее оповещение.
//
Процедура ОповеститьКлассификаторУспешноОбновлен() Экспорт
	
	//МиСофт удалено
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Обновление классификатора банков

// Выводит соответствующее оповещение.
//
Процедура ОповеститьКлассификаторУстарел() Экспорт
	
	//МиСофт удалено
	
КонецПроцедуры
	
#КонецОбласти
