#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ОперацииАдминистрирования = Обработки.НастройкаРазрешенийНаИспользованиеВнешнихРесурсов.ОперацииАдминистрированияВЗапросах(Параметры.ИдентификаторыЗапросов);
	Дельта = РаботаВБезопасномРежимеСлужебный.ДельтаИзмененийРазрешенийНаИспользованиеВнешнихРесурсов(Параметры.ИдентификаторыЗапросов, Истина);
	
	ПредставлениеРазрешений = Обработки.НастройкаРазрешенийНаИспользованиеВнешнихРесурсов.ПредставлениеРезультатаПримененияЗапросовНаИспользованиеВнешнихРесурсов(
		ОперацииАдминистрирования, Дельта);
	
КонецПроцедуры

#КонецОбласти