
&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
    Если Объект.Сотрудники.Количество() > 0 Тогда
        Результат = Вопрос("Табличная часть будет очищена! Продолжать?", РежимДиалогаВопрос.ОКОтмена, , КодВозвратаДиалога.Отмена);
        Если Результат = КодВозвратаДиалога.ОК Тогда
            Объект.Сотрудники.Очистить();    
        Иначе    
            Возврат;
        КонецЕсли; 
    КонецЕсли; 
    ПодразделениеПриИзмененииНаСервере(Объект.Подразделение);
    
КонецПроцедуры

&НаСервере
Процедура ПодразделениеПриИзмененииНаСервере(Подразделение)

    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |	СведенияОПользователях.Пользователь КАК Пользователь,
        |	СведенияОПользователях.Подразделение,
        |	СведенияОПользователях.Должность,
        |	СведенияОПользователях.ГрафикРаботы,
        |	СведенияОПользователях.Ранг,
        |	СведенияОПользователях.Пользователь.Наименование КАК ПользовательНаименование,
        |	мСведенияОСотрудникахСрезПоследних.Оклад
        |ИЗ
        |	РегистрСведений.СведенияОПользователях КАК СведенияОПользователях
        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.мСведенияОСотрудниках.СрезПоследних(
        |				&ДатаСреза,
        |				Подразделение = &Подразделение
        |					ИЛИ Подразделение.Родитель = &Подразделение) КАК мСведенияОСотрудникахСрезПоследних
        |		ПО СведенияОПользователях.Пользователь = мСведенияОСотрудникахСрезПоследних.Пользователь
        |			И СведенияОПользователях.Подразделение = мСведенияОСотрудникахСрезПоследних.Подразделение
        |			И СведенияОПользователях.Должность = мСведенияОСотрудникахСрезПоследних.Должность
        |ГДЕ
        |	(СведенияОПользователях.Подразделение = &Подразделение
        |			ИЛИ СведенияОПользователях.Подразделение.Родитель = &Подразделение)
        |	И НЕ СведенияОПользователях.Пользователь.Недействителен
        |
        |УПОРЯДОЧИТЬ ПО
        |	ПользовательНаименование";

    Запрос.УстановитьПараметр("Подразделение", Подразделение);
    Запрос.УстановитьПараметр("ДатаСреза", Объект.Дата);

    РезультатЗапроса = Запрос.Выполнить();

    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
        НоваяСтрока = Объект.Сотрудники.Добавить();
        ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
        НоваяСтрока.Период = Объект.Дата;
    КонецЦикла;

КонецПроцедуры
