
// УправлениеДоступом

Функция ПолучитьПоляДоступа() Экспорт
	
	Возврат "Пользователь";
	
КонецФункции
	
// Заполняет переданный дескриптор доступа 
Процедура ЗаполнитьДескрипторДоступа(ОбъектДоступа, ДескрипторДоступа) Экспорт
	
	// Пользователи
	Строка = ДескрипторДоступа.Пользователи.Добавить();
	Строка.Пользователь = ОбъектДоступа.Пользователь;
	
КонецПроцедуры

// Возвращает Истина, указывая тем самы что этот объект сам заполняет свои права 
Функция ЕстьМетодЗаполнитьПраваДоступа() Экспорт
	
	Возврат Истина;
	
КонецФункции	

// Заполняет параметр ПраваДоступа правами доступа, вычисляя их на 
// основании переданного дескриптора доступа.
// Если указан параметр ПротоколРасчетаПрав, то в него 
// заносится список данных, которые были использованы для расчета прав.
Процедура ЗаполнитьПраваДоступа(ДескрипторДоступа, ПраваДоступа, ПротоколРасчетаПрав) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Добавление участников процесса
	УчастникиДобавлены = Ложь;
	
	ПраваПользователя = Новый Структура("Чтение, Добавление, Изменение, Удаление, УправлениеПравами", 
									Истина, Истина, Истина, Истина, Ложь);
	
	Для каждого Эл Из ДескрипторДоступа.Пользователи Цикл
		
		ДокументооборотПраваДоступа.ДобавитьПользователяВСоответствиеПрав(
			ПраваДоступа,
			Эл.Пользователь, 
			Эл.ОсновнойОбъектАдресации, 
			Эл.ДополнительныйОбъектАдресации,
			ПраваПользователя);
			
		УчастникиДобавлены = Истина;
		
	КонецЦикла;	
	
	// Добавление участников в протокол расчета прав
	Если УчастникиДобавлены Тогда
		Если ПротоколРасчетаПрав <> Неопределено Тогда
			ПротоколРасчетаПрав.Добавить(НСтр("ru = 'Сотрудник ежедневного отчета'"));
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

// Конец УправлениеДоступом
