
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		Список.Отбор,
		"ШаблонБизнесПроцесса",
		Параметры.ШаблонБизнесПроцесса);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		ТекущийШаблонБизнесПроцесса = Элемент.ТекущиеДанные.ШаблонБизнесПроцесса; 
		ТекущийВидДокумента = Элемент.ТекущиеДанные.ВидДокумента; 
		ТекущаяОрганизация = Элемент.ТекущиеДанные.Организация;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура УдалитьПодпискиНаБизнесСобытия(ШаблонБизнесПроцесса, ВидДокумента, Организация)
	
	МассивВидовБизнесСобытий = БизнесСобытияВызовСервера.ПолучитьБизнесСобытияПоВидуДокумента(ВидДокумента);
	
	ОрганизацияДляУдаления = Организация;
	Если ОрганизацияДляУдаления = "Для всех организаций" Тогда
		ОрганизацияДляУдаления = Неопределено;
	КонецЕсли;	
	
	Для Каждого ВидСобытия Из МассивВидовБизнесСобытий Цикл
		
		БизнесСобытияВызовСервера.УдалитьПравилоАвтоматическогоЗапускаБизнесПроцессов(
			ВидСобытия, ШаблонБизнесПроцесса, ВидДокумента, ОрганизацияДляУдаления);
		
	КонецЦикла;	
		
КонецПроцедуры

&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	
	УдалитьПодпискиНаБизнесСобытия(
		ТекущийШаблонБизнесПроцесса, 
		ТекущийВидДокумента, 
		ТекущаяОрганизация);
	
КонецПроцедуры
