
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если ЗначениеЗаполнено(АктВыполненныхРабот) Тогда
		НаборЗаписей = РегистрыСведений.мСвязиЭСЧФ.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ЭСЧФ.Установить(Ссылка);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.ДокументРеализации = АктВыполненныхРабот;
		НоваяЗапись.ЭСЧФ = Ссылка;
		НаборЗаписей.Записать(Истина);
	КонецЕсли; 
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ЭтотОбъект.ПометкаУдаления <> Ссылка.ПометкаУдаления Тогда
		Если ЭтотОбъект.ПометкаУдаления Тогда
			// удалить связь
			НаборЗаписей = РегистрыСведений.мСвязиЭСЧФ.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ЭСЧФ.Установить(Ссылка);
			НаборЗаписей.Записать(Истина);
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры
