////////////////////////////////////////////////////////////////////////////////
// Подсистема "Электронная подпись"
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Путь модуля криптографии для текущего компьютера.
Функция ПутьМодуляКриптографии(ПрофильНастроекКриптографии = Неопределено) Экспорт
	
	ТипПлатформыСервера = ОбщегоНазначенияПовтИсп.ТипПлатформыСервера();
	
	Если ТипПлатформыСервера = ТипПлатформы.Windows_x86 ИЛИ ТипПлатформыСервера = ТипПлатформы.Windows_x86_64 Тогда
		Возврат ""; // в Windows путь модуля криптографии не нужен
	КонецЕсли;
	
	Если ПрофильНастроекКриптографии = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ИмяКомпьютера = ИмяКомпьютера();
	ПутьМодуля = "";
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПрофилиНастроекКриптографии.ПутиМодулейКриптографииСерверовLinux.(
		|		ПутьМодуляКриптографии
		|	)
		|ИЗ
		|	Справочник.ПрофилиНастроекКриптографии КАК ПрофилиНастроекКриптографии
		|ГДЕ
		|	ПрофилиНастроекКриптографии.Ссылка = &ПрофильНастроекКриптографии
		|	И ПрофилиНастроекКриптографии.ПутиМодулейКриптографииСерверовLinux.ИмяКомпьютера = &ИмяКомпьютера";
	Запрос.УстановитьПараметр("ИмяКомпьютера", ИмяКомпьютера);
	Запрос.УстановитьПараметр("ПрофильНастроекКриптографии", ПрофильНастроекКриптографии);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПутьМодуля = Выборка.ПутьМодуляКриптографии;
	КонецЕсли;
	
	Возврат ПутьМодуля;
	
КонецФункции

#КонецОбласти
