
Процедура ВыбратьШаблонБизнесПроцесса(Тип, ДоступныеЭлементы = Неопределено, ОписаниеОповещения = Неопределено) Экспорт
	
	Если Тип = "ШаблоныИсполнения" 
		Или Тип = "ШаблоныОзнакомления" 	
		Или Тип = "ШаблоныПоручения"
		Или Тип = "ШаблоныРассмотрения"
		Или Тип = "ШаблоныРегистрации"
		Или Тип = "ШаблоныСогласования"
		Или Тип = "ШаблоныПриглашения"
		Или Тип = "ШаблоныУтверждения"
		Или Тип = "ШаблоныКомплексныхБизнесПроцессов" Тогда 
		
		Если ТипЗнч(ДоступныеЭлементы) = Тип("СписокЗначений") И ДоступныеЭлементы.Количество() > 0 Тогда 
			ПараметрыФормы = Новый Структура("ДоступныеЭлементы", ДоступныеЭлементы);
			ОткрытьФорму(
				"Справочник." + Тип + ".ФормаВыбора",
				ПараметрыФормы,,,,,
				ОписаниеОповещения,
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе
			ОткрытьФорму(
				"Справочник." + Тип + ".ФормаВыбора",,,,,,
				ОписаниеОповещения,
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;	
		
	Иначе
		
		Если ТипЗнч(ДоступныеЭлементы) = Тип("СписокЗначений") И ДоступныеЭлементы.Количество() > 0 Тогда 
			ПараметрыФормы = Новый Структура("ДоступныеЭлементы", ДоступныеЭлементы);
			ОткрытьФорму(
				"Справочник.ШаблоныСоставныхБизнесПроцессов.Форма.ФормаВыбораПоТипу",
				ПараметрыФормы,,,,,
				ОписаниеОповещения,
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе
			ПараметрыФормы = Новый Структура("Отбор", Новый Структура("ТипШаблона", Тип));
			ОткрытьФорму(
				"Справочник.ШаблоныСоставныхБизнесПроцессов.Форма.ФормаВыбораПоТипу",
				ПараметрыФормы,,,,,
				ОписаниеОповещения,
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
