
&НаСервере
Процедура ЗаполнитьНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	мАктированиеАкты.Договор,
		|	мАктированиеАкты.ЭтапДоговора,
		|	мАктированиеАкты.НомерАкта,
		|	мАктированиеАкты.ДатаАкта,
		|	мАктированиеАкты.Сумма,
		|	мАктированиеАкты.НДС,
		|	ИСТИНА КАК Пометка,
		|	СвязиДокументов.СвязанныйДокумент КАК Акт,
		|	мРеквизитыАктовВыполненныхРабот.СостояниеАкта КАК Состояние,
		|	мАктированиеАкты.Договор.Корреспондент.ЮрФизЛицо КАК ВидЛица
		|ИЗ
		|	Документ.мАктирование.Акты КАК мАктированиеАкты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязиДокументов КАК СвязиДокументов
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.мРеквизитыАктовВыполненныхРабот КАК мРеквизитыАктовВыполненныхРабот
		|			ПО СвязиДокументов.СвязанныйДокумент = мРеквизитыАктовВыполненныхРабот.Владелец
		|				И (СвязиДокументов.СвязанныйДокумент.ВидДокумента = &ВидДокумента)
		|				И (НЕ мРеквизитыАктовВыполненныхРабот.Владелец.ПометкаУдаления)
		|		ПО мАктированиеАкты.Договор = СвязиДокументов.Документ
		|			И мАктированиеАкты.НомерАкта = СвязиДокументов.СвязанныйДокумент.РегистрационныйНомер
		|			И (СвязиДокументов.ТипСвязи = &ТипСвязи)
		|			И (НЕ мРеквизитыАктовВыполненныхРабот.Владелец.ПометкаУдаления)
		|ГДЕ
		|	мАктированиеАкты.Ссылка = &Актирование";
	
	Запрос.УстановитьПараметр("ВидДокумента", Справочники.ВидыВнутреннихДокументов.АктВыполненныхРабот);
	Запрос.УстановитьПараметр("Актирование", Актирование);
	Запрос.УстановитьПараметр("ТипСвязи", Справочники.ТипыСвязей.Имеет);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ЗначениеВРеквизитФормы(Результат, "Акты");
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	Состояние("Выполняется чтение документа...");
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	Для каждого Стр Из Акты Цикл
		Стр.Пометка = Истина;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	Для каждого Стр Из Акты Цикл
		Стр.Пометка = Ложь;
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура СоздатьАктыНаСервере()
	Для каждого Стр Из Акты Цикл
		Если Не Стр.Пометка Тогда
			Продолжить;
		КонецЕсли; 
		НачатьТранзакцию();
		
		Акт = Справочники.ВнутренниеДокументы.СоздатьЭлемент();
		Акт.ДатаРегистрации = Стр.ДатаАкта;
		Акт.РегистрационныйНомер = Стр.НомерАкта;
		Акт.Папка = Справочники.ПапкиВнутреннихДокументов.мАктыВыполненныхРабот;
		Акт.ВидДокумента = Справочники.ВидыВнутреннихДокументов.АктВыполненныхРабот;
		Акт.Заголовок = "Акт выполненных работ " + Стр.НомерАкта + " " + Формат(Стр.ДатаАкта, "ДЛФ=D");;
		Акт.ГрифДоступа = Стр.Договор.ГрифДоступа;
		Акт.Организация = Стр.Договор.Организация;
		Акт.ВопросДеятельности = Стр.Договор.ВопросДеятельности;
		Акт.ЭтапДоговора = Стр.ЭтапДоговора;
		Акт.Подготовил = Пользователи.ТекущийПользователь();
		Акт.Утвердил = Стр.Договор.Утвердил;
		Акт.Корреспондент = Стр.Договор.Корреспондент;
		Акт.КонтактноеЛицо = Стр.Договор.КонтактноеЛицо;
		Акт.ПодписалОтКорреспондента = Стр.Договор.ПодписалОтКорреспондента;
		Акт.ДатаСоздания = ТекущаяДатаСеанса();
		Акт.Валюта = Стр.Договор.Валюта;
		Акт.Сумма = Стр.Сумма;
		
		Если ЗначениеЗаполнено(Акт.Корреспондент) Тогда 
			Строка = Акт.Корреспонденты.Добавить();
			Строка.Корреспондент = Акт.Корреспондент;
			Строка.КонтактноеЛицо = Акт.КонтактноеЛицо;
			Строка.ПодписалОтКорреспондента = Акт.ПодписалОтКорреспондента;		
		КонецЕсли;
		
		ДопРеквизиты = Акт.ДополнительныеСвойства;
		ДопРеквизиты.Вставить("ЭтапДоговора", Стр.ЭтапДоговора);
		ДопРеквизиты.Вставить("СтавкаНДС", Стр.ЭтапДоговора.СтавкаНДС);
		ДопРеквизиты.Вставить("Сумма", Стр.Сумма);
		ДопРеквизиты.Вставить("СуммаНДС", Стр.НДС);
		ДопРеквизиты.Вставить("ОсвобождениеОтНДС", Стр.ЭтапДоговора.ОсвобождениеОтНДС);
		ДопРеквизиты.Вставить("СостояниеАкта", Перечисления.мСостоянияАктовВыполненныхРабот.Подготовлен);
		ДопРеквизиты.Вставить("ВидАкта", Перечисления.мВидыАктовВыполненныхРабот.Обычный);
		
		Акт.Записать();
		
		//ДопРекв = Справочники.мРеквизитыАктовВыполненныхРабот.СоздатьЭлемент();
		//ДопРекв.Владелец = Акт.Ссылка;
		//ДопРекв.ОсвобождениеОтНДС = Стр.ЭтапДоговора.ОсвобождениеОтНДС;
		//ДопРекв.СостояниеАкта = Перечисления.мСостоянияАктовВыполненныхРабот.Подготовлен;
		//ДопРекв.СтавкаНДС = Стр.ЭтапДоговора.СтавкаНДС;
		//ДопРекв.СуммаНДС = Стр.ЭтапДоговора.СуммаНДС;
		//ДопРекв.ЭтапДоговора = Стр.ЭтапДоговора;
		//ДопРекв.Записать();
		
		ЗафиксироватьТранзакцию();
		
		Стр.Акт = Акт.Ссылка;
		Стр.Состояние = Перечисления.мСостоянияАктовВыполненныхРабот.Подготовлен;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура СоздатьАкты(Команда)
	Состояние("Выполняется создание актов...");
	СоздатьАктыНаСервере();
	ПоказатьОповещениеПользователя("Акты созданы!");
КонецПроцедуры

&НаСервере
Процедура УстановитьСтатусНаСервере()
	Для каждого Стр Из Акты Цикл
		Если Стр.Пометка Тогда
			Если ЗначениеЗаполнено(Стр.Акт) Тогда
				Акт = Стр.Акт.ПолучитьОбъект();
				
				ДопРеквизиты = Акт.ДополнительныеСвойства;
				//ДопРеквизиты.Вставить("ЭтапДоговора", Стр.ЭтапДоговора);
				//ДопРеквизиты.Вставить("СтавкаНДС", Стр.ЭтапДоговора.СтавкаНДС);
				//ДопРеквизиты.Вставить("СуммаНДС", Стр.ЭтапДоговора.СуммаНДС);
				//ДопРеквизиты.Вставить("ОсвобождениеОтНДС", Стр.ЭтапДоговора.ОсвобождениеОтНДС);
				ДопРеквизиты.Вставить("СостояниеАкта", Состояние);
				
				Акт.ОбменДанными.Загрузка = Истина;
				Акт.Записать();
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатус(Команда)
	Если ВвестиЗначение(Состояние, "Выберите состояние акта") Тогда  
		УстановитьСтатусНаСервере();
		ПоказатьОповещениеПользователя("Состояние актов изменено!");
	КонецЕсли;
КонецПроцедуры
