#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаголовокОтчета = "";
	
	ВыводитьДатуИМестоПроведения = Истина;
	ВыводитьПрограмму = Истина;
	ВыводитьУчастников = Истина;
	ВыводитьПредседателяИСекретаря = Истина;
	ВыводитьПротокол = Истина;
	
	ВОтдельномДокументе = Перечисления.ТипыПрограммыПротокола.ВОтдельномДокументе;
	ВТаблице = Перечисления.ТипыПрограммыПротокола.ВТаблице;
	ВМатериалах = Перечисления.ТипыПрограммыПротокола.ВМатериалах;
	
	Мероприятие = Параметры.ПараметрКоманды[0];
	РеквизитыМероприятия = 
		ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Мероприятие,
			"ТипПротокола, ТипПрограммы, ВидМероприятия");
			
	ТипПротокола = РеквизитыМероприятия.ТипПротокола;
	ТипПрограммы = РеквизитыМероприятия.ТипПрограммы;		
	ПротокольноеМероприятие = РеквизитыМероприятия.ВидМероприятия.ПротокольноеМероприятие;
	
	Элементы.ВыводитьПротокол.Видимость = (ТипПротокола = ВТаблице И ПротокольноеМероприятие);
	Элементы.ВыводитьПрограмму.Видимость = (ТипПрограммы = ВТаблице);
	Элементы.ВыводитьПредседателяИСекретаря.Видимость = ПротокольноеМероприятие;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Печать(Команда)
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ЗаголовокОтчета", ЗаголовокОтчета);
	ПараметрыПечати.Вставить("ВыводитьДатуИМестоПроведения", ВыводитьДатуИМестоПроведения);
	ПараметрыПечати.Вставить("ВыводитьУчастников", ВыводитьУчастников);
	
	Если ПротокольноеМероприятие Тогда 
		ПараметрыПечати.Вставить("ВыводитьПредседателяИСекретаря", ВыводитьПредседателяИСекретаря);
	Иначе
		ПараметрыПечати.Вставить("ВыводитьПредседателяИСекретаря", Ложь);
	КонецЕсли;
	
	Если ТипПрограммы = ВТаблице Тогда 
		ПараметрыПечати.Вставить("ВыводитьПрограмму", ВыводитьПрограмму);
	Иначе
		ПараметрыПечати.Вставить("ВыводитьПрограмму", Ложь);
	КонецЕсли;
	
	Если ТипПротокола = ВТаблице И ПротокольноеМероприятие Тогда 
		ПараметрыПечати.Вставить("ВыводитьПротокол", ВыводитьПротокол);
	Иначе	
		ПараметрыПечати.Вставить("ВыводитьПротокол", Ложь);	
	КонецЕсли;
	
	Закрыть();
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Справочник.Мероприятия", "Карточка", Параметры.ПараметрКоманды, ВладелецФормы, ПараметрыПечати);
	
КонецПроцедуры

#КонецОбласти