
////////////////////////////////////////////////////////////////////////////////
// Обзор процессов вызов сервера: содержит процедуры и функции по формированию
//                                HTML-обзора процессов и их шаблонов.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Функция ПолучитьОбзорПроцесса(Процесс) Экспорт
	
	HTMLТекст = ОбзорПроцессовВызовСервераПереопределяемый.ПолучитьОбзорПроцесса(Процесс);
	Если ЗначениеЗаполнено(HTMLТекст) Тогда 
		Возврат HTMLТекст;
	КонецЕсли;
	
	HTMLТекст = "<html>"
		+ "<head>"
		+ ОбзорОбъектовКлиентСервер.СтильHTML()
		+ "<body>";
		
	Если ЗначениеЗаполнено(Процесс) Тогда
		
		HTMLТекст = HTMLТекст + "<table>";
		
		HTMLТекст = HTMLТекст + "<tr>";
		HTMLТекст = HTMLТекст + "<td>";
	
		МетаданныеПроцесса = Процесс.Метаданные();
		РеквизитыПроцесса = 
			"Наименование, Описание";
		ДобавитьРеквизитОписаниеВОбзор = Истина;
		Если МетаданныеПроцесса.Реквизиты.Найти("Описание") = Неопределено Тогда
			РеквизитыПроцесса = СтрЗаменить(РеквизитыПроцесса, ", Описание", "");
			ДобавитьРеквизитОписаниеВОбзор = Ложь;
		КонецЕсли;
		
		РеквизитыПроцесса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Процесс, РеквизитыПроцесса);
		
		Если ЗначениеЗаполнено(РеквизитыПроцесса.Наименование) Тогда
			HTMLТекст = HTMLТекст + "<B>";
			ОбзорОбъектовКлиентСервер.ДобавитьРеквизит(
				HTMLТекст, "", РеквизитыПроцесса.Наименование);
			HTMLТекст = HTMLТекст + "</B>";
		КонецЕсли;
		
		Если ДобавитьРеквизитОписаниеВОбзор И ЗначениеЗаполнено(РеквизитыПроцесса.Описание) Тогда
			HTMLТекст = HTMLТекст + "<p>";
			ОбзорОбъектовКлиентСервер.ДобавитьРеквизит(HTMLТекст, "", РеквизитыПроцесса.Описание);
		КонецЕсли;
		
		Попытка
			МенеджерШаблона = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Процесс);
			МенеджерШаблона.ЗаполнитьОбзорПроцесса(HTMLТекст, Процесс);
		Исключение
		КонецПопытки;
		
		HTMLТекст = HTMLТекст + "</td>";
		HTMLТекст = HTMLТекст + "</tr>";
		
		HTMLТекст = HTMLТекст + "</table>";
		
	КонецЕсли;
	
	HTMLТекст = HTMLТекст + "</body></html>";
	ОбзорОбъектовКлиентСервер.УдалитьТег(HTMLТекст, "script");
	
	Возврат HTMLТекст;
	
КонецФункции

Функция СсылкаНаПроцессПоУникальномуИдентификатору(УникальныйИдентификатор, НаименованиеПроцесса) Экспорт
	
	Возврат БизнесПроцессы[НаименованиеПроцесса].ПолучитьСсылку(УникальныйИдентификатор);
	
КонецФункции

Функция Цвет_ЗакрытыеНеактуальныеЗаписи() Экспорт
	
	Возврат "808080";
	
КонецФункции

#КонецОбласти
