&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Пользователь") Тогда
		Пользователь = Параметры.Пользователь; 
	Иначе
		Пользователь = Справочники.Пользователи.ПустаяСсылка();	
	КонецЕсли; 
	
	ЗаполнитьСписок();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписок()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	мАктуальныеВидыРаботФизЛиц.ВидРаботФизЛиц КАК ВидРаботы
		|ПОМЕСТИТЬ Актуальные
		|ИЗ
		|	РегистрСведений.мАктуальныеВидыРаботФизЛиц КАК мАктуальныеВидыРаботФизЛиц
		|ГДЕ
		|	мАктуальныеВидыРаботФизЛиц.Пользователь = &Пользователь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	мВидыРаботФизЛица.Ссылка КАК ВидРабот,
		|	ВЫБОР
		|		КОГДА мВидыРаботФизЛица.Ссылка В (Актуальные.ВидРаботы)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Выбран
		|ИЗ
		|	Справочник.мВидыРаботФизЛица КАК мВидыРаботФизЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ Актуальные КАК Актуальные
		|		ПО мВидыРаботФизЛица.Ссылка = Актуальные.ВидРаботы
		|ГДЕ
		|	НЕ мВидыРаботФизЛица.ПометкаУдаления
		|	И НЕ мВидыРаботФизЛица.ЭтоГруппа
		|
		|УПОРЯДОЧИТЬ ПО
		|	мВидыРаботФизЛица.Наименование";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ЗначениеВРеквизитФормы(Результат, "Список");
	
КонецПроцедуры

&НаСервере
Процедура ОкНаСервере()
	НаборЗаписей = РегистрыСведений.мАктуальныеВидыРаботФизЛиц.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Прочитать();
	
	Пока НаборЗаписей.Количество() > 0 Цикл
		НаборЗаписей.Удалить(0);
		НаборЗаписей.Записать();
	КонецЦикла;
	
	Для каждого Стр Из Список Цикл
		Если Стр.Выбран Тогда
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Пользователь = Пользователь;
			НоваяЗапись.ВидРаботФизЛиц = Стр.ВидРабот;
		КонецЕсли; 
	КонецЦикла; 
	НаборЗаписей.Записать();
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	ОкНаСервере();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Пометить(Команда)
	Для каждого Стр Из Список Цикл
		Стр.Выбран = Истина;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометки(Команда)
	Для каждого Стр Из Список Цикл
		Стр.Выбран = Ложь;
	КонецЦикла; 
КонецПроцедуры
