////////////////////////////////////////////////////////////////////////////////
// Программный интерактивного запуска бизнес-процессов

// Получает шаблоны для автозапуска интерактивного
Функция ПолучитьШаблоныДляАвтоЗапуска(ВидИнтерактивногоБизнесСобытия, ВидДокумента, Организация, Документ) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	НастройкаШаблоновБизнесПроцессов.ШаблонБизнесПроцесса КАК ШаблонБизнесПроцесса,
	               |	НастройкаШаблоновБизнесПроцессов.ВидДокумента,
	               |	НастройкаШаблоновБизнесПроцессов.ИнтерактивныйЗапуск,
	               |	НастройкаШаблоновБизнесПроцессов.ВидИнтерактивногоСобытия,
	               |	НастройкаШаблоновБизнесПроцессов.Условие
	               |ИЗ
	               |	РегистрСведений.НастройкаШаблоновБизнесПроцессов КАК НастройкаШаблоновБизнесПроцессов
	               |ГДЕ
	               |	НастройкаШаблоновБизнесПроцессов.ВидДокумента = &ВидДокумента
	               |	И (НастройкаШаблоновБизнесПроцессов.Организация = &Организация
	               |			ИЛИ НастройкаШаблоновБизнесПроцессов.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
				   |			ИЛИ &Организация = НЕОПРЕДЕЛЕНО)
	               |	И НастройкаШаблоновБизнесПроцессов.ИнтерактивныйЗапуск = ИСТИНА
	               |	И НастройкаШаблоновБизнесПроцессов.ВидИнтерактивногоСобытия = &ВидИнтерактивногоСобытия";
				   
	Запрос.УстановитьПараметр("ВидДокумента", ВидДокумента);
	Запрос.УстановитьПараметр("ВидИнтерактивногоСобытия", ВидИнтерактивногоБизнесСобытия);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоОрганизациям") Тогда
		Запрос.УстановитьПараметр("Организация", Организация);
	Иначе	
		Запрос.УстановитьПараметр("Организация", Неопределено);
	КонецЕсли;	
	
	Таблица = Запрос.Выполнить().Выгрузить();	
	
	СписокЗначений = Новый СписокЗначений;
	ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	
	Для Каждого Строка Из Таблица Цикл
		
		Если ДокументооборотПраваДоступа.ПолучитьПраваПоОбъекту(Строка.ШаблонБизнесПроцесса).Чтение Тогда
			
			// Проверим условие маршрутизации
			Если РаботаСУсловиямиМаршрутизации.ПроверитьПрименимостьУсловияМаршрутизацииКОбъекту(Документ, Строка.Условие) Тогда
				
				СписокЗначений.Добавить(Строка.ШаблонБизнесПроцесса, Строка(Строка.ШаблонБизнесПроцесса), Истина);
				
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат СписокЗначений;
	
КонецФункции

