&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Установка видимости кнопки Настройки
	ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	Если мРазное.УПользователяЕстьРоль(ТекущийПользователь, "мРуководительПроизводства") Тогда
		Для каждого Кнопка Из ЭтаФорма.ПодчиненныеЭлементы.ОсновнаяКоманднаяПанель.ПодчиненныеЭлементы Цикл
			Если Кнопка.Имя = "ФормаНастройки"  Тогда  //или Кнопка.Имя = "ФормаВарианты"
				Кнопка.Видимость = Ложь;
				Кнопка.Доступность = Ложь;
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойВариантаНаСервере(Настройки)

	ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	Если мРазное.УПользователяЕстьРоль(ТекущийПользователь, "мРуководительПроизводства") Тогда
		// Для Руководителей производства убираем доступность к отборам
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Подразделение", РаботаСПользователями.ПолучитьПодразделение(ТекущийПользователь));
		
		мОтчетыВызовСервера.СкрытьПараметрыУстановитьЗначения(Настройки.ПараметрыДанных, СтруктураПараметров);
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойПользовательскихНастроекНаСервере(Настройки)
	ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	Если мРазное.УПользователяЕстьРоль(ТекущийПользователь, "мРуководительПроизводства") Тогда
		// Для Руководителей производства убираем доступность к отборам
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Подразделение", РаботаСПользователями.ПолучитьПодразделение(ТекущийПользователь));
		
		мОтчетыВызовСервера.СкрытьПараметрыУстановитьЗначения(Настройки, СтруктураПараметров);
		
		//ПараметрПодразделение =  Новый ПараметрКомпоновкиДанных("Подразделение");
		//ПодразделениеПользователя = РаботаСПользователями.ПолучитьПодразделение(ТекущийПользователь);
		//Для каждого Настройка Из Настройки.Элементы Цикл
		//	Если ТипЗнч(Настройка) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
		//		Если ТипЗнч(Настройка.ПравоеЗначение) = Тип("СправочникСсылка.СтруктураПредприятия") Тогда
		//			Настройка.ЛевоеЗначение = "Подразделение";
		//			Настройка.ПравоеЗначение = ПодразделениеПользователя;
		//			Настройка.Использование = Истина;
		//			Настройка.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		//		КонецЕсли; 
		//	Иначе
		//		Если Настройка.Параметр = ПараметрПодразделение Тогда
		//			Настройка.Значение = ПодразделениеПользователя;
		//			Настройка.Использование = Истина;
		//			Настройка.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		//		КонецЕсли; 
		//	КонецЕсли; 
		//КонецЦикла;
	КонецЕсли; 
КонецПроцедуры
