
&НаКлиенте
Процедура Выгрузить(Команда)
	Если Не ЗначениеЗаполнено(КаталогВыгрузки) Тогда
		Сообщить("Выберите каталог");
		Возврат;
	КонецЕсли; 
	
	ПутиДоговоров.Очистить();
	
	ОпОп = Новый ОписаниеОповещения("ПослеПоискаФайлов", ЭтотОбъект);
	НачатьПоискФайлов(ОпОп, КаталогВыгрузки, "*.pdf", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПоискаФайлов(НайденныеФайлы, ДопПараметры) Экспорт
	
	ОбработатьНайденныеФайлы(НайденныеФайлы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНайденныеФайлы(НайденныеФайлы)
	СпНомеровДог = Новый СписокЗначений;
	
	Файлы.Очистить();
	ФайлыДел.Очистить();
	
	Для каждого Файл Из НайденныеФайлы Цикл
		Если Найти(Файл.ИмяБезРасширения, "дог") Тогда
			Продолжить;
		КонецЕсли; 
		
		Если Найти(Файл.ИмяБезРасширения, "доп") > 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		Позиция = СтрНайти(Файл.ИмяБезРасширения, "-", НаправлениеПоиска.СКонца, , 1);
		НомерДог = Лев(Файл.ИмяБезРасширения, Позиция-1);
		Если СпНомеровДог.НайтиПоЗначению(НомерДог) = Неопределено Тогда
			СпНомеровДог.Добавить(НомерДог);
			
			НовыйПуть = ПутиДоговоров.Добавить();
			НовыйПуть.НомерДог = НомерДог;
			НовыйПуть.Путь = Файл.Путь;
			
			//НовСтр = Файлы.Добавить();
			//НовСтр.НомерДог = НомерДог;
			//НовСтр.Путь = Файл.Путь;
			
		КонецЕсли; 
		
	КонецЦикла;
	
	ЗаполнитьТаблицуФайлов(СпНомеровДог);
	
	ЗаписатьФайлыНаДиск();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуФайлов(СпНомеровДог)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВнутренниеДокументы.Ссылка КАК Договор,
		|	ВнутренниеДокументы.РегистрационныйНомер
		|ПОМЕСТИТЬ Договоры
		|ИЗ
		|	Справочник.ВнутренниеДокументы КАК ВнутренниеДокументы
		|ГДЕ
		|	ВнутренниеДокументы.РегистрационныйНомер В(&СпНомеровДог)
		|	И ВнутренниеДокументы.ВидДокумента.Родитель = &ВидДокументаДоговоры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(СвязиДокументов.СвязанныйДокумент КАК Справочник.ВнутренниеДокументы) КАК Дело
		|ПОМЕСТИТЬ Дела
		|ИЗ
		|	РегистрСведений.СвязиДокументов КАК СвязиДокументов
		|ГДЕ
		|	ВЫРАЗИТЬ(СвязиДокументов.Документ КАК Справочник.ВнутренниеДокументы) В
		|			(ВЫБРАТЬ
		|				Договоры.Договор
		|			ИЗ
		|				Договоры КАК Договоры)
		|	И СвязиДокументов.ТипСвязи = &ТипСвязи
		|	И ВЫРАЗИТЬ(СвязиДокументов.СвязанныйДокумент КАК Справочник.ВнутренниеДокументы).ВидДокумента = &ВидДокументаДело
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Файлы.Ссылка КАК Файл,
		|	Файлы.ТекущаяВерсияПутьКФайлу,
		|	Файлы.ТекущаяВерсияТом.ПолныйПутьWindows КАК ТекущаяВерсияТом,
		|	Договоры.РегистрационныйНомер КАК НомерДог,
		|	Договоры.Договор КАК Договор
		|ИЗ
		|	Договоры КАК Договоры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Файлы КАК Файлы
		|		ПО Договоры.Договор = Файлы.ВладелецФайла
		|			И (Файлы.ТекущаяВерсияРасширение = ""pdf"")
		|			И (Файлы.Наименование ПОДОБНО ""Дог%"")
		|			И (Файлы.ВладелецФайла В
		|				(ВЫБРАТЬ
		|					Договоры.Договор
		|				ИЗ
		|					Договоры КАК Договоры)) и
		|	НЕ Файлы.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Файлы.Ссылка КАК Файл,
		|	Файлы.ТекущаяВерсияПутьКФайлу,
		|	Файлы.ТекущаяВерсияТом.ПолныйПутьWindows КАК ТекущаяВерсияТом,
		|	Дела.Дело КАК Дело,
		|	Дела.Дело.РегистрационныйНомер КАК НомерДела
		|ИЗ
		|	Дела КАК Дела
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Файлы КАК Файлы
		|		ПО Дела.Дело = Файлы.ВладелецФайла И
		|	НЕ Файлы.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ВидДокументаДоговоры", Справочники.ВидыВнутреннихДокументов.ДоговораЗемлеустроительныхРабот);
	Запрос.УстановитьПараметр("ВидДокументаДело", Справочники.ВидыВнутреннихДокументов.Дело);
	Запрос.УстановитьПараметр("СпНомеровДог", СпНомеровДог);
	Запрос.УстановитьПараметр("ТипСвязи", Справочники.ТипыСвязей.Имеет);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Выборка = Результат[2].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		//Отбор = Новый Структура("НомерДог", Выборка.НомерДог);
		//ИскСтрока = Файлы.НайтиСтроки(Отбор);
		//Если ИскСтрока.Количество() > 0 Тогда
		
		ИскСтрока = Файлы.Добавить();
		ИскСтрока.НомерДог = Выборка.НомерДог;
		ИскСтрока.Договор = Выборка.Договор;
		ИскСтрока.ТекущаяВерсияПутьКФайлу = Выборка.ТекущаяВерсияПутьКФайлу;
		ИскСтрока.ТекущаяВерсияТом = Выборка.ТекущаяВерсияТом;
		ИскСтрока.Файл = Выборка.Файл;
		
			//ИскСтрока[0].Договор = Выборка.Договор;
			//ИскСтрока[0].ТекущаяВерсияПутьКФайлу = Выборка.ТекущаяВерсияПутьКФайлу;
			//ИскСтрока[0].ТекущаяВерсияТом = Выборка.ТекущаяВерсияТом;
			//ИскСтрока[0].Файл = Выборка.Файл;
		//КонецЕсли; 
	КонецЦикла;
	
	Выборка = Результат[3].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ИмяФайлаДела = СтрЗаменить(Выборка.НомерДела, "/", "-");
		Если Не ЗначениеЗаполнено(Выборка.Файл) Тогда
			// файла нет
			Продолжить;
		КонецЕсли; 
		
		Если СокрЛП(ИмяФайлаДела) = СокрЛП(Выборка.Файл.Наименование) Тогда
			// это скан самого дела
			Продолжить;
		КонецЕсли; 
		
		Позиция = СтрНайти(Выборка.НомерДела, "/", НаправлениеПоиска.СКонца, , 1);
		НомерДог = Лев(Выборка.НомерДела, Позиция-1);
		
		Стр = ФайлыДел.Добавить();
		Стр.НомерДог = НомерДог;
		Стр.Дело = Выборка.Дело;
		Стр.ТекущаяВерсияПутьКФайлу = Выборка.ТекущаяВерсияПутьКФайлу;
		Стр.ТекущаяВерсияТом = Выборка.ТекущаяВерсияТом;
		Стр.Файл = Выборка.Файл;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьФайлыНаДиск()
	Док = Новый ТекстовыйДокумент;
	МассивОписаний=Новый Массив;
	Всего = Файлы.Количество() + ФайлыДел.Количество();
	Сч=0;
	Для каждого Стр Из Файлы Цикл
		Сч = Сч+1;
		Состояние("Поиск договоров... "+сч+" из "+Всего, Окр(Сч/Всего*100));
		ИмяФайлаНаСервере = Стр.ТекущаяВерсияТом+Стр.ТекущаяВерсияПутьКФайлу;
		
		Если Не ЗначениеЗаполнено(Стр.Договор) Тогда
			// не найден договор
			Док.ДобавитьСтроку("Не найден договор " + Стр.НомерДог);
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ИмяФайлаНаСервере) Тогда
			// не найден файл договора
			Док.ДобавитьСтроку("Не найден скан договора " + Стр.НомерДог);
			Продолжить;
		КонецЕсли;
		
		Адрес = ПолучитьФайл(ИмяФайлаНаСервере);
		
		ИмяФайла = СтрЗаменить(Стр.НомерДог, "/", "_");
		ИмяФайла = СтрЗаменить(ИмяФайла, "\", "_");
		ИмяФайла = СтрЗаменить(ИмяФайла, ".", "_");
		ИмяФайла = ИмяФайла+" дог.pdf";
		
		Отбор = Новый Структура("НомерДог", Стр.НомерДог);
		ИскПуть = ПутиДоговоров.НайтиСтроки(Отбор);
		Если ИскПуть.Количество()=0 Тогда
			// не знаем подкаталог для сохранения
			Продолжить;
		КонецЕсли;
		
		Путь = ИскПуть[0].Путь;
		
		ИмяФайлаНаКлиенте = Путь + "/" + ИмяФайла;
		Описание = Новый ОписаниеПередаваемогоФайла(ИмяФайлаНаКлиенте, Адрес);
		МассивОписаний.Добавить(Описание);
		
		// получение доп файлов по делу
		ИскСтроки = ФайлыДел.НайтиСтроки(Отбор);
		
		Если ИскСтроки.Количество() > 0 Тогда
			
			Для й=0 По ИскСтроки.Количество()-1 Цикл
				Сч = Сч+1;
				ИмяФайлаНаСервере = ИскСтроки[й].ТекущаяВерсияТом+ИскСтроки[й].ТекущаяВерсияПутьКФайлу;
				Если Не ЗначениеЗаполнено(ИмяФайлаНаСервере) Тогда
					// не найден доп файл 
					Продолжить;
				КонецЕсли;
				
				Адрес = ПолучитьФайл(ИмяФайлаНаСервере);
				
				НомерДопФайла = й+1;
				ИмяФайла = Строка(ИскСтроки[й].Файл)+" доп" + НомерДопФайла+".pdf";
				
				//ИскПуть = ПутиДоговоров.НайтиСтроки(Отбор);
				//Если ИскПуть.Количество()=0 Тогда
				//	// не знаем подкаталог для сохранения
				//	Продолжить;
				//КонецЕсли;
				//
				//Путь = ИскПуть[0].Путь;
				
				ИмяФайлаНаКлиенте = Путь + "/" + ИмяФайла;
				Описание = Новый ОписаниеПередаваемогоФайла(ИмяФайлаНаКлиенте, Адрес);
				МассивОписаний.Добавить(Описание);
			
			КонецЦикла; 
		КонецЕсли; 
	
	КонецЦикла;
	
	ПоказатьОповещениеПользователя("Сохранение файлов на диск...");
	ПолучитьФайлы(МассивОписаний,,,Ложь);
	
	Если Док.КоличествоСтрок() > 0 Тогда
		Док.ДобавитьСтроку("");
		Док.ДобавитьСтроку("Передайте эту информацию в плановый отдел!");
		ИмяФайла = КаталогВыгрузки+"/"+Строка(Формат(Год(ТекущаяДата()),"ЧЦ=4; ЧГ=0"))+Строка(Месяц(ТекущаяДата()))+Строка(День(ТекущаяДата()))+".txt";
		ПоказатьОповещениеПользователя("Создан файл ошибок: 
		|"+ИмяФайла, ИмяФайла);
		Док.Записать(ИмяФайла, "UTF-8");
		
		Док.Показать("Ошибки", ИмяФайла); 
	КонецЕсли; 
КонецПроцедуры
 
&НаСервере
Функция ПолучитьФайл(ИмяФайлаНаСервере)
	Двоичное = Новый ДвоичныеДанные(ИмяФайлаНаСервере);
	Адрес = ПоместитьВоВременноеХранилище(Двоичное,  ЭтаФорма.УникальныйИдентификатор);
	Возврат Адрес;
КонецФункции

&НаКлиенте
Процедура КаталогВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	ДиалогВыбораФайла.Заголовок = "Выберите каталог";
	ДиалогВыбораФайла.ПолноеИмяФайла = "D:\Регистрация\1.Поступление\Содействие";
	Если ДиалогВыбораФайла.Выбрать() Тогда
		КаталогВыгрузки = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не ЗначениеЗаполнено(КаталогВыгрузки) Тогда
		КаталогВыгрузки = "D:\Регистрация\1.Поступление\Содействие";
	КонецЕсли; 
КонецПроцедуры

