
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	СтандартнаяОобработка = Ложь;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ВходящиеДокументы") Тогда
		// Заполнение шапки
		Заказчик = ДанныеЗаполнения.Отправитель;
		РасчетныйСчет = Заказчик.ОсновнойБанковскийСчет;
		Поручение = ДанныеЗаполнения.Ссылка;
        Если ЗначениеЗаполнено(Поручение) Тогда
            Наименование = Поручение.РегистрационныйНомер + " от "+ Формат(Поручение.ДатаРегистрации, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Заказчик = ДанныеЗаполнения.Заказчик;
		Поручение = ДанныеЗаполнения.Поручение;
        Если ЗначениеЗаполнено(Поручение) Тогда
            Наименование = Поручение.РегистрационныйНомер + " от "+ Формат(Поручение.ДатаРегистрации, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		ВидРабот = ДанныеЗаполнения.ВидРабот;
		Владелец = ДанныеЗаполнения.ОбъектРабот;
	КонецЕсли;
	
КонецПроцедуры
