
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
    Если ТекущийОбъект.ВидДатыДоговора = Справочники.мВидыДатДоговоров.ДатаПодписанияЗаказчиком Тогда
        // автоматический расчет планового срока при внесении даты подписания заказчиком
        ПлановыйСрок = мРаботаСДоговорами.РассчитатьПлановыйСрокВыполненияДоговора(ТекущийОбъект.ЭтапДоговора, , Истина);
        
         Если ПлановыйСрок <> Неопределено Тогда
		 //Если ЗначениеЗаполнено(ПлановыйСрок) Тогда
            НаборЗаписей = РегистрыСведений.мДатыДоговоров.СоздатьНаборЗаписей();
            
            ВидДатыДоговораПлановыйСрок = Справочники.мВидыДатДоговоров.ПлановыйСрок;
            
            НаборЗаписей.Отбор.Период.Установить(ТекущийОбъект.Период);
            НаборЗаписей.Отбор.ЭтапДоговора.Установить(ТекущийОбъект.ЭтапДоговора);
            НаборЗаписей.Отбор.ВидДатыДоговора.Установить(ВидДатыДоговораПлановыйСрок);
            
            НовыйНабор = НаборЗаписей.Добавить();
            НовыйНабор.Период = ТекущийОбъект.Период;
            НовыйНабор.ЭтапДоговора = ТекущийОбъект.ЭтапДоговора;
            НовыйНабор.Основание = ТекущийОбъект.Основание;
            НовыйНабор.ВидДатыДоговора = ВидДатыДоговораПлановыйСрок;
            НовыйНабор.Дата = ПлановыйСрок;
 			НовыйНабор.Установил = Пользователи.ТекущийПользователь();
           
            НаборЗаписей.Записать();
        КонецЕсли; 
        
    ИначеЕсли ТекущийОбъект.ВидДатыДоговора = Справочники.мВидыДатДоговоров.ДатаПродления Тогда
		Если Не ТекущийОбъект.ЭтапДоговора.ЗапретИзмененияПлановогоСрока Тогда
			НаборЗаписей = РегистрыСведений.мДатыДоговоров.СоздатьНаборЗаписей();
			
			ВидДатыДоговораПлановыйСрок = Справочники.мВидыДатДоговоров.ПлановыйСрок;
			
			НаборЗаписей.Отбор.Период.Установить(ТекущийОбъект.Период);
			НаборЗаписей.Отбор.ЭтапДоговора.Установить(ТекущийОбъект.ЭтапДоговора);
			НаборЗаписей.Отбор.ВидДатыДоговора.Установить(ВидДатыДоговораПлановыйСрок);
			
			НовыйНабор = НаборЗаписей.Добавить();
			НовыйНабор.Период = ТекущийОбъект.Период;
			НовыйНабор.ЭтапДоговора = ТекущийОбъект.ЭтапДоговора;
			НовыйНабор.Основание = ТекущийОбъект.Основание;
			НовыйНабор.ВидДатыДоговора = ВидДатыДоговораПлановыйСрок;
			НовыйНабор.Дата = ТекущийОбъект.Дата;
			НовыйНабор.Комментарий = ТекущийОбъект.Комментарий;
 			НовыйНабор.Установил = Пользователи.ТекущийПользователь();
			
			НаборЗаписей.Записать();
		КонецЕсли; 
    КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Если Не ЗначениеЗаполнено(Запись.ИсходныйКлючЗаписи.Период) Тогда
        // Это новая запись
        Если ЗначениеЗаполнено(Запись.ЭтапДоговора) Тогда
            Запись.Период = ТекущаяДатаСеанса();
		КонецЕсли;
		Запись.Установил = Пользователи.ТекущийПользователь();
    КонецЕсли; 
КонецПроцедуры


