// Инициализирует таблицы значений, содержащие данные документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	мВнесениеДатыРешенияСроки.Ссылка.Дата КАК Дата,
		|	мВнесениеДатыРешенияСроки.Ссылка.ДатаРешения КАК ДатаРешения,
		|	мВнесениеДатыРешенияСроки.Договор,
		|	мВнесениеДатыРешенияСроки.ЭтапДоговора,
		|	мВнесениеДатыРешенияСроки.Ссылка.Ответственный КАК Ответственный,
		|	мВнесениеДатыРешенияСроки.ЭтапДоговора.ЗапретИзмененияПлановогоСрока КАК ЗапретИзмененияПлановогоСрока
		|ИЗ
		|	Документ.мВнесениеДатыРешения.Сроки КАК мВнесениеДатыРешенияСроки
		|ГДЕ
		|	мВнесениеДатыРешенияСроки.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Результат = Запрос.Выполнить();
  
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаСроки", Результат.Выгрузить());
	
КонецПроцедуры 