
&НаКлиенте
Процедура ПросмотретьСообщение(Команда)
	
	ДанныеФайла = ПолучитьДанныеФайлаДляОткрытия(Объект.Ссылка);
	Если ДанныеФайла <> Неопределено Тогда
		КомандыРаботыСФайламиКлиент.Открыть(ДанныеФайла);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеФайлаДляОткрытия(СообщениеСсылка)
	
	УстановитьПривилегированныйРежим(Истина);
	МассивФайлов = РаботаСФайламиВызовСервера.ПолучитьВсеПодчиненныеФайлы(СообщениеСсылка);
	Если МассивФайлов.Количество() = 1 Тогда
		ДанныеФайла = РаботаСФайламиВызовСервера.ПолучитьДанныеФайлаДляОткрытия(МассивФайлов[0]);
		Возврат ДанныеФайла;	
	КонецЕсли;	
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПервоеСообщениеВСессии = РаботаССВД.НайтиСообщениеСВДПоИдентификатору(Объект.ИдентификаторСессии);
	
	Если Объект.ФорматСообщения = Справочники.ФорматыСообщенийСВД.СообщениеПоГОСТ53898ВложенныеФайлы
		Или Объект.ФорматСообщения = Справочники.ФорматыСообщенийСВД.Сообщение1СДокументооборот Тогда
	
		МассивФайлов = РаботаСФайламиВызовСервера.ПолучитьВсеПодчиненныеФайлы(Объект.Ссылка);
		Если МассивФайлов.Количество() <> 1 Тогда
			Возврат;
		КонецЕсли;
		
		ФайлСсылка = МассивФайлов[0];
		
		ТекущаяВерсия = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ФайлСсылка, "ТекущаяВерсия");
		ТипХраненияФайла = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ТекущаяВерсия, "ТипХраненияФайла");
		
		ИмяФайлаСПутем = РаботаСФайламиВызовСервера.ПолучитьИмяФайлаСПутемКДвоичнымДанным(ТекущаяВерсия);
		
		ПространствоИмен = РаботаССВД.ПолучитьПространствоИмен(Объект.ФорматСообщения);
		
		//МиСофт+
		ОбъектXDTO = РаботаССВД.ПолучитьXDTO_РБ(ИмяФайлаСПутем, ПространствоИмен);
		//МиСофт-

		Если ТипХраненияФайла = Перечисления.ТипыХраненияФайлов.ВИнформационнойБазе Тогда
			УдалитьФайлы(ИмяФайлаСПутем);
		КонецЕсли;
		
		// Отображаем ОбъектXDTO в HTML
		РаботаССВД.ЗаполнитьHTMLПоXDTO(ТекстHTML, ОбъектXDTO);

	Иначе
		
		РаботаССВДПереопределяемый.ОтобразитьСообщениеСВДВHTML(ТекстHTML, Объект.Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры
