&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    СписокТаблиц.Параметры.УстановитьЗначениеПараметра("СборникНормВремени", Элементы.Список.ТекущаяСтрока);
    СписокПримечаний.Параметры.УстановитьЗначениеПараметра("СборникНормВремени", Элементы.Список.ТекущаяСтрока);
КонецПроцедуры


&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
    ПодключитьОбработчикОжидания("ОбработкаОжидания", 0.2, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОжидания()
	
	Если Элементы.Список.ТекущаяСтрока <> Неопределено Тогда 
		СписокТаблиц.Параметры.УстановитьЗначениеПараметра("СборникНормВремени", Элементы.Список.ТекущаяСтрока);
		СписокПримечаний.Параметры.УстановитьЗначениеПараметра("СборникНормВремени", Элементы.Список.ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТаблицПриАктивизацииСтроки(Элемент)
	ОписаниеТаблицы = "";
	ТекДанные = Элементы.СписокТаблиц.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ОписаниеТаблицы = ТекДанные.Комментарий;
	КонецЕсли; 
КонецПроцедуры



