
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.ВсегоСтомость = Объект.Раздел6.Итог("_7_Стоимость");
	Объект.ВсегоАкциз = Объект.Раздел6.Итог("_8_Акциз");
	Объект.ВсегоНДС = Объект.Раздел6.Итог("_10_СуммаНДС");
	Объект.ВсегоСтомостьСНДС = Объект.Раздел6.Итог("_11_СтоимостьСНДС");
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    ТекущийОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый", Объект.Ссылка.Пустая());
КонецПроцедуры

&НаКлиенте
Процедура Раздел6_5_КоличествоПриИзменении(Элемент)
	РассчитатьСтоимость();
	РассчитатьНДС();
	РассчитатьВсего();
КонецПроцедуры

&НаКлиенте
Процедура Раздел6_6_ЦенаПриИзменении(Элемент)
	РассчитатьСтоимость();
	РассчитатьНДС();
	РассчитатьВсего();
КонецПроцедуры

&НаКлиенте
Процедура Раздел6_7_СтоимостьПриИзменении(Элемент)
	РассчитатьНДС();
	РассчитатьВсего();
КонецПроцедуры

&НаКлиенте
Процедура Раздел6_9_СтавкаНДСПриИзменении(Элемент)
	РассчитатьНДС();
	РассчитатьВсего();
КонецПроцедуры

&НаКлиенте
Процедура Раздел6_10_СуммаНДСПриИзменении(Элемент)
	РассчитатьВсего();
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСтоимость()
	ТекДанные = Элементы.Раздел6.ТекущиеДанные;
	ТекДанные._7_Стоимость = ТекДанные._6_Цена * ТекДанные._5_Количество;
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьНДС()
	ТекДанные = Элементы.Раздел6.ТекущиеДанные;
	РеквНДС = ПолучитьРеквизитыСтавкиНДС(ТекДанные._9_СтавкаНДС);
	
	Если РеквНДС.ЗначениеСтавкиНДС <> Неопределено Тогда
		ТекДанные._10_СуммаНДС = Окр(ТекДанные._7_Стоимость * РеквНДС.ЗначениеСтавкиНДС / 100, 2); 
	Иначе
		ТекДанные._10_СуммаНДС = 0; 
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьВсего()
	ТекДанные = Элементы.Раздел6.ТекущиеДанные;
	
	ТекДанные._11_СтоимостьСНДС = ТекДанные._7_Стоимость + ТекДанные._10_СуммаНДС;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРеквизитыСтавкиНДС(СтавкаНДС)
	РеквНДС = Новый Структура("ЗначениеСтавкиНДС, БезНДС", Неопределено, Неопределено); 
	Если ЗначениеЗаполнено(СтавкаНДС) Тогда
		РеквНДС.Вставить("ЗначениеСтавкиНДС", СтавкаНДС.Ставка);
		РеквНДС.Вставить("БезНДС", СтавкаНДС.НеОблагается);
	КонецЕсли;
	Возврат РеквНДС;
КонецФункции // 





