// Инициализирует таблицы значений, содержащие данные документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("Установил", Пользователи.ТекущийПользователь());
	Запрос.Текст ="ВЫБРАТЬ
                  | ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
                  | ВедомостьАктированияАкты.Корреспондент КАК Корреспондент,
                  | ВедомостьАктированияАкты.Договор КАК Договор,
                  | ВедомостьАктированияАкты.ЭтапДоговора КАК ЭтапДоговора,
                  | ВедомостьАктированияАкты.Подразделение,
 	              |	ВедомостьАктированияАкты.ЭтапДоговора.СтавкаНДС КАК СтавкаНДС,
	              |	ВедомостьАктированияАкты.ЭтапДоговора.ОсвобождениеОтНДС КАК ОсвобождениеОтНДС,
                  | ВедомостьАктированияАкты.ДатаАкта КАК Период,
                  | ВедомостьАктированияАкты.Сумма КАК Сумма,
                  | ВедомостьАктированияАкты.НДС КАК НДС,
                  | ВедомостьАктированияАкты.НомерАкта КАК НомерДокумента
                  |ИЗ
                  | Документ.ВедомостьАктирования.Акты КАК ВедомостьАктированияАкты
                  |ГДЕ
                  | ВедомостьАктированияАкты.Ссылка = &Ссылка
                  |;
                  |
                  |////////////////////////////////////////////////////////////////////////////////
                  |ВЫБРАТЬ
                  | ЗНАЧЕНИЕ(Справочник.мВидыДатДоговоров.ДатаВыполнения) КАК ВидДатыДоговора,
                  | ВедомостьАктированияАкты.Ссылка КАК Основание,
                  | ВедомостьАктированияАкты.Корреспондент КАК Корреспондент,
                  | ВедомостьАктированияАкты.Договор КАК Договор,
                  | ВедомостьАктированияАкты.ЭтапДоговора КАК ЭтапДоговора,
                  | ВедомостьАктированияАкты.ДатаАкта КАК Период,
				  | &Установил КАК Установил,
				  | ВедомостьАктированияАкты.ДатаАкта КАК Дата
                  |ИЗ
                  | Документ.ВедомостьАктирования.Акты КАК ВедомостьАктированияАкты
                  |ГДЕ
                  | ВедомостьАктированияАкты.Ссылка = &Ссылка
                  |;
                  |
                  |////////////////////////////////////////////////////////////////////////////////
                  |ВЫБРАТЬ
                  | ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
                  | ВедомостьАктированияЗарплата.Исполнитель,
                  | СУММА(ВедомостьАктированияЗарплата.Начислено) КАК Сумма,
                  | ВедомостьАктированияЗарплата.ЭтапДоговора,
                  | ВедомостьАктированияЗарплата.ЭтапДоговора.Подразделение КАК Подразделение,
                  | ВедомостьАктированияЗарплата.Ссылка.Дата КАК Период
                  |ИЗ
                  | Документ.ВедомостьАктирования.Зарплата КАК ВедомостьАктированияЗарплата
                  |ГДЕ
                  | ВедомостьАктированияЗарплата.Начислено <> 0
                  | И ВедомостьАктированияЗарплата.Ссылка = &Ссылка
                  |
                  |СГРУППИРОВАТЬ ПО
                  | ВедомостьАктированияЗарплата.ЭтапДоговора,
                  | ВедомостьАктированияЗарплата.ЭтапДоговора.Подразделение,
                  | ВедомостьАктированияЗарплата.Исполнитель,
                  | ВедомостьАктированияЗарплата.Ссылка.Дата";
				  //|;
				  //|
				  //|////////////////////////////////////////////////////////////////////////////////
				  //|ВЫБРАТЬ
				  //|	ЗНАЧЕНИЕ(Справочник.мВидыДатДоговоров.ДатаЗакрытия) КАК ВидДатыДоговора,
				  //|	ВедомостьАктированияАкты.Ссылка КАК Основание,
				  //|	ВедомостьАктированияАкты.Корреспондент КАК Корреспондент,
				  //|	ВедомостьАктированияАкты.Договор КАК Договор,
				  //|	ВедомостьАктированияАкты.ЭтапДоговора КАК ЭтапДоговора,
				  //|	ВедомостьАктированияАкты.ДатаАкта КАК Период,
				  //|	ВедомостьАктированияАкты.ДатаАкта КАК Дата
				  //|ИЗ
				  //|	Документ.ВедомостьАктирования.Акты КАК ВедомостьАктированияАкты
				  //|ГДЕ
				  //|	ВедомостьАктированияАкты.Ссылка = &Ссылка
				  //|	И ВедомостьАктированияАкты.Сумма = ВедомостьАктированияАкты.Оплата
				  //|	И ВедомостьАктированияАкты.Сумма = ВедомостьАктированияАкты.ЭтапДоговора.СтоимостьСНДС";
				  
	Результат = Запрос.ВыполнитьПакет();
  
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПокупателями", Результат[0].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаУчетДоговоров", Результат[0].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаДатыДоговоров", Результат[1].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаНачислениеЗП", Результат[2].Выгрузить());
	//ТаблицыДляДвижений.Вставить("ТаблицаДатыЗакрытия", Результат[3].Выгрузить());
		
КонецПроцедуры // ИнициализироватьДанныеДокумента()
