// Возвращает структуру, содержащую сведения о пользователе
// Подразделение
// Должность
Функция ПолучитьСведенияОПользователе(Пользователь) Экспорт
	
	СведенияОПользователе = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведенияОПользователях.Подразделение,
		|	СведенияОПользователях.Должность
		|ИЗ
		|	РегистрСведений.СведенияОПользователях КАК СведенияОПользователях
		|ГДЕ
		|	СведенияОПользователях.Пользователь = &Пользователь";

	Запрос.УстановитьПараметр("Пользователь", Пользователь);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СведенияОПользователе.Вставить("Подразделение", ВыборкаДетальныеЗаписи.Подразделение);
		СведенияОПользователе.Вставить("Должность", ВыборкаДетальныеЗаписи.Должность);
		
	КонецЦикла;

	Возврат СведенияОПользователе;
	
КонецФункции