
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗначениеОтбора") И ЗначениеЗаполнено(Параметры.ЗначениеОтбора) Тогда 
		Измерения = Метаданные.РегистрыСведений.НастройкиНумерации.Измерения;
		Для Каждого Измерение Из Измерения Цикл
			Если Измерение.Тип.СодержитТип(ТипЗнч(Параметры.ЗначениеОтбора)) Тогда 
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,
					Измерение.Имя,
					Параметры.ЗначениеОтбора);
				Элементы[Измерение.Имя].Видимость = Ложь;
				Прервать;
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры
