&НаКлиенте
Процедура УправлениеДиалогом()
    Если Объект.ИспользоватьКоэффициент Тогда
        Элементы.Коэффициент.Видимость = Истина;
        Элементы.НормаВремени.Видимость = Ложь;
        Элементы.ШкалаПримечанияКоэффициент.Видимость = Истина;
        Элементы.ШкалаПримечанияНормаВремени.Видимость = Ложь;
    Иначе
        Элементы.Коэффициент.Видимость = Ложь;
        Элементы.НормаВремени.Видимость = Истина;
        Элементы.ШкалаПримечанияКоэффициент.Видимость = Ложь;
        Элементы.ШкалаПримечанияНормаВремени.Видимость = Истина;
    КонецЕсли; 
    Элементы.ГруппаПериоды.Видимость = Объект.ИспользоватьПериодыДействия;
    Элементы.Применение.Видимость = Не Объект.ДействуетНаВесьСборник;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    ЭтоНовый = Не ЗначениеЗаполнено(Объект.Ссылка);
    
    Если ЭтоНовый Тогда
        Объект.ИспользоватьКоэффициент = Истина;
    КонецЕсли; 
    УправлениеДиалогом();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьКоэффициентПриИзменении(Элемент)
    УправлениеДиалогом();
КонецПроцедуры

&НаКлиенте
Процедура ПрименяетсяШкалаПриИзменении(Элемент)
    Элементы.Шкала.Видимость = Объект.ПрименяетсяШкала;
    УправлениеДиалогом();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Элементы.Шкала.Видимость = Объект.ПрименяетсяШкала;
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПериодыДействияПриИзменении(Элемент)
    Элементы.ГруппаПериоды.Видимость = Объект.ИспользоватьПериодыДействия;
КонецПроцедуры

&НаКлиенте
Процедура ДействуетНаВесьСборникПриИзменении(Элемент)
    Элементы.Применение.Видимость = Не Объект.ДействуетНаВесьСборник;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицыНормВремениПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
    Если НоваяСтрока Тогда
        Если ЗначениеЗаполнено(Объект.ПараметрОбъекта) Тогда
            ТекДанные = Элементы.ТаблицыНормВремени.ТекущиеДанные;
            ТекДанные.ПараметрОбъекта = Объект.ПараметрОбъекта;
        КонецЕсли; 
    КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ТаблицыНормВремениПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
    
    // Проверим наличие запятых в начале и конце НомерСтрокиТаблицы если указан номер
    ТекДанные = Элементы.ТаблицыНормВремени.ТекущиеДанные;
    НомерСтрокиТаблицы = СокрЛП(ТекДанные.НомерСтрокиТаблицы);
    Если ЗначениеЗаполнено(ТекДанные.НомерСтрокиТаблицы) Тогда
        Правильно = Ложь;
        Если Лев(НомерСтрокиТаблицы, 1) = "," И Прав(НомерСтрокиТаблицы, 1) = ","  Тогда
            Правильно = Истина;
        КонецЕсли; 
    	
        Если НЕ Правильно Тогда
            ТекДанные.НомерСтрокиТаблицы = "" + ?(Лев(НомерСтрокиТаблицы, 1) = ",","",",") + НомерСтрокиТаблицы + ?(Прав(НомерСтрокиТаблицы, 1) = ",","",","); 
        КонецЕсли; 
    КонецЕсли; 
КонецПроцедуры


	
