&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Запись.ВидРабот) Тогда
		Если ТипЗнч(Запись.ВидРабот) = Тип("СправочникСсылка.мВидыРаботЮрЛица") Тогда
			ВидКонтрагента = "ЮрЛицо";
		Иначе	
			ВидКонтрагента = "ФизЛицо";
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры
 
&НаКлиенте
Процедура ЦельПредоставленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ВидКонтрагента = "ЮрЛицо" Тогда
		ВладелецЦели = ПолучитьПВХ("Цель предоставления зем. участка юрлицам");
	Иначе	
		ВладелецЦели = ПолучитьПВХ("Цель предоставления зем. участка физлицам");
	КонецЕсли; 
	
	Отбор = Новый Структура("Владелец", ВладелецЦели);
	ПараметрыФормы = Новый Структура("Отбор, РежимВыбора", Отбор, Истина);    
	ОткрытьФорму("Справочник.ЗначенияСвойствОбъектов.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПВХ(ИмяПВХ)
	Возврат ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию(ИмяПВХ);
КонецФункции // ПолучитьПВХ(ИмяПВХ)

&НаКлиенте
Процедура ВидЗаказчикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ВидКонтрагента = "ЮрЛицо" Тогда
		ВладелецЦели = ПолучитьПВХ("Вид заказчика юр. лицо");
	Иначе	
		ВладелецЦели = ПолучитьПВХ("Вид заказчика физ. лицо");
	КонецЕсли; 
	
	Отбор = Новый Структура("Владелец", ВладелецЦели);
	ПараметрыФормы = Новый Структура("Отбор, РежимВыбора", Отбор, Истина);    
	ОткрытьФорму("Справочник.ЗначенияСвойствОбъектов.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ВидРаботНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	МассивТипов=Новый Массив();
	Если ВидКонтрагента = "ФизЛицо" Тогда
		МассивТипов.Добавить(Тип("СправочникСсылка.мВидыРаботФизЛица"));
	Иначе
		МассивТипов.Добавить(Тип("СправочникСсылка.мВидыРаботЮрЛица"));
	КонецЕсли;	
	Элемент.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
КонецПроцедуры

