////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

&НаКлиенте
// Обработчик события ОбработкаЗаписиНового.
//
Процедура СписокОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	Элементы.Список.ТекущаяСтрока = НовыйОбъект;
	
КонецПроцедуры

&НаКлиенте
// Обработчик события Действие команды КомандаПодборИзКлассификатора.
//
Процедура КомандаПодборИзКлассификатора(Команда)
	
	ОткрытьФорму("Справочник.мКлассификаторЕдиницИзмерения.Форма.ФормаПодбораИзКлассификатора");
	
КонецПроцедуры

