// Открывает форму выбора пользователя.
Процедура ВыбратьПользователя(ЭлементПользователь, РеквизитПользователь) Экспорт
	
	ПараметрыФормы = Новый Структура("Пользователь", РеквизитПользователь);
	ОткрытьФорму("Справочник.Пользователи.Форма.ФормаВыбораСПодразделениями", ПараметрыФормы, ЭлементПользователь);
	
КонецПроцедуры

// Открывает форму выбора исполнителя.
Процедура ВыбратьИсполнителя(
	ЭлементИсполнитель,
	РеквизитИсполнитель,
	ТолькоПростыеРоли = Ложь,
	БезВнешнихРолей = Ложь,
	ПоказыватьФункции = Ложь,
	ИменаПредметовДляФункций = Неопределено,
	ОсновнойОбъектАдресации = Неопределено,
	ДополнительныйОбъектАдресации = Неопределено,
	ВыбиратьГруппуПользователей = Ложь,
	ПоказыватьКорреспондентов = Ложь,
	ПоказыватьМоиКонтакты = Ложь,
	СписокОтбора = Неопределено,
	ВыбиратьПодразделения = Ложь) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Исполнитель", РеквизитИсполнитель);
	ПараметрыФормы.Вставить("ТолькоПростыеРоли", ТолькоПростыеРоли);
	ПараметрыФормы.Вставить("БезВнешнихРолей", БезВнешнихРолей);
	ПараметрыФормы.Вставить("ПоказыватьФункции", ПоказыватьФункции);
	ПараметрыФормы.Вставить("ИменаПредметовДляФункций", ИменаПредметовДляФункций);
	ПараметрыФормы.Вставить("ОсновнойОбъектАдресации", ОсновнойОбъектАдресации);
	ПараметрыФормы.Вставить("ДополнительныйОбъектАдресации", ДополнительныйОбъектАдресации);
	ПараметрыФормы.Вставить("ВыбиратьГруппуПользователей", ВыбиратьГруппуПользователей);
	ПараметрыФормы.Вставить("ПоказыватьКорреспондентов", ПоказыватьКорреспондентов);
	ПараметрыФормы.Вставить("ПоказыватьМоиКонтакты", ПоказыватьМоиКонтакты);
	ПараметрыФормы.Вставить("СписокОтбора", СписокОтбора);
	ПараметрыФормы.Вставить("ВыбиратьПодразделения", ВыбиратьПодразделения);
	
	ОткрытьФорму("ОбщаяФорма.ВыборИсполнителя", ПараметрыФормы, ЭлементИсполнитель);
	
КонецПроцедуры

// Открывает форму подбора исполнителей.
Процедура ПодборИсполнителей(
	АдресВременногоХранилища,
	ФормаВладелец,
	ТолькоПростыеРоли = Ложь,
	БезВнешнихРолей = Ложь,
	ПоказыватьФункции = Ложь,
	ИменаПредметовДляФункций = Неопределено,
	ПодбиратьГруппыПользователей = Ложь,
	ПоказыватьКорреспондентов = Ложь,
	ПоказыватьМоиКонтакты = Ложь) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресВременногоХранилища", АдресВременногоХранилища);
	ПараметрыФормы.Вставить("ТолькоПростыеРоли", ТолькоПростыеРоли);
	ПараметрыФормы.Вставить("БезВнешнихРолей", БезВнешнихРолей);
	ПараметрыФормы.Вставить("ПоказыватьФункции", ПоказыватьФункции);
	ПараметрыФормы.Вставить("ИменаПредметовДляФункций", ИменаПредметовДляФункций);
	ПараметрыФормы.Вставить("ПодбиратьГруппыПользователей", ПодбиратьГруппыПользователей);
	ПараметрыФормы.Вставить("ПоказыватьКорреспондентов", ПоказыватьКорреспондентов);
	ПараметрыФормы.Вставить("ПоказыватьМоиКонтакты", ПоказыватьМоиКонтакты);
	
	ОткрытьФорму("ОбщаяФорма.ПодборИсполнителей", ПараметрыФормы, ФормаВладелец);
	
КонецПроцедуры

// Возвращает ссылку на Пользователя выбранного из списка
//  либо найденного по первым введенным символам
&НаКлиенте
Функция ПолучитьПодписанта(Организация, ВидДокумента, ТекстПоиска = "") Экспорт
	
	МассивПодписантов = мРаботаСДоговорами.ПолучитьИмеющихПравоПодписи(Организация, ВидДокумента);
	СписокДляВыбора = Новый СписокЗначений;
	
	Если ЗначениеЗаполнено(ТекстПоиска) Тогда
		ДлинаТекста = СтрДлина(ТекстПоиска);
		Для каждого Чел Из МассивПодписантов Цикл
			Если Врег(Лев(Чел, ДлинаТекста)) = Врег(ТекстПоиска) Тогда
				СписокДляВыбора.Добавить(Чел);
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли;
	
	Если СписокДляВыбора.Количество() = 0 Тогда
		Для й=0 По МассивПодписантов.Количество()-1 Цикл
			Чел = МассивПодписантов[й];
			
			СписокДляВыбора.Добавить(Чел, Строка(Чел)+?(й=0," (по умолчанию)",""));	 
		КонецЦикла; 
	КонецЕсли;	
	
	ВыбЭлемент = Неопределено;
	Если СписокДляВыбора.Количество() > 1 Тогда
		ВыбЭлемент = СписокДляВыбора.ВыбратьЭлемент("Выберите подписывающего",);
	ИначеЕсли СписокДляВыбора.Количество() = 1 Тогда
		ВыбЭлемент = СписокДляВыбора.Получить(0);
	КонецЕсли; 
	Если ВыбЭлемент = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат ВыбЭлемент.Значение;
КонецФункции 

