// Инициализирует таблицу значений, содержащие данные документа.
//
Функция ИнициализироватьДанныеДокумента(ДокументСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("Установил", Пользователи.ТекущийПользователь());
	Запрос.Текст ="ВЫБРАТЬ
	              |	ИзменениеДатДоговоровЭтапы.ЭтапДоговора,
	              |	ИзменениеДатДоговоровЭтапы.Ссылка.Ссылка КАК Основание,
	              |	ИзменениеДатДоговоровЭтапы.Ссылка.Корреспондент,
	              |	ИзменениеДатДоговоровЭтапы.Ссылка.Договор,
	              |	ИзменениеДатДоговоровЭтапы.Ссылка.ВидДатыДоговора,
	              |	ИзменениеДатДоговоровЭтапы.Ссылка.ДатаУстановления КАК Дата,
	              |	ИзменениеДатДоговоровЭтапы.Ссылка.Дата КАК Период,
	              |	&Установил КАК Установил,
	              |	ИзменениеДатДоговоровЭтапы.Ссылка.Комментарий
	              |ИЗ
	              |	Документ.ИзменениеДатДоговоров.Этапы КАК ИзменениеДатДоговоровЭтапы
	              |ГДЕ
	              |	ИзменениеДатДоговоровЭтапы.Ссылка = &Ссылка";
    Результат = Запрос.Выполнить().Выгрузить();
  
	Возврат Результат;
	
КонецФункции // ИнициализироватьДанныеДокумента()
