////////////////////////////////////////////////////////////////////////////////
// Блок функций - обработчиков событий
//

// Обработчик события "при создании на сервере" формы
// Заполняет таблицу по макету
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьТаблицуАдресныхОбъектов();
	
КонецПроцедуры

// Обработчик события "выбор" элемента формы АдресныеОбъекты
// Инвертирует флаг выбора адресного объекта
//
&НаКлиенте
Процедура АдресныеОбъектыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Элемент.ТекущиеДанные.Пометка = НЕ Элемент.ТекущиеДанные.Пометка;
КонецПроцедуры

// Обработчик события нажатия на кнопку командной панели
// элемента управления АдресныеОбъекты.
// Устанавливает флаг выбора всем адресным объектам в списке
//
&НаКлиенте
Процедура ВыделитьВсеВыполнить()
	
	Для Каждого ЭлементАдресныйОбъект Из АдресныеОбъекты Цикл
		ЭлементАдресныйОбъект.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

// Обработчик события нажатия на кнопку командной панели
// элемента управления АдресныеОбъекты.
// Снимает флаг выбора у всех адресных объектов в списке
//
&НаКлиенте
Процедура ОтменитьВыделитьВсеВыполнить()
	
	Для Каждого ЭлементАдресныйОбъект Из АдресныеОбъекты Цикл
		ЭлементАдресныйОбъект.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

// Обработчик события нажатия на кнопку "Очистить"
// Проверяет корректность данных и вызывает диалог поддверждения
// очистки адресных сведений.
//
&НаКлиенте
Процедура ОчиститьВыполнить()
	
	ОчиститьСообщения();
	
	Если КоличествоВыделенныхАдресныхОбъектов() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					НСтр("ru = 'Необходимо выбрать как минимум один адресный объект.'"), ,
					"АдресныеОбъекты");
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru = 'Адресные сведения по выбранным объектам будут удалены. Удалить адресные сведения?'");
	КодВозврата = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	
	Если КодВозврата = КодВозвратаДиалога.ОК Тогда
		ОчиститьАдресныеСведения();
		Предупреждение(НСтр("ru = 'Адресные сведения успешно удалены.'"),,
		               НСтр("ru = 'Удаление адресных сведений.'"));
		Оповестить("Запись_АдресныйКлассификатор", Новый Структура("Событие", "Очистить"));
		Закрыть(Истина);
    КонецЕсли;
    	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Блок сервисных функций
//

// Заполняет переданную таблицу значений по значениям таблицы адресных объектов.
// Выбирается наименование и сокращение типа объекта.
//
&НаСервере
Процедура ЗаполнитьТаблицуАдресныхОбъектов()
    
	АдресныеОбъекты.Очистить();
    ДобавитьНаименованиеАдресногоОбъекта("Брестская обл");
    ДобавитьНаименованиеАдресногоОбъекта("Витебская обл");
    ДобавитьНаименованиеАдресногоОбъекта("Гомельская обл");
    ДобавитьНаименованиеАдресногоОбъекта("Гродненская обл");
    ДобавитьНаименованиеАдресногоОбъекта("Минск г.");
    ДобавитьНаименованиеАдресногоОбъекта("Минская обл");
    ДобавитьНаименованиеАдресногоОбъекта("Могилевская обл");
    
КонецПроцедуры

// <Описание процедуры>
//
// Параметры
//  <ИмяОбъекта>  - <Строка> - наименование адресного объекта
//  <Пометка>  - <Булево> - 
//
&НаСервере
Процедура ДобавитьНаименованиеАдресногоОбъекта(ИмяОбъекта, Пометка = Ложь)
    
    НоваяСтрока = АдресныеОбъекты.Добавить();
	НоваяСтрока.НаименованиеАдресногоОбъекта = ИмяОбъекта;
	НоваяСтрока.Пометка = Пометка;
    
КонецПроцедуры // ДобавитьНаименованиеАдресногоОбъекта(ИмяОбъекта, Пометка = Ложь)

// Возвращает количество помеченных адресных объектов
//
&НаКлиенте
Функция КоличествоВыделенныхАдресныхОбъектов()
	
	КоличествоВыделенныхАдресныхОбъектов = 0;
	
	Для Каждого ЭлементАдресныйОбъект Из АдресныеОбъекты Цикл
		Если ЭлементАдресныйОбъект.Пометка Тогда
			КоличествоВыделенныхАдресныхОбъектов = КоличествоВыделенныхАдресныхОбъектов + 1;
		КонецЕсли;
	КонецЦикла;
	
	Возврат КоличествоВыделенныхАдресныхОбъектов;
	
КонецФункции

// Удаляет адресные сведения по выбранным адресным объектам
//
&НаСервере
Процедура ОчиститьАдресныеСведения()
	
КонецПроцедуры
