&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Установка видимости кнопки Настройки
	ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	Если мРазное.УПользователяЕстьРоль(ТекущийПользователь, "мИсполнителиРабот") или
		мРазное.УПользователяЕстьРоль(ТекущийПользователь, "мИсполнительРабот") или
		мРазное.УПользователяЕстьРоль(ТекущийПользователь, "мРуководительПроизводства") Тогда
		Для каждого Кнопка Из ЭтаФорма.ПодчиненныеЭлементы.ОсновнаяКоманднаяПанель.ПодчиненныеЭлементы Цикл
			Если Кнопка.Имя = "ФормаНастройки" или Кнопка.Имя = "ФормаВарианты" Тогда
				Кнопка.Видимость = Ложь;
				Кнопка.Доступность = Ложь;
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойВариантаНаСервере(Настройки)
	ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	
	Если мРазное.УПользователяЕстьРоль(ТекущийПользователь, "мРуководительПроизводства") Тогда
		// Для Руководителей производства убираем доступность к отборам
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Исполнитель", Неопределено);
		СтруктураПараметров.Вставить("Подразделение", РаботаСПользователями.ПолучитьПодразделение(ТекущийПользователь));
		
		мОтчетыВызовСервера.СкрытьПараметрыУстановитьЗначения(Настройки.ПараметрыДанных, СтруктураПараметров);
		
	ИначеЕсли мРазное.УПользователяЕстьРоль(ТекущийПользователь, "мИсполнителиРабот")
		ИЛИ мРазное.УПользователяЕстьРоль(ТекущийПользователь, "мИсполнительРабот") Тогда
		// Для Исполнителей работ убираем доступность к отборам
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Исполнитель", ТекущийПользователь);
		СтруктураПараметров.Вставить("Подразделение", Неопределено);
		
		мОтчетыВызовСервера.СкрытьПараметрыУстановитьЗначения(Настройки.ПараметрыДанных, СтруктураПараметров);
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойПользовательскихНастроекНаСервере(Настройки)
	ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	
	Если мРазное.УПользователяЕстьРоль(ТекущийПользователь, "мРуководительПроизводства") Тогда
		// Для Руководителей производства убираем доступность к отборам
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Исполнитель", Неопределено);
		СтруктураПараметров.Вставить("Подразделение", РаботаСПользователями.ПолучитьПодразделение(ТекущийПользователь));
		
		мОтчетыВызовСервера.СкрытьПараметрыУстановитьЗначения(Настройки, СтруктураПараметров);
		
	ИначеЕсли мРазное.УПользователяЕстьРоль(ТекущийПользователь, "мИсполнителиРабот")
		ИЛИ мРазное.УПользователяЕстьРоль(ТекущийПользователь, "мИсполнительРабот") Тогда
		// Для Исполнителей работ убираем доступность к отборам
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Исполнитель", ТекущийПользователь);
		СтруктураПараметров.Вставить("Подразделение", Неопределено);
		
		мОтчетыВызовСервера.СкрытьПараметрыУстановитьЗначения(Настройки, СтруктураПараметров);
	КонецЕсли;
КонецПроцедуры
