
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	// Если Договор-контроль, то дело должно быть Дело-услуги
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Основание", ПараметрКоманды);
	
	Если ПараметрКоманды.Владелец.ВидДокумента = ПредопределенноеЗначение("Справочник.ВидыВнутреннихДокументов.ДоговорКонтрольКачества") Тогда
	    ПараметрыФормы.Вставить("ВидДокумента", ПредопределенноеЗначение("Справочник.ВидыВнутреннихДокументов.ДелоУслуги"));
	Иначе
	    ПараметрыФормы.Вставить("ВидДокумента", ПредопределенноеЗначение("Справочник.ВидыВнутреннихДокументов.Дело"));
	КонецЕсли; 

	Открытьформу("Справочник.ВнутренниеДокументы.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник);
	
КонецПроцедуры 