Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Добавление участников из самого документа
	Если РаботаСРабочимиГруппами.ПоОбъектуВедетсяАвтоматическоеЗаполнениеРабочейГруппы(Документ) Тогда 
		
		ТаблицаУчастников = РаботаСРабочимиГруппами.ПолучитьРабочуюГруппуДокумента(Документ);
		
		РаботаСРабочимиГруппами.ДобавитьУчастникаВТаблицуНабора(ТаблицаУчастников, Исполнитель,
			ОсновнойОбъектАдресации, ДополнительныйОбъектАдресации);
		РаботаСРабочимиГруппами.ДобавитьУчастникаВТаблицуНабора(ТаблицаУчастников, Автор);	
			
		РаботаСРабочимиГруппами.ПерезаписатьРабочуюГруппуОбъекта(Документ, ТаблицаУчастников, Истина);
			
	КонецЕсли;
	
КонецПроцедуры
