#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДополнительныеСвойства = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства;
	ДополнительныеСвойства.Свойство("ПоказыватьБыстрыеНастройки", ПоказыватьБыстрыеНастройки);
	
	// Сохраним исходное значение для восстановления по команде "Отмена" перед закрытием.
	ИсходныйПоказыватьБыстрыеНастройки = ПоказыватьБыстрыеНастройки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	Оповестить("ИзменениеНастроек_ПланФактныйАнализСогласования", ПоказыватьБыстрыеНастройки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	ДополнительныеСвойства = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства;
	ДополнительныеСвойства.Вставить("ПоказыватьБыстрыеНастройки", ПоказыватьБыстрыеНастройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отмена(Команда)
	
	// Восстановим исходное значение для оповещения формы отчета.
	ПоказыватьБыстрыеНастройки = ИсходныйПоказыватьБыстрыеНастройки;
	Закрыть();
	
КонецПроцедуры

#КонецОбласти