
Процедура ОбработкаПроведения(Отказ, Режим)
    
    // регистр РасчетыСПокупателями Приход (с кого списываем)
    Движения.РасчетыСПокупателями.Записывать = Истина;
    Движение = Движения.РасчетыСПокупателями.Добавить();
    Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
    Движение.Период = Дата;
    Движение.Корреспондент = КорреспондентДеб;
    Движение.Договор = ДоговорДеб;
    Движение.ЭтапДоговора = ЭтапДоговораДеб;
    Движение.Сумма = -Сумма;
    Движение.НомерДокумента = НомерДокумента;
    Движение.ДатаДокумента = ДатаДокумента;
    Движение.ВидВзаимозачета = ВидВзаимозачета;

    // регистр РасчетыСПокупателями Приход (кому зачисляем)
    Движения.РасчетыСПокупателями.Записывать = Истина;
    Движение = Движения.РасчетыСПокупателями.Добавить();
    Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
    Движение.Период = Дата;
    Движение.Корреспондент = КорреспондентКре;
    Движение.Договор = ДоговорКре;
    Движение.ЭтапДоговора = ЭтапДоговораКре;
    Движение.Сумма = Сумма;
    Движение.НомерДокумента = НомерДокумента;
    Движение.ДатаДокумента = ДатаДокумента;
    Движение.ВидВзаимозачета = ВидВзаимозачета;

    Движения.Записать();
    
    // Запись Даты оплаты
	НаборЗаписей = РегистрыСведений.мДатыДоговоров.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Основание.Установить(Ссылка);
	НаборЗаписей.Отбор.ВидДатыДоговора.Установить(Справочники.мВидыДатДоговоров.ДатаОплаты);
    
    НоваяЗапись = НаборЗаписей.Добавить();
    НоваяЗапись.Период = Дата;
    НоваяЗапись.ВидДатыДоговора = Справочники.мВидыДатДоговоров.ДатаОплаты;
    НоваяЗапись.ЭтапДоговора = ЭтапДоговораКре;
    НоваяЗапись.Основание = Ссылка;
    НоваяЗапись.Дата = Дата;
 	НоваяЗапись.Установил = Пользователи.ТекущийПользователь();
	
	НаборЗаписей.Записать(Истина);
    
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	// Удаление даты договора
	мРаботаСДоговорами.УдалитьДатуДоговора(Ссылка, Отказ);
КонецПроцедуры
