#Область Шлюз_Гродно
Функция ЗагрузитьСтрокиДоговоров(Параметры, АдресХранилища) Экспорт
	ТаблБД = Параметры.ТаблБД;
	ИндексНачала = Параметры.ИндексНачала;
	РазмерПорции = Параметры.РазмерПорции;
	
	МассивДоговоров = Новый Массив;
	
	Для Сч = 1 По РазмерПорции Цикл
		
		Индекс = ?(Сч=1,ИндексНачала,Индекс+1);
		//мМногопоточнаяОбработка.ЗагружатьСтрокуДоговоров(ТаблБД[Индекс], МассивДоговоров);
		Стр = ТаблБД[Индекс];
		
		Если мМногопоточнаяОбработка.ГрузитьСтроку(Стр) Тогда
			// Добавляем договор
			ИскЭлемент = МассивДоговоров.Найти(Стр.КодДоговора);
			Если ИскЭлемент = Неопределено Тогда
				Если ЗначениеЗаполнено(Стр.НомерДоговора) Тогда
					МассивДоговоров.Добавить(Стр.КодДоговора);
				КонецЕсли; 
			КонецЕсли; 
			//Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
//	СтрокаСообщения = "Индекс нач = "+ИндексНачала+" РазмерПорции = "+РазмерПорции+" обр="+Сч;
	ПоместитьВоВременноеХранилище(МассивДоговоров, АдресХранилища); 	
КонецФункции

&НаСервере
Функция ГрузитьСтроку(Стр) Экспорт
	Сообщить("Грузить строку");
	Если Стр.ГодДоговора < 2015 Тогда
		ДатаАкта = ПреобразоватьСтрокуКДате(Стр.ДатаАкта);
		ДатаОплаты1 = ПреобразоватьСтрокуКДате(Стр.ДатаОплаты1);
		ДатаОплаты2 = ПреобразоватьСтрокуКДате(Стр.ДатаОплаты2);
		ДатаВозврата = ПреобразоватьСтрокуКДате(Стр.ДатаВозврата);
		ДатаПрибыль = ПреобразоватьСтрокуКДате(Стр.ДатаПрибыль);
		ДатаУбыток = ПреобразоватьСтрокуКДате(Стр.ДатаУбыток);
		
		Если Стр.СуммаАкта = Стр.СуммаОплаты1 + Стр.СуммаОплаты2 - Стр.СуммаВозврата - Стр.СуммаПрибыль + Стр.СуммаУбыток И 
			Стр.СуммаАкта = 0 Тогда
			// оплата была возвращена полностью, работы не выполнялись
			Если Год(ДатаАкта) < 2015 
				и Год(ДатаОплаты1) < 2015 
				и Год(ДатаОплаты2) < 2015 
				И Год(ДатаВозврата) < 2015 
				И Год(ДатаПрибыль) < 2015
				И Год(ДатаУбыток) < 2015 Тогда
				// было до 2015
				Возврат Ложь;
			КонецЕсли; 
			
		ИначеЕсли Стр.СуммаАкта = Стр.СуммаОплаты1 + Стр.СуммаОплаты2 - Стр.СуммаВозврата - Стр.СуммаПрибыль + Стр.СуммаУбыток И 
			Стр.СуммаАкта = Стр.Стоимость Тогда
			// работы выполнены полностью 
			Если Год(ДатаАкта) < 2015 
				и Год(ДатаОплаты1) < 2015 
				и Год(ДатаОплаты2) < 2015 
				И Год(ДатаВозврата) < 2015 
				И Год(ДатаПрибыль) < 2015
				И Год(ДатаУбыток) < 2015 Тогда
				// было до 2015
				Возврат Ложь;
			КонецЕсли; 
			
			//ИначеЕсли Стр.СуммаАкта = 0 И Стр.СуммаОплаты1 > 0 И Стр.СуммаОплаты1 < 10000 Тогда
			//	// такие не надо переносить
			//	Возврат Ложь;
		КонецЕсли;
		//Иначе
		//	// Договор 2015
		//	Если Стр.СуммаАкта = Стр.СуммаОплаты1 + Стр.СуммаОплаты2 - Стр.СуммаВозврата И 
		//		Стр.СуммаАкта = 0 Тогда
		//		// оплата была возвращена полностью, работы не выполнялись
		//		Возврат Ложь;
		//	КонецЕсли; 
	КонецЕсли; 
	Возврат Истина;
КонецФункции // ГрузитьСтроку(Стр)

&НаСервере
Функция ЗагружатьСтрокуДоговоров(Стр, МассивДоговоров) Экспорт
	
	Если мМногопоточнаяОбработка.ГрузитьСтроку(Стр) Тогда
		// Добавляем договор
		ИскЭлемент = МассивДоговоров.Найти(Стр.КодДоговора);
		Если ИскЭлемент = Неопределено Тогда
			Если ЗначениеЗаполнено(Стр.НомерДоговора) Тогда
				МассивДоговоров.Добавить(Стр.КодДоговора);
			КонецЕсли; 
		КонецЕсли; 
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции	

&НаСервере
Функция ПреобразоватьСтрокуКДате(СтрокаДаты)
	Если ЗначениеЗаполнено(СтрокаДаты) Тогда
		Если ТипЗнч(СтрокаДаты) = Тип("Дата") Тогда
			ПолученнаяДата = СтрокаДаты;
		Иначе	
			ПолученнаяДата = Дата(СтрЗаменить(СтрокаДаты, ".", "") + "000000");
		КонецЕсли;
	Иначе
		ПолученнаяДата = Дата(1,1,1);
	КонецЕсли; 
	Возврат ПолученнаяДата;
КонецФункции // ПреобразоватьСтрокуКДате(СтрДоговор.D_OFORM)()

&НаСервере
Функция ПреобразоватьСтрокуКЧислу(СтрокаЧисла)
	ИсхЧисло = 0;
	ТипСтрокаЧисло = ТипЗнч(СтрокаЧисла);
	Если (ТипСтрокаЧисло = Тип("Строка"))или(ТипСтрокаЧисло = Тип("Число")) Тогда
		Если СокрЛП(СтрокаЧисла) <> "" Тогда
			ИсхЧисло = Число(СтрокаЧисла);
		КонецЕсли; 
	КонецЕсли; 
	Возврат ИсхЧисло;
КонецФункции // ПреобразоватьСтрокуКЧислу()

&НаСервере
Функция ЗаписатьОрганизациюВоВнутреннийДокумент(ПараметрыДанных, АдресХранилища) Экспорт
	ТаблДляЗагрузки = ПараметрыДанных.ТаблДляЗагрузки;	
	ИндексНачала = ПараметрыДанных.ИндексНачала;
	РазмерПорции = ПараметрыДанных.РазмерПорции;
	НашаОрганизация = ПараметрыДанных.НашаОрганизация;
	
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ""+ИндексНачала;
	Сообщение.Сообщить();
		ЗаписьЖурналаРегистрации("Порция "+ИндексНачала, ,,, );
	
	
	
	Для Сч = 1 По РазмерПорции Цикл
		
		Индекс = ?(Сч=1,ИндексНачала,Индекс+1);

		Стр = ТаблДляЗагрузки[Индекс];
		
		Договор = Стр.Ссылка.ПолучитьОбъект();
		Договор.Организация = НашаОрганизация;
		//Договор.ОбменДанными.Загрузка = Истина;
		Попытка
			Договор.Записать();
		//ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньСобытия,,, Комментарий);
		Исключение
		КонецПопытки;
	КонецЦикла;
КонецФункции 
#КонецОбласти

Процедура ПровестиУчетДоговоров(РазмерПорции, КодГраница, КодГраницаПред, ЭтоПоследнийПоток) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчетДоговоров.Ссылка КАК Док,
		|	УчетДоговоров.ЭтапДоговора КАК ЭтапДоговора,
		|	УчетДоговоров.Дата КАК ДатаДок,
		|	УчетДоговоров.ЭтапДоговора.ДатаПоследнейЗаписи КАК ДатаПоследнейЗаписи,
		|	УчетДоговоров.ЭтапДоговора.ОсвобождениеОтНДС КАК ОсвобождениеОтНДСЭтап,
		|	УчетДоговоров.ОсвобождениеОтНДС КАК ОсвобождениеОтНДСДок,
		|	УчетДоговоров.ЭтапДоговора.Цена КАК ЦенаЭтап,
		|	УчетДоговоров.Цена КАК ЦенаДок,
		|	УчетДоговоров.ЭтапДоговора.КоличествоУчастков КАК КоличествоУчастковЭтап,
		|	УчетДоговоров.КоличествоУчастков КАК КоличествоУчастковДок,
		|	УчетДоговоров.ЭтапДоговора.СтавкаНДС КАК СтавкаНДСЭтап,
		|	УчетДоговоров.ЭтапДоговора.Смета КАК СметаЭтап,
		|	УчетДоговоров.СтавкаНДС КАК СтавкаНДСДок
		|ИЗ
		|	Документ.УчетДоговоров КАК УчетДоговоров
		|ГДЕ
		|	УчетДоговоров.Номер " +
		?(ЭтоПоследнийПоток, " > """ + КодГраницаПред +"""",
		" > """ + КодГраницаПред + """ И УчетДоговоров.Номер <= """ + КодГраница + """") + "
		|   И УчетДоговоров.ЭтапДоговора.СтавкаНДС <> УчетДоговоров.СтавкаНДС
        //|   И ((УчетДоговоров.ЭтапДоговора.КоличествоУчастков <> УчетДоговоров.КоличествоУчастков
        //|       ИЛИ УчетДоговоров.ЭтапДоговора.СтавкаНДС <> УчетДоговоров.СтавкаНДС
        //|       ИЛИ УчетДоговоров.ЭтапДоговора.ОсвобождениеОтНДС <> УчетДоговоров.ОсвобождениеОтНДС
        //|       ИЛИ УчетДоговоров.ЭтапДоговора.Цена <> УчетДоговоров.Цена)
        //|   ИЛИ(УчетДоговоров.Дата <> УчетДоговоров.ЭтапДоговора.ДатаПоследнейЗаписи))
		|
		|УПОРЯДОЧИТЬ ПО
		|   УчетДоговоров.Номер";
	
	Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
	
	Сч = 0;
	Колво = 100;
    Сообщить("Запрос "+КодГраница);
	
	Пока Выборка.Следующий() Цикл
		Если Сч = 0 Тогда
			НачатьТранзакцию();
		КонецЕсли; 
		Сч = Сч + 1;
		
		Док = Выборка.Док.Получитьобъект();
		Док.СтавкаНДС = Выборка.СтавкаНДСЭтап;
		Док.ОсвобождениеОтНДС = Выборка.ОсвобождениеОтНДСЭтап;
		Док.Цена = Выборка.ЦенаЭтап;
		Док.КоличествоУчастков = Выборка.КоличествоУчастковЭтап;
		Док.Смета = Выборка.СметаЭтап;
        Док.ОбменДанными.Загрузка = Истина;
		Док.Записать(РежимЗаписиДокумента.Запись);
        //Док.Записать(РежимЗаписиДокумента.Проведение);
		
        //Этап = Выборка.ЭтапДоговора.ПолучитьОбъект();
        //Этап.ДатаПоследнейЗаписи = Выборка.ДатаДок;
        //Этап.ОбменДанными.Загрузка = Истина;
        //Этап.Записать();
		
		Если Сч % Колво = 0 Тогда
			ЗафиксироватьТранзакцию();
			Сч = 0;
		КонецЕсли; 
	КонецЦикла;
	Если ТранзакцияАктивна() Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли; 
	
КонецПроцедуры

Процедура ЗаписатьДатаПоследнейЗаписи(РазмерПорции, КодГраница, КодГраницаПред, ЭтоПоследнийПоток) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	мЭтапыДоговоров.Ссылка КАК Ссылка,
		|	мЭтапыДоговоров.Владелец.ДатаРегистрации КАК ДатаПоследнейЗаписи,
		|	мЭтапыДоговоров.Код
		|ИЗ
		|	Справочник.мЭтапыДоговоров КАК мЭтапыДоговоров
		|ГДЕ
		|	мЭтапыДоговоров.ДатаПоследнейЗаписи = &ДатаПоследнейЗаписи";
        
        Если ЭтоПоследнийПоток Тогда
            Запрос.Текст = Запрос.Текст +"
            |И
            |	мЭтапыДоговоров.Код  > " + КодГраницаПред;
        Иначе
            Запрос.Текст = Запрос.Текст +"
            |И
            |	мЭтапыДоговоров.Код  > " + КодГраницаПред + " И мЭтапыДоговоров.Код <= " + КодГраница;
        КонецЕсли; 
        
        Запрос.Текст = Запрос.Текст +"
		|
		|УПОРЯДОЧИТЬ ПО
		|   мЭтапыДоговоров.Код";
		
	Запрос.УстановитьПараметр("ДатаПоследнейЗаписи", '00010101000000');
	Выборка = Запрос.Выполнить().Выбрать();
	
	Сч = 0;
	Колво = 500;
	
	Пока Выборка.Следующий() Цикл
		Если Сч = 0 Тогда
			НачатьТранзакцию();
		КонецЕсли; 
		Сч = Сч + 1;
		
		Этап = Выборка.Ссылка.Получитьобъект();
		Этап.ДатаПоследнейЗаписи = Выборка.ДатаПоследнейЗаписи;
        Этап.ОбменДанными.Загрузка = Истина;
		Этап.Записать();
		
		Если Сч % Колво = 0 Тогда
			ЗафиксироватьТранзакцию();
			Сч = 0;
		КонецЕсли; 
	КонецЦикла;
	Если ТранзакцияАктивна() Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьУчетДоговоров(НомерГода, ТипДока) Экспорт
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ 
    |   УчетДоговоров.Период КАК Период,
    |   УчетДоговоров.Регистратор КАК Регистратор,
    |   УчетДоговоров.НомерСтроки,
    |   УчетДоговоров.Активность,
    |   УчетДоговоров.ВидДвижения,
    |   УчетДоговоров.ЭтапДоговора,
    |   УчетДоговоров.Договор,
    |   УчетДоговоров.ЭтапДоговора.СтавкаНДС КАК СтавкаНДС,
    |   УчетДоговоров.ЭтапДоговора.ОсвобождениеОтНДС КАК ОсвобождениеОтНДС,
    |   УчетДоговоров.Сумма,
    |   УчетДоговоров.НДС,
    |   УчетДоговоров.НомерДокумента
    |ИЗ
    |   РегистрНакопления.УчетДоговоров КАК УчетДоговоров
    |ГДЕ
    |   ГОД(УчетДоговоров.Период) = &ГодДоговора
    |   И УчетДоговоров.СтавкаНДС <> УчетДоговоров.ЭтапДоговора.СтавкаНДС
    |   И ТИПЗНАЧЕНИЯ(УчетДоговоров.Регистратор) = &ТипДока
    |
    |СГРУППИРОВАТЬ ПО
    |   УчетДоговоров.Регистратор,
    |   УчетДоговоров.Период,
    |   УчетДоговоров.НомерСтроки,
    |   УчетДоговоров.Активность,
    |   УчетДоговоров.ВидДвижения,
    |   УчетДоговоров.ЭтапДоговора,
    |   УчетДоговоров.Договор,
    |   УчетДоговоров.ЭтапДоговора.СтавкаНДС,
    |   УчетДоговоров.ЭтапДоговора.ОсвобождениеОтНДС,
    |   УчетДоговоров.Сумма,
    |   УчетДоговоров.НДС,
    |   УчетДоговоров.НомерДокумента
    |
    |УПОРЯДОЧИТЬ ПО
    |   Регистратор,
    |   Период";
    
    Запрос.УстановитьПараметр("ГодДоговора", НомерГода);
    Запрос.УстановитьПараметр("ТипДока", Тип("ДокументСсылка."+ТипДока));
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Сч = 0;
    Колво = 500;
    
    Выборка = РезультатЗапроса.Выбрать();
    
    Пока Выборка.Следующий() Цикл
        Если Сч = 0 Тогда
            НачатьТранзакцию();
        КонецЕсли; 
        Сч = Сч + 1;
        
        Документ = Выборка.Регистратор.ПолучитьОбъект();
        НаборЗаписей = Документ.Движения.УчетДоговоров;
        НаборЗаписей.Прочитать();
        // Модифицировать каждую запись в прочитанных движениях. 
        Если НаборЗаписей.Количество()<> 0 Тогда 
            Для Каждого Движение Из НаборЗаписей Цикл  
                Движение.СтавкаНДС = Выборка.СтавкаНДС; 
                Движение.ОсвобождениеОтНДС = Выборка.ОсвобождениеОтНДС; 
            КонецЦикла;       
            // Записать измененный набор записей.    
            НаборЗаписей.Записать(); 
        КонецЕсли; 
        
        Если Сч % Колво = 0 Тогда
            ЗафиксироватьТранзакцию();
            Сч = 0;
        КонецЕсли; 
    КонецЦикла;
    
    Если ТранзакцияАктивна() Тогда
        ЗафиксироватьТранзакцию();
    КонецЕсли; 
    
КонецПроцедуры // ИзменитьУчетДоговоров()

#Область Деноминация

	
#КонецОбласти