// Инициализирует таблицы значений, содержащие данные документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст ="ВЫБРАТЬ
	              |	РеестрТекущихПлатежейЭтапы.Договор.Корреспондент КАК Корреспондент,
	              |	РеестрТекущихПлатежейЭтапы.Договор КАК Договор,
	              |	РеестрТекущихПлатежейЭтапы.ЭтапДоговора КАК ЭтапДоговора,
	              |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	              |	ВЫБОР
	              |		КОГДА РеестрТекущихПлатежейЭтапы.Ссылка.НаправлениеПлатежа = ЗНАЧЕНИЕ(Перечисление.М_НаправлениеПлатежа.Поступление)
	              |			ТОГДА РеестрТекущихПлатежейЭтапы.СуммаОплатыЭтапаДоговора
	              |		ИНАЧЕ -РеестрТекущихПлатежейЭтапы.СуммаОплатыЭтапаДоговора
	              |	КОНЕЦ КАК Сумма,
	              |	РеестрТекущихПлатежейЭтапы.НомерПлатежногоДокумента КАК НомерДокумента,
	              |	РеестрТекущихПлатежейЭтапы.ДатаПлатежногоДокумента КАК ДатаДокумента,
	              |	РеестрТекущихПлатежейЭтапы.Ссылка.Дата КАК Период,
	              |	РеестрТекущихПлатежейЭтапы.СпособПлатежа КАК СпособПлатежа
	              |ИЗ
	              |	Документ.РеестрТекущихПлатежей.Этапы КАК РеестрТекущихПлатежейЭтапы
	              |ГДЕ
	              |	РеестрТекущихПлатежейЭтапы.Ссылка = &Ссылка
	              |	И РеестрТекущихПлатежейЭтапы.СуммаОплатыЭтапаДоговора > 0
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	ЗНАЧЕНИЕ(Справочник.мВидыДатДоговоров.ДатаОплаты) КАК ВидДатыДоговора,
	              |	РеестрТекущихПлатежейЭтапы.Ссылка КАК Ссылка,
	              |	РеестрТекущихПлатежейЭтапы.Ссылка.Дата КАК Период,
	              |	РеестрТекущихПлатежейЭтапы.Ссылка.Дата КАК Дата,
	              |	РеестрТекущихПлатежейЭтапы.Договор КАК Договор,
	              |	РеестрТекущихПлатежейЭтапы.Договор.ДатаРегистрации КАК ДатаРегистрации,
	              |	РеестрТекущихПлатежейЭтапы.ЭтапДоговора КАК ЭтапДоговора,
                  //|	РеестрТекущихПлатежейЭтапы.Договор.Корреспондент КАК Корреспондент,
	              |	РеестрТекущихПлатежейЭтапы.НомерПлатежногоДокумента КАК Комментарий,
	              |	РеестрТекущихПлатежейЭтапы.Ссылка КАК Основание,
	              |	РеестрТекущихПлатежейЭтапы.ЭтапДоговора.ДлительностьВыполненияРабот КАК Длительность,
	              |	РеестрТекущихПлатежейЭтапы.ЭтапДоговора.ВидДней КАК ВидДней
	              |ИЗ
	              |	Документ.РеестрТекущихПлатежей.Этапы КАК РеестрТекущихПлатежейЭтапы
	              |ГДЕ
	              |	РеестрТекущихПлатежейЭтапы.Ссылка = &Ссылка
	              |	И РеестрТекущихПлатежейЭтапы.СуммаОплатыЭтапаДоговора <> 0";
                  //| И РеестрТекущихПлатежейЭтапы.Ссылка.НаправлениеПлатежа = ЗНАЧЕНИЕ(Перечисление.М_НаправлениеПлатежа.Поступление)";

				  Результат = Запрос.ВыполнитьПакет();
  
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПокупателями", Результат[0].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаДатыДоговоров", Результат[1].Выгрузить());
		
КонецПроцедуры // ИнициализироватьДанныеДокумента()

