// Инициализирует таблицы значений, содержащие данные документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	мРеализацияНоменклатура.Ссылка.Дата КАК Период,
		|	мРеализацияНоменклатура.НоменклатураПроизводства,
		|	мРеализацияНоменклатура.Калькуляция,
		|	мРеализацияНоменклатура.Количество,
		|	мРеализацияНоменклатура.НДС,
		|	мРеализацияНоменклатура.Всего КАК Сумма,
		|	мРеализацияНоменклатура.Ссылка.Договор,
		|	мРеализацияНоменклатура.Ссылка.ЭтапДоговора
		|ИЗ
		|	Документ.мРеализация.Номенклатура КАК мРеализацияНоменклатура
		|ГДЕ
		|	мРеализацияНоменклатура.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(мРеализацияНоменклатура.Всего) КАК Сумма,
		|	СУММА(мРеализацияНоменклатура.НДС) КАК НДС,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	мРеализацияНоменклатура.Ссылка,
		|	мРеализацияНоменклатура.Ссылка.Дата КАК Период,
		|	мРеализацияНоменклатура.Ссылка.Корреспондент,
		|	мРеализацияНоменклатура.Ссылка.Договор,
		|	мРеализацияНоменклатура.Ссылка.ЭтапДоговора,
		|	мРеализацияНоменклатура.Ссылка.ЭтапДоговора.СтавкаНДС КАК СтавкаНДС,
		|	мРеализацияНоменклатура.Ссылка.ЭтапДоговора.ОсвобождениеОтНДС КАК ОсвобождениеОтНДС,
		|	мРеализацияНоменклатура.Ссылка.Дата КАК ДатаДокумента,
		|	мРеализацияНоменклатура.Ссылка.НомерТТН как НомерДокумента
		|ИЗ
		|	Документ.мРеализация.Номенклатура КАК мРеализацияНоменклатура
		|ГДЕ
		|	мРеализацияНоменклатура.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	мРеализацияНоменклатура.Ссылка,
		|	мРеализацияНоменклатура.Ссылка.Дата,
		|	мРеализацияНоменклатура.Ссылка.Корреспондент,
		|	мРеализацияНоменклатура.Ссылка.Договор,
		|	мРеализацияНоменклатура.Ссылка.ЭтапДоговора,
		|	мРеализацияНоменклатура.Ссылка.ЭтапДоговора.СтавкаНДС,
		|	мРеализацияНоменклатура.Ссылка.ЭтапДоговора.ОсвобождениеОтНДС,
		|	мРеализацияНоменклатура.Ссылка.НомерТТН";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Результат = Запрос.ВыполнитьПакет();
  
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаНоменклатураПроизводства", Результат[0].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПокупателями", Результат[1].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаУчетДоговоров", Результат[1].Выгрузить());
	
КонецПроцедуры 
