// Инициализирует таблицы значений, содержащие данные документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", НачалоДня(ДокументСсылка.Дата));
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА мСписаниеЗадолженностиАкты.Ссылка.ВидСписанияЗадолженности = ЗНАЧЕНИЕ(Перечисление.мВидыСписанияЗадолженности.НаУбытки)
	               |			ТОГДА -мСписаниеЗадолженностиАкты.Сумма
	               |		ИНАЧЕ мСписаниеЗадолженностиАкты.Сумма
	               |	КОНЕЦ КАК Сумма,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	               |	мСписаниеЗадолженностиАкты.Договор КАК Договор,
	               |	мСписаниеЗадолженностиАкты.ЭтапДоговора КАК ЭтапДоговора,
	               |	мСписаниеЗадолженностиАкты.Корреспондент КАК Корреспондент,
	               |	мСписаниеЗадолженностиАкты.Ссылка.ВидСписанияЗадолженности КАК ВидСписанияЗадолженности,
	               |	мСписаниеЗадолженностиАкты.Ссылка.Дата КАК Период
	               |ИЗ
	               |	Документ.мСписаниеЗадолженности.Акты КАК мСписаниеЗадолженностиАкты
	               |ГДЕ
	               |	мСписаниеЗадолженностиАкты.Ссылка = &Ссылка";
	
	Результат          = Запрос.Выполнить().Выгрузить();
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПокупателями", Результат);
		
КонецПроцедуры // ИнициализироватьДанныеДокумента()
