////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ВНЕШНИЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ОбменВнешнимиЗаданиямиБСПДокументооборотПередЗаписьюПередЗаписью(Источник, Отказ) Экспорт
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью("ОбменВнешнимиЗаданиямиС1СДокументооборот", Источник, Отказ);
КонецПроцедуры

Процедура ОбменВнешнимиЗаданиямиБСПДокументооборотУдалениемПередУдалением(Источник, Отказ) Экспорт
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением("ОбменВнешнимиЗаданиямиС1СДокументооборот", Источник, Отказ);
КонецПроцедуры
